{
    "citylist": [
        {
            "childs": [
                {
                    "dmId": "110101",
                    "name": "东城区"
                },
                {
                    "dmId": "110102",
                    "name": "西城区"
                },
                {
                    "dmId": "110105",
                    "name": "朝阳区"
                },
                {
                    "dmId": "110106",
                    "name": "丰台区"
                },
                {
                    "dmId": "110107",
                    "name": "石景山区"
                },
                {
                    "dmId": "110108",
                    "name": "海淀区"
                },
                {
                    "dmId": "110109",
                    "name": "门头沟区"
                },
                {
                    "dmId": "110111",
                    "name": "房山区"
                },
                {
                    "dmId": "110112",
                    "name": "通州区"
                },
                {
                    "dmId": "110113",
                    "name": "顺义区"
                },
                {
                    "dmId": "110114",
                    "name": "昌平区"
                },
                {
                    "dmId": "110115",
                    "name": "大兴区"
                },
                {
                    "dmId": "110116",
                    "name": "怀柔区"
                },
                {
                    "dmId": "110117",
                    "name": "平谷区"
                },
                {
                    "dmId": "110228",
                    "name": "密云县"
                },
                {
                    "dmId": "110229",
                    "name": "延庆县"
                }
            ],
            "dmId": "110100",
            "name": "北京市"
        },
        {
            "childs": [
                {
                    "dmId": "120101",
                    "name": "和平区"
                },
                {
                    "dmId": "120102",
                    "name": "河东区"
                },
                {
                    "dmId": "120103",
                    "name": "河西区"
                },
                {
                    "dmId": "120104",
                    "name": "南开区"
                },
                {
                    "dmId": "120105",
                    "name": "河北区"
                },
                {
                    "dmId": "120106",
                    "name": "红桥区"
                },
                {
                    "dmId": "120110",
                    "name": "东丽区"
                },
                {
                    "dmId": "120111",
                    "name": "西青区"
                },
                {
                    "dmId": "120112",
                    "name": "津南区"
                },
                {
                    "dmId": "120113",
                    "name": "北辰区"
                },
                {
                    "dmId": "120114",
                    "name": "武清区"
                },
                {
                    "dmId": "120115",
                    "name": "宝坻区"
                },
                {
                    "dmId": "120116",
                    "name": "滨海新区"
                },
                {
                    "dmId": "120221",
                    "name": "宁河县"
                },
                {
                    "dmId": "120223",
                    "name": "静海县"
                },
                {
                    "dmId": "120225",
                    "name": "蓟县"
                }
            ],
            "dmId": "120100",
            "name": "天津市"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "130102",
                            "name": "长安区"
                        },
                        {
                            "dmId": "130103",
                            "name": "桥东区"
                        },
                        {
                            "dmId": "130104",
                            "name": "桥西区"
                        },
                        {
                            "dmId": "130105",
                            "name": "新华区"
                        },
                        {
                            "dmId": "130107",
                            "name": "井陉矿区"
                        },
                        {
                            "dmId": "130108",
                            "name": "裕华区"
                        },
                        {
                            "dmId": "130121",
                            "name": "井陉县"
                        },
                        {
                            "dmId": "130123",
                            "name": "正定县"
                        },
                        {
                            "dmId": "130124",
                            "name": "栾城县"
                        },
                        {
                            "dmId": "130125",
                            "name": "行唐县"
                        },
                        {
                            "dmId": "130126",
                            "name": "灵寿县"
                        },
                        {
                            "dmId": "130127",
                            "name": "高邑县"
                        },
                        {
                            "dmId": "130128",
                            "name": "深泽县"
                        },
                        {
                            "dmId": "130129",
                            "name": "赞皇县"
                        },
                        {
                            "dmId": "130130",
                            "name": "无极县"
                        },
                        {
                            "dmId": "130131",
                            "name": "平山县"
                        },
                        {
                            "dmId": "130132",
                            "name": "元氏县"
                        },
                        {
                            "dmId": "130133",
                            "name": "赵县"
                        },
                        {
                            "dmId": "130181",
                            "name": "辛集市"
                        },
                        {
                            "dmId": "130182",
                            "name": "藁城市"
                        },
                        {
                            "dmId": "130183",
                            "name": "晋州市"
                        },
                        {
                            "dmId": "130184",
                            "name": "新乐市"
                        },
                        {
                            "dmId": "130185",
                            "name": "鹿泉市"
                        }
                    ],
                    "dmId": "130100",
                    "name": "石家庄市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130202",
                            "name": "路南区"
                        },
                        {
                            "dmId": "130203",
                            "name": "路北区"
                        },
                        {
                            "dmId": "130204",
                            "name": "古冶区"
                        },
                        {
                            "dmId": "130205",
                            "name": "开平区"
                        },
                        {
                            "dmId": "130207",
                            "name": "丰南区"
                        },
                        {
                            "dmId": "130208",
                            "name": "丰润区"
                        },
                        {
                            "dmId": "130223",
                            "name": "滦县"
                        },
                        {
                            "dmId": "130224",
                            "name": "滦南县"
                        },
                        {
                            "dmId": "130225",
                            "name": "乐亭县"
                        },
                        {
                            "dmId": "130227",
                            "name": "迁西县"
                        },
                        {
                            "dmId": "130229",
                            "name": "玉田县"
                        },
                        {
                            "dmId": "130230",
                            "name": "曹妃甸区"
                        },
                        {
                            "dmId": "130281",
                            "name": "遵化市"
                        },
                        {
                            "dmId": "130283",
                            "name": "迁安市"
                        }
                    ],
                    "dmId": "130200",
                    "name": "唐山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130302",
                            "name": "海港区"
                        },
                        {
                            "dmId": "130303",
                            "name": "山海关区"
                        },
                        {
                            "dmId": "130304",
                            "name": "北戴河区"
                        },
                        {
                            "dmId": "130321",
                            "name": "青龙满族自治县"
                        },
                        {
                            "dmId": "130322",
                            "name": "昌黎县"
                        },
                        {
                            "dmId": "130323",
                            "name": "抚宁县"
                        },
                        {
                            "dmId": "130324",
                            "name": "卢龙县"
                        }
                    ],
                    "dmId": "130300",
                    "name": "秦皇岛市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130402",
                            "name": "邯山区"
                        },
                        {
                            "dmId": "130403",
                            "name": "丛台区"
                        },
                        {
                            "dmId": "130404",
                            "name": "复兴区"
                        },
                        {
                            "dmId": "130406",
                            "name": "峰峰矿区"
                        },
                        {
                            "dmId": "130421",
                            "name": "邯郸县"
                        },
                        {
                            "dmId": "130423",
                            "name": "临漳县"
                        },
                        {
                            "dmId": "130424",
                            "name": "成安县"
                        },
                        {
                            "dmId": "130425",
                            "name": "大名县"
                        },
                        {
                            "dmId": "130426",
                            "name": "涉县"
                        },
                        {
                            "dmId": "130427",
                            "name": "磁县"
                        },
                        {
                            "dmId": "130428",
                            "name": "肥乡县"
                        },
                        {
                            "dmId": "130429",
                            "name": "永年县"
                        },
                        {
                            "dmId": "130430",
                            "name": "邱县"
                        },
                        {
                            "dmId": "130431",
                            "name": "鸡泽县"
                        },
                        {
                            "dmId": "130432",
                            "name": "广平县"
                        },
                        {
                            "dmId": "130433",
                            "name": "馆陶县"
                        },
                        {
                            "dmId": "130434",
                            "name": "魏县"
                        },
                        {
                            "dmId": "130435",
                            "name": "曲周县"
                        },
                        {
                            "dmId": "130481",
                            "name": "武安市"
                        }
                    ],
                    "dmId": "130400",
                    "name": "邯郸市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130502",
                            "name": "桥东区"
                        },
                        {
                            "dmId": "130503",
                            "name": "桥西区"
                        },
                        {
                            "dmId": "130521",
                            "name": "邢台县"
                        },
                        {
                            "dmId": "130522",
                            "name": "临城县"
                        },
                        {
                            "dmId": "130523",
                            "name": "内丘县"
                        },
                        {
                            "dmId": "130524",
                            "name": "柏乡县"
                        },
                        {
                            "dmId": "130525",
                            "name": "隆尧县"
                        },
                        {
                            "dmId": "130526",
                            "name": "任县"
                        },
                        {
                            "dmId": "130527",
                            "name": "南和县"
                        },
                        {
                            "dmId": "130528",
                            "name": "宁晋县"
                        },
                        {
                            "dmId": "130529",
                            "name": "巨鹿县"
                        },
                        {
                            "dmId": "130530",
                            "name": "新河县"
                        },
                        {
                            "dmId": "130531",
                            "name": "广宗县"
                        },
                        {
                            "dmId": "130532",
                            "name": "平乡县"
                        },
                        {
                            "dmId": "130533",
                            "name": "威县"
                        },
                        {
                            "dmId": "130534",
                            "name": "清河县"
                        },
                        {
                            "dmId": "130535",
                            "name": "临西县"
                        },
                        {
                            "dmId": "130581",
                            "name": "南宫市"
                        },
                        {
                            "dmId": "130582",
                            "name": "沙河市"
                        }
                    ],
                    "dmId": "130500",
                    "name": "邢台市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130602",
                            "name": "新市区"
                        },
                        {
                            "dmId": "130603",
                            "name": "北市区"
                        },
                        {
                            "dmId": "130604",
                            "name": "南市区"
                        },
                        {
                            "dmId": "130621",
                            "name": "满城县"
                        },
                        {
                            "dmId": "130622",
                            "name": "清苑县"
                        },
                        {
                            "dmId": "130623",
                            "name": "涞水县"
                        },
                        {
                            "dmId": "130624",
                            "name": "阜平县"
                        },
                        {
                            "dmId": "130625",
                            "name": "徐水县"
                        },
                        {
                            "dmId": "130626",
                            "name": "定兴县"
                        },
                        {
                            "dmId": "130627",
                            "name": "唐县"
                        },
                        {
                            "dmId": "130628",
                            "name": "高阳县"
                        },
                        {
                            "dmId": "130629",
                            "name": "容城县"
                        },
                        {
                            "dmId": "130630",
                            "name": "涞源县"
                        },
                        {
                            "dmId": "130631",
                            "name": "望都县"
                        },
                        {
                            "dmId": "130632",
                            "name": "安新县"
                        },
                        {
                            "dmId": "130633",
                            "name": "易县"
                        },
                        {
                            "dmId": "130634",
                            "name": "曲阳县"
                        },
                        {
                            "dmId": "130635",
                            "name": "蠡县"
                        },
                        {
                            "dmId": "130636",
                            "name": "顺平县"
                        },
                        {
                            "dmId": "130637",
                            "name": "博野县"
                        },
                        {
                            "dmId": "130638",
                            "name": "雄县"
                        },
                        {
                            "dmId": "130681",
                            "name": "涿州市"
                        },
                        {
                            "dmId": "130682",
                            "name": "定州市"
                        },
                        {
                            "dmId": "130683",
                            "name": "安国市"
                        },
                        {
                            "dmId": "130684",
                            "name": "高碑店市"
                        }
                    ],
                    "dmId": "130600",
                    "name": "保定市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130702",
                            "name": "桥东区"
                        },
                        {
                            "dmId": "130703",
                            "name": "桥西区"
                        },
                        {
                            "dmId": "130705",
                            "name": "宣化区"
                        },
                        {
                            "dmId": "130706",
                            "name": "下花园区"
                        },
                        {
                            "dmId": "130721",
                            "name": "宣化县"
                        },
                        {
                            "dmId": "130722",
                            "name": "张北县"
                        },
                        {
                            "dmId": "130723",
                            "name": "康保县"
                        },
                        {
                            "dmId": "130724",
                            "name": "沽源县"
                        },
                        {
                            "dmId": "130725",
                            "name": "尚义县"
                        },
                        {
                            "dmId": "130726",
                            "name": "蔚县"
                        },
                        {
                            "dmId": "130727",
                            "name": "阳原县"
                        },
                        {
                            "dmId": "130728",
                            "name": "怀安县"
                        },
                        {
                            "dmId": "130729",
                            "name": "万全县"
                        },
                        {
                            "dmId": "130730",
                            "name": "怀来县"
                        },
                        {
                            "dmId": "130731",
                            "name": "涿鹿县"
                        },
                        {
                            "dmId": "130732",
                            "name": "赤城县"
                        },
                        {
                            "dmId": "130733",
                            "name": "崇礼县"
                        }
                    ],
                    "dmId": "130700",
                    "name": "张家口市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130802",
                            "name": "双桥区"
                        },
                        {
                            "dmId": "130803",
                            "name": "双滦区"
                        },
                        {
                            "dmId": "130804",
                            "name": "鹰手营子矿区"
                        },
                        {
                            "dmId": "130821",
                            "name": "承德县"
                        },
                        {
                            "dmId": "130822",
                            "name": "兴隆县"
                        },
                        {
                            "dmId": "130823",
                            "name": "平泉县"
                        },
                        {
                            "dmId": "130824",
                            "name": "滦平县"
                        },
                        {
                            "dmId": "130825",
                            "name": "隆化县"
                        },
                        {
                            "dmId": "130826",
                            "name": "丰宁满族自治县"
                        },
                        {
                            "dmId": "130827",
                            "name": "宽城满族自治县"
                        },
                        {
                            "dmId": "130828",
                            "name": "围场满族蒙古族自治县"
                        }
                    ],
                    "dmId": "130800",
                    "name": "承德市"
                },
                {
                    "childs": [
                        {
                            "dmId": "130902",
                            "name": "新华区"
                        },
                        {
                            "dmId": "130903",
                            "name": "运河区"
                        },
                        {
                            "dmId": "130921",
                            "name": "沧县"
                        },
                        {
                            "dmId": "130922",
                            "name": "青县"
                        },
                        {
                            "dmId": "130923",
                            "name": "东光县"
                        },
                        {
                            "dmId": "130924",
                            "name": "海兴县"
                        },
                        {
                            "dmId": "130925",
                            "name": "盐山县"
                        },
                        {
                            "dmId": "130926",
                            "name": "肃宁县"
                        },
                        {
                            "dmId": "130927",
                            "name": "南皮县"
                        },
                        {
                            "dmId": "130928",
                            "name": "吴桥县"
                        },
                        {
                            "dmId": "130929",
                            "name": "献县"
                        },
                        {
                            "dmId": "130930",
                            "name": "孟村回族自治县"
                        },
                        {
                            "dmId": "130981",
                            "name": "泊头市"
                        },
                        {
                            "dmId": "130982",
                            "name": "任丘市"
                        },
                        {
                            "dmId": "130983",
                            "name": "黄骅市"
                        },
                        {
                            "dmId": "130984",
                            "name": "河间市"
                        }
                    ],
                    "dmId": "130900",
                    "name": "沧州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "131002",
                            "name": "安次区"
                        },
                        {
                            "dmId": "131003",
                            "name": "广阳区"
                        },
                        {
                            "dmId": "131022",
                            "name": "固安县"
                        },
                        {
                            "dmId": "131023",
                            "name": "永清县"
                        },
                        {
                            "dmId": "131024",
                            "name": "香河县"
                        },
                        {
                            "dmId": "131025",
                            "name": "大城县"
                        },
                        {
                            "dmId": "131026",
                            "name": "文安县"
                        },
                        {
                            "dmId": "131028",
                            "name": "大厂回族自治县"
                        },
                        {
                            "dmId": "131081",
                            "name": "霸州市"
                        },
                        {
                            "dmId": "131082",
                            "name": "三河市"
                        }
                    ],
                    "dmId": "131000",
                    "name": "廊坊市"
                },
                {
                    "childs": [
                        {
                            "dmId": "131102",
                            "name": "桃城区"
                        },
                        {
                            "dmId": "131121",
                            "name": "枣强县"
                        },
                        {
                            "dmId": "131122",
                            "name": "武邑县"
                        },
                        {
                            "dmId": "131123",
                            "name": "武强县"
                        },
                        {
                            "dmId": "131124",
                            "name": "饶阳县"
                        },
                        {
                            "dmId": "131125",
                            "name": "安平县"
                        },
                        {
                            "dmId": "131126",
                            "name": "故城县"
                        },
                        {
                            "dmId": "131127",
                            "name": "景县"
                        },
                        {
                            "dmId": "131128",
                            "name": "阜城县"
                        },
                        {
                            "dmId": "131181",
                            "name": "冀州市"
                        },
                        {
                            "dmId": "131182",
                            "name": "深州市"
                        }
                    ],
                    "dmId": "131100",
                    "name": "衡水市"
                }
            ],
            "dmId": "130000",
            "name": "河北省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "140105",
                            "name": "小店区"
                        },
                        {
                            "dmId": "140106",
                            "name": "迎泽区"
                        },
                        {
                            "dmId": "140107",
                            "name": "杏花岭区"
                        },
                        {
                            "dmId": "140108",
                            "name": "尖草坪区"
                        },
                        {
                            "dmId": "140109",
                            "name": "万柏林区"
                        },
                        {
                            "dmId": "140110",
                            "name": "晋源区"
                        },
                        {
                            "dmId": "140121",
                            "name": "清徐县"
                        },
                        {
                            "dmId": "140122",
                            "name": "阳曲县"
                        },
                        {
                            "dmId": "140123",
                            "name": "娄烦县"
                        },
                        {
                            "dmId": "140181",
                            "name": "古交市"
                        }
                    ],
                    "dmId": "140100",
                    "name": "太原市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140202",
                            "name": "城区"
                        },
                        {
                            "dmId": "140203",
                            "name": "矿区"
                        },
                        {
                            "dmId": "140211",
                            "name": "南郊区"
                        },
                        {
                            "dmId": "140212",
                            "name": "新荣区"
                        },
                        {
                            "dmId": "140221",
                            "name": "阳高县"
                        },
                        {
                            "dmId": "140222",
                            "name": "天镇县"
                        },
                        {
                            "dmId": "140223",
                            "name": "广灵县"
                        },
                        {
                            "dmId": "140224",
                            "name": "灵丘县"
                        },
                        {
                            "dmId": "140225",
                            "name": "浑源县"
                        },
                        {
                            "dmId": "140226",
                            "name": "左云县"
                        },
                        {
                            "dmId": "140227",
                            "name": "大同县"
                        }
                    ],
                    "dmId": "140200",
                    "name": "大同市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140302",
                            "name": "城区"
                        },
                        {
                            "dmId": "140303",
                            "name": "矿区"
                        },
                        {
                            "dmId": "140311",
                            "name": "郊区"
                        },
                        {
                            "dmId": "140321",
                            "name": "平定县"
                        },
                        {
                            "dmId": "140322",
                            "name": "盂县"
                        }
                    ],
                    "dmId": "140300",
                    "name": "阳泉市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140421",
                            "name": "长治县"
                        },
                        {
                            "dmId": "140423",
                            "name": "襄垣县"
                        },
                        {
                            "dmId": "140424",
                            "name": "屯留县"
                        },
                        {
                            "dmId": "140425",
                            "name": "平顺县"
                        },
                        {
                            "dmId": "140426",
                            "name": "黎城县"
                        },
                        {
                            "dmId": "140427",
                            "name": "壶关县"
                        },
                        {
                            "dmId": "140428",
                            "name": "长子县"
                        },
                        {
                            "dmId": "140429",
                            "name": "武乡县"
                        },
                        {
                            "dmId": "140430",
                            "name": "沁县"
                        },
                        {
                            "dmId": "140431",
                            "name": "沁源县"
                        },
                        {
                            "dmId": "140481",
                            "name": "潞城市"
                        },
                        {
                            "dmId": "140482",
                            "name": "城区"
                        },
                        {
                            "dmId": "140483",
                            "name": "郊区"
                        }
                    ],
                    "dmId": "140400",
                    "name": "长治市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140502",
                            "name": "城区"
                        },
                        {
                            "dmId": "140521",
                            "name": "沁水县"
                        },
                        {
                            "dmId": "140522",
                            "name": "阳城县"
                        },
                        {
                            "dmId": "140524",
                            "name": "陵川县"
                        },
                        {
                            "dmId": "140525",
                            "name": "泽州县"
                        },
                        {
                            "dmId": "140581",
                            "name": "高平市"
                        }
                    ],
                    "dmId": "140500",
                    "name": "晋城市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140602",
                            "name": "朔城区"
                        },
                        {
                            "dmId": "140603",
                            "name": "平鲁区"
                        },
                        {
                            "dmId": "140621",
                            "name": "山阴县"
                        },
                        {
                            "dmId": "140622",
                            "name": "应县"
                        },
                        {
                            "dmId": "140623",
                            "name": "右玉县"
                        },
                        {
                            "dmId": "140624",
                            "name": "怀仁县"
                        }
                    ],
                    "dmId": "140600",
                    "name": "朔州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140702",
                            "name": "榆次区"
                        },
                        {
                            "dmId": "140721",
                            "name": "榆社县"
                        },
                        {
                            "dmId": "140722",
                            "name": "左权县"
                        },
                        {
                            "dmId": "140723",
                            "name": "和顺县"
                        },
                        {
                            "dmId": "140724",
                            "name": "昔阳县"
                        },
                        {
                            "dmId": "140725",
                            "name": "寿阳县"
                        },
                        {
                            "dmId": "140726",
                            "name": "太谷县"
                        },
                        {
                            "dmId": "140727",
                            "name": "祁县"
                        },
                        {
                            "dmId": "140728",
                            "name": "平遥县"
                        },
                        {
                            "dmId": "140729",
                            "name": "灵石县"
                        },
                        {
                            "dmId": "140781",
                            "name": "介休市"
                        }
                    ],
                    "dmId": "140700",
                    "name": "晋中市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140802",
                            "name": "盐湖区"
                        },
                        {
                            "dmId": "140821",
                            "name": "临猗县"
                        },
                        {
                            "dmId": "140822",
                            "name": "万荣县"
                        },
                        {
                            "dmId": "140823",
                            "name": "闻喜县"
                        },
                        {
                            "dmId": "140824",
                            "name": "稷山县"
                        },
                        {
                            "dmId": "140825",
                            "name": "新绛县"
                        },
                        {
                            "dmId": "140826",
                            "name": "绛县"
                        },
                        {
                            "dmId": "140827",
                            "name": "垣曲县"
                        },
                        {
                            "dmId": "140828",
                            "name": "夏县"
                        },
                        {
                            "dmId": "140829",
                            "name": "平陆县"
                        },
                        {
                            "dmId": "140830",
                            "name": "芮城县"
                        },
                        {
                            "dmId": "140881",
                            "name": "永济市"
                        },
                        {
                            "dmId": "140882",
                            "name": "河津市"
                        }
                    ],
                    "dmId": "140800",
                    "name": "运城市"
                },
                {
                    "childs": [
                        {
                            "dmId": "140902",
                            "name": "忻府区"
                        },
                        {
                            "dmId": "140921",
                            "name": "定襄县"
                        },
                        {
                            "dmId": "140922",
                            "name": "五台县"
                        },
                        {
                            "dmId": "140923",
                            "name": "代县"
                        },
                        {
                            "dmId": "140924",
                            "name": "繁峙县"
                        },
                        {
                            "dmId": "140925",
                            "name": "宁武县"
                        },
                        {
                            "dmId": "140926",
                            "name": "静乐县"
                        },
                        {
                            "dmId": "140927",
                            "name": "神池县"
                        },
                        {
                            "dmId": "140928",
                            "name": "五寨县"
                        },
                        {
                            "dmId": "140929",
                            "name": "岢岚县"
                        },
                        {
                            "dmId": "140930",
                            "name": "河曲县"
                        },
                        {
                            "dmId": "140931",
                            "name": "保德县"
                        },
                        {
                            "dmId": "140932",
                            "name": "偏关县"
                        },
                        {
                            "dmId": "140981",
                            "name": "原平市"
                        }
                    ],
                    "dmId": "140900",
                    "name": "忻州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "141002",
                            "name": "尧都区"
                        },
                        {
                            "dmId": "141021",
                            "name": "曲沃县"
                        },
                        {
                            "dmId": "141022",
                            "name": "翼城县"
                        },
                        {
                            "dmId": "141023",
                            "name": "襄汾县"
                        },
                        {
                            "dmId": "141024",
                            "name": "洪洞县"
                        },
                        {
                            "dmId": "141025",
                            "name": "古县"
                        },
                        {
                            "dmId": "141026",
                            "name": "安泽县"
                        },
                        {
                            "dmId": "141027",
                            "name": "浮山县"
                        },
                        {
                            "dmId": "141028",
                            "name": "吉县"
                        },
                        {
                            "dmId": "141029",
                            "name": "乡宁县"
                        },
                        {
                            "dmId": "141030",
                            "name": "大宁县"
                        },
                        {
                            "dmId": "141031",
                            "name": "隰县"
                        },
                        {
                            "dmId": "141032",
                            "name": "永和县"
                        },
                        {
                            "dmId": "141033",
                            "name": "蒲县"
                        },
                        {
                            "dmId": "141034",
                            "name": "汾西县"
                        },
                        {
                            "dmId": "141081",
                            "name": "侯马市"
                        },
                        {
                            "dmId": "141082",
                            "name": "霍州市"
                        }
                    ],
                    "dmId": "141000",
                    "name": "临汾市"
                },
                {
                    "childs": [
                        {
                            "dmId": "141102",
                            "name": "离石区"
                        },
                        {
                            "dmId": "141121",
                            "name": "文水县"
                        },
                        {
                            "dmId": "141122",
                            "name": "交城县"
                        },
                        {
                            "dmId": "141123",
                            "name": "兴县"
                        },
                        {
                            "dmId": "141124",
                            "name": "临县"
                        },
                        {
                            "dmId": "141125",
                            "name": "柳林县"
                        },
                        {
                            "dmId": "141126",
                            "name": "石楼县"
                        },
                        {
                            "dmId": "141127",
                            "name": "岚县"
                        },
                        {
                            "dmId": "141128",
                            "name": "方山县"
                        },
                        {
                            "dmId": "141129",
                            "name": "中阳县"
                        },
                        {
                            "dmId": "141130",
                            "name": "交口县"
                        },
                        {
                            "dmId": "141181",
                            "name": "孝义市"
                        },
                        {
                            "dmId": "141182",
                            "name": "汾阳市"
                        }
                    ],
                    "dmId": "141100",
                    "name": "吕梁市"
                }
            ],
            "dmId": "140000",
            "name": "山西省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "150102",
                            "name": "新城区"
                        },
                        {
                            "dmId": "150103",
                            "name": "回民区"
                        },
                        {
                            "dmId": "150104",
                            "name": "玉泉区"
                        },
                        {
                            "dmId": "150105",
                            "name": "赛罕区"
                        },
                        {
                            "dmId": "150121",
                            "name": "土默特左旗"
                        },
                        {
                            "dmId": "150122",
                            "name": "托克托县"
                        },
                        {
                            "dmId": "150123",
                            "name": "和林格尔县"
                        },
                        {
                            "dmId": "150124",
                            "name": "清水河县"
                        },
                        {
                            "dmId": "150125",
                            "name": "武川县"
                        }
                    ],
                    "dmId": "150100",
                    "name": "呼和浩特市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150202",
                            "name": "东河区"
                        },
                        {
                            "dmId": "150203",
                            "name": "昆都仑区"
                        },
                        {
                            "dmId": "150204",
                            "name": "青山区"
                        },
                        {
                            "dmId": "150205",
                            "name": "石拐区"
                        },
                        {
                            "dmId": "150206",
                            "name": "白云鄂博矿区"
                        },
                        {
                            "dmId": "150207",
                            "name": "九原区"
                        },
                        {
                            "dmId": "150221",
                            "name": "土默特右旗"
                        },
                        {
                            "dmId": "150222",
                            "name": "固阳县"
                        },
                        {
                            "dmId": "150223",
                            "name": "达尔罕茂明安联合旗"
                        }
                    ],
                    "dmId": "150200",
                    "name": "包头市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150302",
                            "name": "海勃湾区"
                        },
                        {
                            "dmId": "150303",
                            "name": "海南区"
                        },
                        {
                            "dmId": "150304",
                            "name": "乌达区"
                        }
                    ],
                    "dmId": "150300",
                    "name": "乌海市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150402",
                            "name": "红山区"
                        },
                        {
                            "dmId": "150403",
                            "name": "元宝山区"
                        },
                        {
                            "dmId": "150404",
                            "name": "松山区"
                        },
                        {
                            "dmId": "150421",
                            "name": "阿鲁科尔沁旗"
                        },
                        {
                            "dmId": "150422",
                            "name": "巴林左旗"
                        },
                        {
                            "dmId": "150423",
                            "name": "巴林右旗"
                        },
                        {
                            "dmId": "150424",
                            "name": "林西县"
                        },
                        {
                            "dmId": "150425",
                            "name": "克什克腾旗"
                        },
                        {
                            "dmId": "150426",
                            "name": "翁牛特旗"
                        },
                        {
                            "dmId": "150428",
                            "name": "喀喇沁旗"
                        },
                        {
                            "dmId": "150429",
                            "name": "宁城县"
                        },
                        {
                            "dmId": "150430",
                            "name": "敖汉旗"
                        }
                    ],
                    "dmId": "150400",
                    "name": "赤峰市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150502",
                            "name": "科尔沁区"
                        },
                        {
                            "dmId": "150521",
                            "name": "科尔沁左翼中旗"
                        },
                        {
                            "dmId": "150522",
                            "name": "科尔沁左翼后旗"
                        },
                        {
                            "dmId": "150523",
                            "name": "开鲁县"
                        },
                        {
                            "dmId": "150524",
                            "name": "库伦旗"
                        },
                        {
                            "dmId": "150525",
                            "name": "奈曼旗"
                        },
                        {
                            "dmId": "150526",
                            "name": "扎鲁特旗"
                        },
                        {
                            "dmId": "150581",
                            "name": "霍林郭勒市"
                        }
                    ],
                    "dmId": "150500",
                    "name": "通辽市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150602",
                            "name": "东胜区"
                        },
                        {
                            "dmId": "150621",
                            "name": "达拉特旗"
                        },
                        {
                            "dmId": "150622",
                            "name": "准格尔旗"
                        },
                        {
                            "dmId": "150623",
                            "name": "鄂托克前旗"
                        },
                        {
                            "dmId": "150624",
                            "name": "鄂托克旗"
                        },
                        {
                            "dmId": "150625",
                            "name": "杭锦旗"
                        },
                        {
                            "dmId": "150626",
                            "name": "乌审旗"
                        },
                        {
                            "dmId": "150627",
                            "name": "伊金霍洛旗"
                        }
                    ],
                    "dmId": "150600",
                    "name": "鄂尔多斯市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150702",
                            "name": "海拉尔区"
                        },
                        {
                            "dmId": "150703",
                            "name": "扎赉诺尔区"
                        },
                        {
                            "dmId": "150721",
                            "name": "阿荣旗"
                        },
                        {
                            "dmId": "150722",
                            "name": "莫力达瓦达斡尔族自治旗"
                        },
                        {
                            "dmId": "150723",
                            "name": "鄂伦春自治旗"
                        },
                        {
                            "dmId": "150724",
                            "name": "鄂温克族自治旗"
                        },
                        {
                            "dmId": "150725",
                            "name": "陈巴尔虎旗"
                        },
                        {
                            "dmId": "150726",
                            "name": "新巴尔虎左旗"
                        },
                        {
                            "dmId": "150727",
                            "name": "新巴尔虎右旗"
                        },
                        {
                            "dmId": "150781",
                            "name": "满洲里市"
                        },
                        {
                            "dmId": "150782",
                            "name": "牙克石市"
                        },
                        {
                            "dmId": "150783",
                            "name": "扎兰屯市"
                        },
                        {
                            "dmId": "150784",
                            "name": "额尔古纳市"
                        },
                        {
                            "dmId": "150785",
                            "name": "根河市"
                        }
                    ],
                    "dmId": "150700",
                    "name": "呼伦贝尔市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150802",
                            "name": "临河区"
                        },
                        {
                            "dmId": "150821",
                            "name": "五原县"
                        },
                        {
                            "dmId": "150822",
                            "name": "磴口县"
                        },
                        {
                            "dmId": "150823",
                            "name": "乌拉特前旗"
                        },
                        {
                            "dmId": "150824",
                            "name": "乌拉特中旗"
                        },
                        {
                            "dmId": "150825",
                            "name": "乌拉特后旗"
                        },
                        {
                            "dmId": "150826",
                            "name": "杭锦后旗"
                        }
                    ],
                    "dmId": "150800",
                    "name": "巴彦淖尔市"
                },
                {
                    "childs": [
                        {
                            "dmId": "150902",
                            "name": "集宁区"
                        },
                        {
                            "dmId": "150921",
                            "name": "卓资县"
                        },
                        {
                            "dmId": "150922",
                            "name": "化德县"
                        },
                        {
                            "dmId": "150923",
                            "name": "商都县"
                        },
                        {
                            "dmId": "150924",
                            "name": "兴和县"
                        },
                        {
                            "dmId": "150925",
                            "name": "凉城县"
                        },
                        {
                            "dmId": "150926",
                            "name": "察哈尔右翼前旗"
                        },
                        {
                            "dmId": "150927",
                            "name": "察哈尔右翼中旗"
                        },
                        {
                            "dmId": "150928",
                            "name": "察哈尔右翼后旗"
                        },
                        {
                            "dmId": "150929",
                            "name": "四子王旗"
                        },
                        {
                            "dmId": "150981",
                            "name": "丰镇市"
                        }
                    ],
                    "dmId": "150900",
                    "name": "乌兰察布市"
                },
                {
                    "childs": [
                        {
                            "dmId": "152201",
                            "name": "乌兰浩特市"
                        },
                        {
                            "dmId": "152202",
                            "name": "阿尔山市"
                        },
                        {
                            "dmId": "152221",
                            "name": "科尔沁右翼前旗"
                        },
                        {
                            "dmId": "152222",
                            "name": "科尔沁右翼中旗"
                        },
                        {
                            "dmId": "152223",
                            "name": "扎赉特旗"
                        },
                        {
                            "dmId": "152224",
                            "name": "突泉县"
                        }
                    ],
                    "dmId": "152200",
                    "name": "兴安盟"
                },
                {
                    "childs": [
                        {
                            "dmId": "152501",
                            "name": "二连浩特市"
                        },
                        {
                            "dmId": "152502",
                            "name": "锡林浩特市"
                        },
                        {
                            "dmId": "152522",
                            "name": "阿巴嘎旗"
                        },
                        {
                            "dmId": "152523",
                            "name": "苏尼特左旗"
                        },
                        {
                            "dmId": "152524",
                            "name": "苏尼特右旗"
                        },
                        {
                            "dmId": "152525",
                            "name": "东乌珠穆沁旗"
                        },
                        {
                            "dmId": "152526",
                            "name": "西乌珠穆沁旗"
                        },
                        {
                            "dmId": "152527",
                            "name": "太仆寺旗"
                        },
                        {
                            "dmId": "152528",
                            "name": "镶黄旗"
                        },
                        {
                            "dmId": "152529",
                            "name": "正镶白旗"
                        },
                        {
                            "dmId": "152530",
                            "name": "正蓝旗"
                        },
                        {
                            "dmId": "152531",
                            "name": "多伦县"
                        }
                    ],
                    "dmId": "152500",
                    "name": "锡林郭勒盟"
                },
                {
                    "childs": [
                        {
                            "dmId": "152921",
                            "name": "阿拉善左旗"
                        },
                        {
                            "dmId": "152922",
                            "name": "阿拉善右旗"
                        },
                        {
                            "dmId": "152923",
                            "name": "额济纳旗"
                        }
                    ],
                    "dmId": "152900",
                    "name": "阿拉善盟"
                }
            ],
            "dmId": "150000",
            "name": "内蒙古自治区"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "210102",
                            "name": "和平区"
                        },
                        {
                            "dmId": "210103",
                            "name": "沈河区"
                        },
                        {
                            "dmId": "210104",
                            "name": "大东区"
                        },
                        {
                            "dmId": "210105",
                            "name": "皇姑区"
                        },
                        {
                            "dmId": "210106",
                            "name": "铁西区"
                        },
                        {
                            "dmId": "210111",
                            "name": "苏家屯区"
                        },
                        {
                            "dmId": "210112",
                            "name": "东陵区"
                        },
                        {
                            "dmId": "210114",
                            "name": "于洪区"
                        },
                        {
                            "dmId": "210122",
                            "name": "辽中县"
                        },
                        {
                            "dmId": "210123",
                            "name": "康平县"
                        },
                        {
                            "dmId": "210124",
                            "name": "法库县"
                        },
                        {
                            "dmId": "210181",
                            "name": "新民市"
                        },
                        {
                            "dmId": "210184",
                            "name": "沈北新区"
                        }
                    ],
                    "dmId": "210100",
                    "name": "沈阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210202",
                            "name": "中山区"
                        },
                        {
                            "dmId": "210203",
                            "name": "西岗区"
                        },
                        {
                            "dmId": "210204",
                            "name": "沙河口区"
                        },
                        {
                            "dmId": "210211",
                            "name": "甘井子区"
                        },
                        {
                            "dmId": "210212",
                            "name": "旅顺口区"
                        },
                        {
                            "dmId": "210213",
                            "name": "金州区"
                        },
                        {
                            "dmId": "210224",
                            "name": "长海县"
                        },
                        {
                            "dmId": "210281",
                            "name": "瓦房店市"
                        },
                        {
                            "dmId": "210282",
                            "name": "普兰店市"
                        },
                        {
                            "dmId": "210283",
                            "name": "庄河市"
                        }
                    ],
                    "dmId": "210200",
                    "name": "大连市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210302",
                            "name": "铁东区"
                        },
                        {
                            "dmId": "210303",
                            "name": "铁西区"
                        },
                        {
                            "dmId": "210304",
                            "name": "立山区"
                        },
                        {
                            "dmId": "210311",
                            "name": "千山区"
                        },
                        {
                            "dmId": "210321",
                            "name": "台安县"
                        },
                        {
                            "dmId": "210323",
                            "name": "岫岩满族自治县"
                        },
                        {
                            "dmId": "210381",
                            "name": "海城市"
                        }
                    ],
                    "dmId": "210300",
                    "name": "鞍山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210402",
                            "name": "新抚区"
                        },
                        {
                            "dmId": "210403",
                            "name": "东洲区"
                        },
                        {
                            "dmId": "210404",
                            "name": "望花区"
                        },
                        {
                            "dmId": "210411",
                            "name": "顺城区"
                        },
                        {
                            "dmId": "210421",
                            "name": "抚顺县"
                        },
                        {
                            "dmId": "210422",
                            "name": "新宾满族自治县"
                        },
                        {
                            "dmId": "210423",
                            "name": "清原满族自治县"
                        }
                    ],
                    "dmId": "210400",
                    "name": "抚顺市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210502",
                            "name": "平山区"
                        },
                        {
                            "dmId": "210503",
                            "name": "溪湖区"
                        },
                        {
                            "dmId": "210504",
                            "name": "明山区"
                        },
                        {
                            "dmId": "210505",
                            "name": "南芬区"
                        },
                        {
                            "dmId": "210521",
                            "name": "本溪满族自治县"
                        },
                        {
                            "dmId": "210522",
                            "name": "桓仁满族自治县"
                        }
                    ],
                    "dmId": "210500",
                    "name": "本溪市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210602",
                            "name": "元宝区"
                        },
                        {
                            "dmId": "210603",
                            "name": "振兴区"
                        },
                        {
                            "dmId": "210604",
                            "name": "振安区"
                        },
                        {
                            "dmId": "210624",
                            "name": "宽甸满族自治县"
                        },
                        {
                            "dmId": "210681",
                            "name": "东港市"
                        },
                        {
                            "dmId": "210682",
                            "name": "凤城市"
                        }
                    ],
                    "dmId": "210600",
                    "name": "丹东市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210702",
                            "name": "古塔区"
                        },
                        {
                            "dmId": "210703",
                            "name": "凌河区"
                        },
                        {
                            "dmId": "210711",
                            "name": "太和区"
                        },
                        {
                            "dmId": "210726",
                            "name": "黑山县"
                        },
                        {
                            "dmId": "210727",
                            "name": "义县"
                        },
                        {
                            "dmId": "210781",
                            "name": "凌海市"
                        },
                        {
                            "dmId": "210782",
                            "name": "北镇市"
                        }
                    ],
                    "dmId": "210700",
                    "name": "锦州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210802",
                            "name": "站前区"
                        },
                        {
                            "dmId": "210803",
                            "name": "西市区"
                        },
                        {
                            "dmId": "210804",
                            "name": "鲅鱼圈区"
                        },
                        {
                            "dmId": "210811",
                            "name": "老边区"
                        },
                        {
                            "dmId": "210881",
                            "name": "盖州市"
                        },
                        {
                            "dmId": "210882",
                            "name": "大石桥市"
                        }
                    ],
                    "dmId": "210800",
                    "name": "营口市"
                },
                {
                    "childs": [
                        {
                            "dmId": "210902",
                            "name": "海州区"
                        },
                        {
                            "dmId": "210903",
                            "name": "新邱区"
                        },
                        {
                            "dmId": "210904",
                            "name": "太平区"
                        },
                        {
                            "dmId": "210905",
                            "name": "清河门区"
                        },
                        {
                            "dmId": "210911",
                            "name": "细河区"
                        },
                        {
                            "dmId": "210921",
                            "name": "阜新蒙古族自治县"
                        },
                        {
                            "dmId": "210922",
                            "name": "彰武县"
                        }
                    ],
                    "dmId": "210900",
                    "name": "阜新市"
                },
                {
                    "childs": [
                        {
                            "dmId": "211002",
                            "name": "白塔区"
                        },
                        {
                            "dmId": "211003",
                            "name": "文圣区"
                        },
                        {
                            "dmId": "211004",
                            "name": "宏伟区"
                        },
                        {
                            "dmId": "211005",
                            "name": "弓长岭区"
                        },
                        {
                            "dmId": "211011",
                            "name": "太子河区"
                        },
                        {
                            "dmId": "211021",
                            "name": "辽阳县"
                        },
                        {
                            "dmId": "211081",
                            "name": "灯塔市"
                        }
                    ],
                    "dmId": "211000",
                    "name": "辽阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "211102",
                            "name": "双台子区"
                        },
                        {
                            "dmId": "211103",
                            "name": "兴隆台区"
                        },
                        {
                            "dmId": "211121",
                            "name": "大洼县"
                        },
                        {
                            "dmId": "211122",
                            "name": "盘山县"
                        }
                    ],
                    "dmId": "211100",
                    "name": "盘锦市"
                },
                {
                    "childs": [
                        {
                            "dmId": "211202",
                            "name": "银州区"
                        },
                        {
                            "dmId": "211204",
                            "name": "清河区"
                        },
                        {
                            "dmId": "211221",
                            "name": "铁岭县"
                        },
                        {
                            "dmId": "211223",
                            "name": "西丰县"
                        },
                        {
                            "dmId": "211224",
                            "name": "昌图县"
                        },
                        {
                            "dmId": "211281",
                            "name": "调兵山市"
                        },
                        {
                            "dmId": "211282",
                            "name": "开原市"
                        }
                    ],
                    "dmId": "211200",
                    "name": "铁岭市"
                },
                {
                    "childs": [
                        {
                            "dmId": "211302",
                            "name": "双塔区"
                        },
                        {
                            "dmId": "211303",
                            "name": "龙城区"
                        },
                        {
                            "dmId": "211321",
                            "name": "朝阳县"
                        },
                        {
                            "dmId": "211322",
                            "name": "建平县"
                        },
                        {
                            "dmId": "211324",
                            "name": "喀喇沁左翼蒙古族自治县"
                        },
                        {
                            "dmId": "211381",
                            "name": "北票市"
                        },
                        {
                            "dmId": "211382",
                            "name": "凌源市"
                        }
                    ],
                    "dmId": "211300",
                    "name": "朝阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "211402",
                            "name": "连山区"
                        },
                        {
                            "dmId": "211403",
                            "name": "龙港区"
                        },
                        {
                            "dmId": "211404",
                            "name": "南票区"
                        },
                        {
                            "dmId": "211421",
                            "name": "绥中县"
                        },
                        {
                            "dmId": "211422",
                            "name": "建昌县"
                        },
                        {
                            "dmId": "211481",
                            "name": "兴城市"
                        }
                    ],
                    "dmId": "211400",
                    "name": "葫芦岛市"
                }
            ],
            "dmId": "210000",
            "name": "辽宁省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "220102",
                            "name": "南关区"
                        },
                        {
                            "dmId": "220103",
                            "name": "宽城区"
                        },
                        {
                            "dmId": "220104",
                            "name": "朝阳区"
                        },
                        {
                            "dmId": "220105",
                            "name": "二道区"
                        },
                        {
                            "dmId": "220106",
                            "name": "绿园区"
                        },
                        {
                            "dmId": "220112",
                            "name": "双阳区"
                        },
                        {
                            "dmId": "220122",
                            "name": "农安县"
                        },
                        {
                            "dmId": "220181",
                            "name": "九台市"
                        },
                        {
                            "dmId": "220182",
                            "name": "榆树市"
                        },
                        {
                            "dmId": "220183",
                            "name": "德惠市"
                        }
                    ],
                    "dmId": "220100",
                    "name": "长春市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220202",
                            "name": "昌邑区"
                        },
                        {
                            "dmId": "220203",
                            "name": "龙潭区"
                        },
                        {
                            "dmId": "220204",
                            "name": "船营区"
                        },
                        {
                            "dmId": "220211",
                            "name": "丰满区"
                        },
                        {
                            "dmId": "220221",
                            "name": "永吉县"
                        },
                        {
                            "dmId": "220281",
                            "name": "蛟河市"
                        },
                        {
                            "dmId": "220282",
                            "name": "桦甸市"
                        },
                        {
                            "dmId": "220283",
                            "name": "舒兰市"
                        },
                        {
                            "dmId": "220284",
                            "name": "磐石市"
                        }
                    ],
                    "dmId": "220200",
                    "name": "吉林市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220302",
                            "name": "铁西区"
                        },
                        {
                            "dmId": "220303",
                            "name": "铁东区"
                        },
                        {
                            "dmId": "220322",
                            "name": "梨树县"
                        },
                        {
                            "dmId": "220323",
                            "name": "伊通满族自治县"
                        },
                        {
                            "dmId": "220381",
                            "name": "公主岭市"
                        },
                        {
                            "dmId": "220382",
                            "name": "双辽市"
                        }
                    ],
                    "dmId": "220300",
                    "name": "四平市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220402",
                            "name": "龙山区"
                        },
                        {
                            "dmId": "220403",
                            "name": "西安区"
                        },
                        {
                            "dmId": "220421",
                            "name": "东丰县"
                        },
                        {
                            "dmId": "220422",
                            "name": "东辽县"
                        }
                    ],
                    "dmId": "220400",
                    "name": "辽源市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220502",
                            "name": "东昌区"
                        },
                        {
                            "dmId": "220503",
                            "name": "二道江区"
                        },
                        {
                            "dmId": "220521",
                            "name": "通化县"
                        },
                        {
                            "dmId": "220523",
                            "name": "辉南县"
                        },
                        {
                            "dmId": "220524",
                            "name": "柳河县"
                        },
                        {
                            "dmId": "220581",
                            "name": "梅河口市"
                        },
                        {
                            "dmId": "220582",
                            "name": "集安市"
                        }
                    ],
                    "dmId": "220500",
                    "name": "通化市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220602",
                            "name": "浑江区"
                        },
                        {
                            "dmId": "220621",
                            "name": "抚松县"
                        },
                        {
                            "dmId": "220622",
                            "name": "靖宇县"
                        },
                        {
                            "dmId": "220623",
                            "name": "长白朝鲜族自治县"
                        },
                        {
                            "dmId": "220625",
                            "name": "江源区"
                        },
                        {
                            "dmId": "220681",
                            "name": "临江市"
                        }
                    ],
                    "dmId": "220600",
                    "name": "白山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220702",
                            "name": "宁江区"
                        },
                        {
                            "dmId": "220721",
                            "name": "前郭尔罗斯蒙古族自治县"
                        },
                        {
                            "dmId": "220722",
                            "name": "长岭县"
                        },
                        {
                            "dmId": "220723",
                            "name": "乾安县"
                        },
                        {
                            "dmId": "220724",
                            "name": "扶余市"
                        }
                    ],
                    "dmId": "220700",
                    "name": "松原市"
                },
                {
                    "childs": [
                        {
                            "dmId": "220802",
                            "name": "洮北区"
                        },
                        {
                            "dmId": "220821",
                            "name": "镇赉县"
                        },
                        {
                            "dmId": "220822",
                            "name": "通榆县"
                        },
                        {
                            "dmId": "220881",
                            "name": "洮南市"
                        },
                        {
                            "dmId": "220882",
                            "name": "大安市"
                        }
                    ],
                    "dmId": "220800",
                    "name": "白城市"
                },
                {
                    "childs": [
                        {
                            "dmId": "222401",
                            "name": "延吉市"
                        },
                        {
                            "dmId": "222402",
                            "name": "图们市"
                        },
                        {
                            "dmId": "222403",
                            "name": "敦化市"
                        },
                        {
                            "dmId": "222404",
                            "name": "珲春市"
                        },
                        {
                            "dmId": "222405",
                            "name": "龙井市"
                        },
                        {
                            "dmId": "222406",
                            "name": "和龙市"
                        },
                        {
                            "dmId": "222424",
                            "name": "汪清县"
                        },
                        {
                            "dmId": "222426",
                            "name": "安图县"
                        }
                    ],
                    "dmId": "222400",
                    "name": "延边朝鲜族自治州"
                }
            ],
            "dmId": "220000",
            "name": "吉林省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "230102",
                            "name": "道里区"
                        },
                        {
                            "dmId": "230103",
                            "name": "南岗区"
                        },
                        {
                            "dmId": "230104",
                            "name": "道外区"
                        },
                        {
                            "dmId": "230106",
                            "name": "香坊区"
                        },
                        {
                            "dmId": "230108",
                            "name": "平房区"
                        },
                        {
                            "dmId": "230109",
                            "name": "松北区"
                        },
                        {
                            "dmId": "230111",
                            "name": "呼兰区"
                        },
                        {
                            "dmId": "230123",
                            "name": "依兰县"
                        },
                        {
                            "dmId": "230124",
                            "name": "方正县"
                        },
                        {
                            "dmId": "230125",
                            "name": "宾县"
                        },
                        {
                            "dmId": "230126",
                            "name": "巴彦县"
                        },
                        {
                            "dmId": "230127",
                            "name": "木兰县"
                        },
                        {
                            "dmId": "230128",
                            "name": "通河县"
                        },
                        {
                            "dmId": "230129",
                            "name": "延寿县"
                        },
                        {
                            "dmId": "230181",
                            "name": "阿城区"
                        },
                        {
                            "dmId": "230182",
                            "name": "双城市"
                        },
                        {
                            "dmId": "230183",
                            "name": "尚志市"
                        },
                        {
                            "dmId": "230184",
                            "name": "五常市"
                        }
                    ],
                    "dmId": "230100",
                    "name": "哈尔滨市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230202",
                            "name": "龙沙区"
                        },
                        {
                            "dmId": "230203",
                            "name": "建华区"
                        },
                        {
                            "dmId": "230204",
                            "name": "铁锋区"
                        },
                        {
                            "dmId": "230205",
                            "name": "昂昂溪区"
                        },
                        {
                            "dmId": "230206",
                            "name": "富拉尔基区"
                        },
                        {
                            "dmId": "230207",
                            "name": "碾子山区"
                        },
                        {
                            "dmId": "230208",
                            "name": "梅里斯达斡尔族区"
                        },
                        {
                            "dmId": "230221",
                            "name": "龙江县"
                        },
                        {
                            "dmId": "230223",
                            "name": "依安县"
                        },
                        {
                            "dmId": "230224",
                            "name": "泰来县"
                        },
                        {
                            "dmId": "230225",
                            "name": "甘南县"
                        },
                        {
                            "dmId": "230227",
                            "name": "富裕县"
                        },
                        {
                            "dmId": "230229",
                            "name": "克山县"
                        },
                        {
                            "dmId": "230230",
                            "name": "克东县"
                        },
                        {
                            "dmId": "230231",
                            "name": "拜泉县"
                        },
                        {
                            "dmId": "230281",
                            "name": "讷河市"
                        }
                    ],
                    "dmId": "230200",
                    "name": "齐齐哈尔市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230302",
                            "name": "鸡冠区"
                        },
                        {
                            "dmId": "230303",
                            "name": "恒山区"
                        },
                        {
                            "dmId": "230304",
                            "name": "滴道区"
                        },
                        {
                            "dmId": "230305",
                            "name": "梨树区"
                        },
                        {
                            "dmId": "230306",
                            "name": "城子河区"
                        },
                        {
                            "dmId": "230307",
                            "name": "麻山区"
                        },
                        {
                            "dmId": "230321",
                            "name": "鸡东县"
                        },
                        {
                            "dmId": "230381",
                            "name": "虎林市"
                        },
                        {
                            "dmId": "230382",
                            "name": "密山市"
                        }
                    ],
                    "dmId": "230300",
                    "name": "鸡西市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230402",
                            "name": "向阳区"
                        },
                        {
                            "dmId": "230403",
                            "name": "工农区"
                        },
                        {
                            "dmId": "230404",
                            "name": "南山区"
                        },
                        {
                            "dmId": "230405",
                            "name": "兴安区"
                        },
                        {
                            "dmId": "230406",
                            "name": "东山区"
                        },
                        {
                            "dmId": "230407",
                            "name": "兴山区"
                        },
                        {
                            "dmId": "230421",
                            "name": "萝北县"
                        },
                        {
                            "dmId": "230422",
                            "name": "绥滨县"
                        }
                    ],
                    "dmId": "230400",
                    "name": "鹤岗市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230502",
                            "name": "尖山区"
                        },
                        {
                            "dmId": "230503",
                            "name": "岭东区"
                        },
                        {
                            "dmId": "230505",
                            "name": "四方台区"
                        },
                        {
                            "dmId": "230506",
                            "name": "宝山区"
                        },
                        {
                            "dmId": "230521",
                            "name": "集贤县"
                        },
                        {
                            "dmId": "230522",
                            "name": "友谊县"
                        },
                        {
                            "dmId": "230523",
                            "name": "宝清县"
                        },
                        {
                            "dmId": "230524",
                            "name": "饶河县"
                        }
                    ],
                    "dmId": "230500",
                    "name": "双鸭山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230602",
                            "name": "萨尔图区"
                        },
                        {
                            "dmId": "230603",
                            "name": "龙凤区"
                        },
                        {
                            "dmId": "230604",
                            "name": "让胡路区"
                        },
                        {
                            "dmId": "230605",
                            "name": "红岗区"
                        },
                        {
                            "dmId": "230606",
                            "name": "大同区"
                        },
                        {
                            "dmId": "230621",
                            "name": "肇州县"
                        },
                        {
                            "dmId": "230622",
                            "name": "肇源县"
                        },
                        {
                            "dmId": "230623",
                            "name": "林甸县"
                        },
                        {
                            "dmId": "230624",
                            "name": "杜尔伯特蒙古族自治县"
                        }
                    ],
                    "dmId": "230600",
                    "name": "大庆市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230702",
                            "name": "伊春区"
                        },
                        {
                            "dmId": "230703",
                            "name": "南岔区"
                        },
                        {
                            "dmId": "230704",
                            "name": "友好区"
                        },
                        {
                            "dmId": "230705",
                            "name": "西林区"
                        },
                        {
                            "dmId": "230706",
                            "name": "翠峦区"
                        },
                        {
                            "dmId": "230707",
                            "name": "新青区"
                        },
                        {
                            "dmId": "230708",
                            "name": "美溪区"
                        },
                        {
                            "dmId": "230709",
                            "name": "金山屯区"
                        },
                        {
                            "dmId": "230710",
                            "name": "五营区"
                        },
                        {
                            "dmId": "230711",
                            "name": "乌马河区"
                        },
                        {
                            "dmId": "230712",
                            "name": "汤旺河区"
                        },
                        {
                            "dmId": "230713",
                            "name": "带岭区"
                        },
                        {
                            "dmId": "230714",
                            "name": "乌伊岭区"
                        },
                        {
                            "dmId": "230715",
                            "name": "红星区"
                        },
                        {
                            "dmId": "230716",
                            "name": "上甘岭区"
                        },
                        {
                            "dmId": "230722",
                            "name": "嘉荫县"
                        },
                        {
                            "dmId": "230781",
                            "name": "铁力市"
                        }
                    ],
                    "dmId": "230700",
                    "name": "伊春市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230803",
                            "name": "向阳区"
                        },
                        {
                            "dmId": "230804",
                            "name": "前进区"
                        },
                        {
                            "dmId": "230805",
                            "name": "东风区"
                        },
                        {
                            "dmId": "230811",
                            "name": "郊区"
                        },
                        {
                            "dmId": "230822",
                            "name": "桦南县"
                        },
                        {
                            "dmId": "230826",
                            "name": "桦川县"
                        },
                        {
                            "dmId": "230828",
                            "name": "汤原县"
                        },
                        {
                            "dmId": "230833",
                            "name": "抚远县"
                        },
                        {
                            "dmId": "230881",
                            "name": "同江市"
                        },
                        {
                            "dmId": "230882",
                            "name": "富锦市"
                        }
                    ],
                    "dmId": "230800",
                    "name": "佳木斯市"
                },
                {
                    "childs": [
                        {
                            "dmId": "230902",
                            "name": "新兴区"
                        },
                        {
                            "dmId": "230903",
                            "name": "桃山区"
                        },
                        {
                            "dmId": "230904",
                            "name": "茄子河区"
                        },
                        {
                            "dmId": "230921",
                            "name": "勃利县"
                        }
                    ],
                    "dmId": "230900",
                    "name": "七台河市"
                },
                {
                    "childs": [
                        {
                            "dmId": "231002",
                            "name": "东安区"
                        },
                        {
                            "dmId": "231003",
                            "name": "阳明区"
                        },
                        {
                            "dmId": "231004",
                            "name": "爱民区"
                        },
                        {
                            "dmId": "231005",
                            "name": "西安区"
                        },
                        {
                            "dmId": "231024",
                            "name": "东宁县"
                        },
                        {
                            "dmId": "231025",
                            "name": "林口县"
                        },
                        {
                            "dmId": "231081",
                            "name": "绥芬河市"
                        },
                        {
                            "dmId": "231083",
                            "name": "海林市"
                        },
                        {
                            "dmId": "231084",
                            "name": "宁安市"
                        },
                        {
                            "dmId": "231085",
                            "name": "穆棱市"
                        }
                    ],
                    "dmId": "231000",
                    "name": "牡丹江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "231102",
                            "name": "爱辉区"
                        },
                        {
                            "dmId": "231121",
                            "name": "嫩江县"
                        },
                        {
                            "dmId": "231123",
                            "name": "逊克县"
                        },
                        {
                            "dmId": "231124",
                            "name": "孙吴县"
                        },
                        {
                            "dmId": "231181",
                            "name": "北安市"
                        },
                        {
                            "dmId": "231182",
                            "name": "五大连池市"
                        }
                    ],
                    "dmId": "231100",
                    "name": "黑河市"
                },
                {
                    "childs": [
                        {
                            "dmId": "231202",
                            "name": "北林区"
                        },
                        {
                            "dmId": "231221",
                            "name": "望奎县"
                        },
                        {
                            "dmId": "231222",
                            "name": "兰西县"
                        },
                        {
                            "dmId": "231223",
                            "name": "青冈县"
                        },
                        {
                            "dmId": "231224",
                            "name": "庆安县"
                        },
                        {
                            "dmId": "231225",
                            "name": "明水县"
                        },
                        {
                            "dmId": "231226",
                            "name": "绥棱县"
                        },
                        {
                            "dmId": "231281",
                            "name": "安达市"
                        },
                        {
                            "dmId": "231282",
                            "name": "肇东市"
                        },
                        {
                            "dmId": "231283",
                            "name": "海伦市"
                        }
                    ],
                    "dmId": "231200",
                    "name": "绥化市"
                },
                {
                    "childs": [
                        {
                            "dmId": "232702",
                            "name": "松岭区"
                        },
                        {
                            "dmId": "232703",
                            "name": "新林区"
                        },
                        {
                            "dmId": "232704",
                            "name": "呼中区"
                        },
                        {
                            "dmId": "232721",
                            "name": "呼玛县"
                        },
                        {
                            "dmId": "232722",
                            "name": "塔河县"
                        },
                        {
                            "dmId": "232723",
                            "name": "漠河县"
                        },
                        {
                            "dmId": "232724",
                            "name": "加格达奇区"
                        }
                    ],
                    "dmId": "232700",
                    "name": "大兴安岭地区"
                }
            ],
            "dmId": "230000",
            "name": "黑龙江省"
        },
        {
            "childs": [
                {
                    "dmId": "310101",
                    "name": "黄浦区"
                },
                {
                    "dmId": "310104",
                    "name": "徐汇区"
                },
                {
                    "dmId": "310105",
                    "name": "长宁区"
                },
                {
                    "dmId": "310106",
                    "name": "静安区"
                },
                {
                    "dmId": "310107",
                    "name": "普陀区"
                },
                {
                    "dmId": "310108",
                    "name": "闸北区"
                },
                {
                    "dmId": "310109",
                    "name": "虹口区"
                },
                {
                    "dmId": "310110",
                    "name": "杨浦区"
                },
                {
                    "dmId": "310112",
                    "name": "闵行区"
                },
                {
                    "dmId": "310113",
                    "name": "宝山区"
                },
                {
                    "dmId": "310114",
                    "name": "嘉定区"
                },
                {
                    "dmId": "310115",
                    "name": "浦东新区"
                },
                {
                    "dmId": "310116",
                    "name": "金山区"
                },
                {
                    "dmId": "310117",
                    "name": "松江区"
                },
                {
                    "dmId": "310118",
                    "name": "青浦区"
                },
                {
                    "dmId": "310120",
                    "name": "奉贤区"
                },
                {
                    "dmId": "310230",
                    "name": "崇明县"
                }
            ],
            "dmId": "310100",
            "name": "上海市"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "320102",
                            "name": "玄武区"
                        },
                        {
                            "dmId": "320104",
                            "name": "秦淮区"
                        },
                        {
                            "dmId": "320105",
                            "name": "建邺区"
                        },
                        {
                            "dmId": "320106",
                            "name": "鼓楼区"
                        },
                        {
                            "dmId": "320111",
                            "name": "浦口区"
                        },
                        {
                            "dmId": "320113",
                            "name": "栖霞区"
                        },
                        {
                            "dmId": "320114",
                            "name": "雨花台区"
                        },
                        {
                            "dmId": "320115",
                            "name": "江宁区"
                        },
                        {
                            "dmId": "320116",
                            "name": "六合区"
                        },
                        {
                            "dmId": "320124",
                            "name": "溧水区"
                        },
                        {
                            "dmId": "320125",
                            "name": "高淳区"
                        }
                    ],
                    "dmId": "320100",
                    "name": "南京市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320202",
                            "name": "崇安区"
                        },
                        {
                            "dmId": "320203",
                            "name": "南长区"
                        },
                        {
                            "dmId": "320204",
                            "name": "北塘区"
                        },
                        {
                            "dmId": "320205",
                            "name": "锡山区"
                        },
                        {
                            "dmId": "320206",
                            "name": "惠山区"
                        },
                        {
                            "dmId": "320211",
                            "name": "滨湖区"
                        },
                        {
                            "dmId": "320281",
                            "name": "江阴市"
                        },
                        {
                            "dmId": "320282",
                            "name": "宜兴市"
                        }
                    ],
                    "dmId": "320200",
                    "name": "无锡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320302",
                            "name": "鼓楼区"
                        },
                        {
                            "dmId": "320303",
                            "name": "云龙区"
                        },
                        {
                            "dmId": "320305",
                            "name": "贾汪区"
                        },
                        {
                            "dmId": "320311",
                            "name": "泉山区"
                        },
                        {
                            "dmId": "320321",
                            "name": "丰县"
                        },
                        {
                            "dmId": "320322",
                            "name": "沛县"
                        },
                        {
                            "dmId": "320323",
                            "name": "铜山区"
                        },
                        {
                            "dmId": "320324",
                            "name": "睢宁县"
                        },
                        {
                            "dmId": "320381",
                            "name": "新沂市"
                        },
                        {
                            "dmId": "320382",
                            "name": "邳州市"
                        }
                    ],
                    "dmId": "320300",
                    "name": "徐州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320402",
                            "name": "天宁区"
                        },
                        {
                            "dmId": "320404",
                            "name": "钟楼区"
                        },
                        {
                            "dmId": "320405",
                            "name": "戚墅堰区"
                        },
                        {
                            "dmId": "320411",
                            "name": "新北区"
                        },
                        {
                            "dmId": "320412",
                            "name": "武进区"
                        },
                        {
                            "dmId": "320481",
                            "name": "溧阳市"
                        },
                        {
                            "dmId": "320482",
                            "name": "金坛市"
                        }
                    ],
                    "dmId": "320400",
                    "name": "常州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320505",
                            "name": "虎丘区"
                        },
                        {
                            "dmId": "320506",
                            "name": "吴中区"
                        },
                        {
                            "dmId": "320507",
                            "name": "相城区"
                        },
                        {
                            "dmId": "320508",
                            "name": "姑苏区"
                        },
                        {
                            "dmId": "320581",
                            "name": "常熟市"
                        },
                        {
                            "dmId": "320582",
                            "name": "张家港市"
                        },
                        {
                            "dmId": "320583",
                            "name": "昆山市"
                        },
                        {
                            "dmId": "320584",
                            "name": "吴江区"
                        },
                        {
                            "dmId": "320585",
                            "name": "太仓市"
                        }
                    ],
                    "dmId": "320500",
                    "name": "苏州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320602",
                            "name": "崇川区"
                        },
                        {
                            "dmId": "320611",
                            "name": "港闸区"
                        },
                        {
                            "dmId": "320612",
                            "name": "通州区"
                        },
                        {
                            "dmId": "320621",
                            "name": "海安县"
                        },
                        {
                            "dmId": "320623",
                            "name": "如东县"
                        },
                        {
                            "dmId": "320681",
                            "name": "启东市"
                        },
                        {
                            "dmId": "320682",
                            "name": "如皋市"
                        },
                        {
                            "dmId": "320684",
                            "name": "海门市"
                        }
                    ],
                    "dmId": "320600",
                    "name": "南通市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320703",
                            "name": "连云区"
                        },
                        {
                            "dmId": "320705",
                            "name": "新浦区"
                        },
                        {
                            "dmId": "320706",
                            "name": "海州区"
                        },
                        {
                            "dmId": "320721",
                            "name": "赣榆县"
                        },
                        {
                            "dmId": "320722",
                            "name": "东海县"
                        },
                        {
                            "dmId": "320723",
                            "name": "灌云县"
                        },
                        {
                            "dmId": "320724",
                            "name": "灌南县"
                        }
                    ],
                    "dmId": "320700",
                    "name": "连云港市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320802",
                            "name": "清河区"
                        },
                        {
                            "dmId": "320803",
                            "name": "淮安区"
                        },
                        {
                            "dmId": "320804",
                            "name": "淮阴区"
                        },
                        {
                            "dmId": "320811",
                            "name": "清浦区"
                        },
                        {
                            "dmId": "320826",
                            "name": "涟水县"
                        },
                        {
                            "dmId": "320829",
                            "name": "洪泽县"
                        },
                        {
                            "dmId": "320830",
                            "name": "盱眙县"
                        },
                        {
                            "dmId": "320831",
                            "name": "金湖县"
                        }
                    ],
                    "dmId": "320800",
                    "name": "淮安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "320902",
                            "name": "亭湖区"
                        },
                        {
                            "dmId": "320903",
                            "name": "盐都区"
                        },
                        {
                            "dmId": "320921",
                            "name": "响水县"
                        },
                        {
                            "dmId": "320922",
                            "name": "滨海县"
                        },
                        {
                            "dmId": "320923",
                            "name": "阜宁县"
                        },
                        {
                            "dmId": "320924",
                            "name": "射阳县"
                        },
                        {
                            "dmId": "320925",
                            "name": "建湖县"
                        },
                        {
                            "dmId": "320981",
                            "name": "东台市"
                        },
                        {
                            "dmId": "320982",
                            "name": "大丰市"
                        }
                    ],
                    "dmId": "320900",
                    "name": "盐城市"
                },
                {
                    "childs": [
                        {
                            "dmId": "321002",
                            "name": "广陵区"
                        },
                        {
                            "dmId": "321003",
                            "name": "邗江区"
                        },
                        {
                            "dmId": "321023",
                            "name": "宝应县"
                        },
                        {
                            "dmId": "321081",
                            "name": "仪征市"
                        },
                        {
                            "dmId": "321084",
                            "name": "高邮市"
                        },
                        {
                            "dmId": "321088",
                            "name": "江都区"
                        }
                    ],
                    "dmId": "321000",
                    "name": "扬州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "321102",
                            "name": "京口区"
                        },
                        {
                            "dmId": "321111",
                            "name": "润州区"
                        },
                        {
                            "dmId": "321112",
                            "name": "丹徒区"
                        },
                        {
                            "dmId": "321181",
                            "name": "丹阳市"
                        },
                        {
                            "dmId": "321182",
                            "name": "扬中市"
                        },
                        {
                            "dmId": "321183",
                            "name": "句容市"
                        }
                    ],
                    "dmId": "321100",
                    "name": "镇江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "321202",
                            "name": "海陵区"
                        },
                        {
                            "dmId": "321203",
                            "name": "高港区"
                        },
                        {
                            "dmId": "321281",
                            "name": "兴化市"
                        },
                        {
                            "dmId": "321282",
                            "name": "靖江市"
                        },
                        {
                            "dmId": "321283",
                            "name": "泰兴市"
                        },
                        {
                            "dmId": "321284",
                            "name": "姜堰区"
                        }
                    ],
                    "dmId": "321200",
                    "name": "泰州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "321302",
                            "name": "宿城区"
                        },
                        {
                            "dmId": "321311",
                            "name": "宿豫区"
                        },
                        {
                            "dmId": "321322",
                            "name": "沭阳县"
                        },
                        {
                            "dmId": "321323",
                            "name": "泗阳县"
                        },
                        {
                            "dmId": "321324",
                            "name": "泗洪县"
                        }
                    ],
                    "dmId": "321300",
                    "name": "宿迁市"
                }
            ],
            "dmId": "320000",
            "name": "江苏省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "330102",
                            "name": "上城区"
                        },
                        {
                            "dmId": "330103",
                            "name": "下城区"
                        },
                        {
                            "dmId": "330104",
                            "name": "江干区"
                        },
                        {
                            "dmId": "330105",
                            "name": "拱墅区"
                        },
                        {
                            "dmId": "330106",
                            "name": "西湖区"
                        },
                        {
                            "dmId": "330108",
                            "name": "滨江区"
                        },
                        {
                            "dmId": "330109",
                            "name": "萧山区"
                        },
                        {
                            "dmId": "330110",
                            "name": "余杭区"
                        },
                        {
                            "dmId": "330122",
                            "name": "桐庐县"
                        },
                        {
                            "dmId": "330127",
                            "name": "淳安县"
                        },
                        {
                            "dmId": "330182",
                            "name": "建德市"
                        },
                        {
                            "dmId": "330183",
                            "name": "富阳市"
                        },
                        {
                            "dmId": "330185",
                            "name": "临安市"
                        }
                    ],
                    "dmId": "330100",
                    "name": "杭州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330203",
                            "name": "海曙区"
                        },
                        {
                            "dmId": "330204",
                            "name": "江东区"
                        },
                        {
                            "dmId": "330205",
                            "name": "江北区"
                        },
                        {
                            "dmId": "330206",
                            "name": "北仑区"
                        },
                        {
                            "dmId": "330211",
                            "name": "镇海区"
                        },
                        {
                            "dmId": "330212",
                            "name": "鄞州区"
                        },
                        {
                            "dmId": "330225",
                            "name": "象山县"
                        },
                        {
                            "dmId": "330226",
                            "name": "宁海县"
                        },
                        {
                            "dmId": "330281",
                            "name": "余姚市"
                        },
                        {
                            "dmId": "330282",
                            "name": "慈溪市"
                        },
                        {
                            "dmId": "330283",
                            "name": "奉化市"
                        }
                    ],
                    "dmId": "330200",
                    "name": "宁波市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330302",
                            "name": "鹿城区"
                        },
                        {
                            "dmId": "330303",
                            "name": "龙湾区"
                        },
                        {
                            "dmId": "330304",
                            "name": "瓯海区"
                        },
                        {
                            "dmId": "330322",
                            "name": "洞头县"
                        },
                        {
                            "dmId": "330324",
                            "name": "永嘉县"
                        },
                        {
                            "dmId": "330326",
                            "name": "平阳县"
                        },
                        {
                            "dmId": "330327",
                            "name": "苍南县"
                        },
                        {
                            "dmId": "330328",
                            "name": "文成县"
                        },
                        {
                            "dmId": "330329",
                            "name": "泰顺县"
                        },
                        {
                            "dmId": "330381",
                            "name": "瑞安市"
                        },
                        {
                            "dmId": "330382",
                            "name": "乐清市"
                        }
                    ],
                    "dmId": "330300",
                    "name": "温州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330402",
                            "name": "南湖区"
                        },
                        {
                            "dmId": "330411",
                            "name": "秀洲区"
                        },
                        {
                            "dmId": "330421",
                            "name": "嘉善县"
                        },
                        {
                            "dmId": "330424",
                            "name": "海盐县"
                        },
                        {
                            "dmId": "330481",
                            "name": "海宁市"
                        },
                        {
                            "dmId": "330482",
                            "name": "平湖市"
                        },
                        {
                            "dmId": "330483",
                            "name": "桐乡市"
                        }
                    ],
                    "dmId": "330400",
                    "name": "嘉兴市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330502",
                            "name": "吴兴区"
                        },
                        {
                            "dmId": "330503",
                            "name": "南浔区"
                        },
                        {
                            "dmId": "330521",
                            "name": "德清县"
                        },
                        {
                            "dmId": "330522",
                            "name": "长兴县"
                        },
                        {
                            "dmId": "330523",
                            "name": "安吉县"
                        }
                    ],
                    "dmId": "330500",
                    "name": "湖州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330602",
                            "name": "越城区"
                        },
                        {
                            "dmId": "330621",
                            "name": "绍兴县"
                        },
                        {
                            "dmId": "330624",
                            "name": "新昌县"
                        },
                        {
                            "dmId": "330681",
                            "name": "诸暨市"
                        },
                        {
                            "dmId": "330682",
                            "name": "上虞市"
                        },
                        {
                            "dmId": "330683",
                            "name": "嵊州市"
                        }
                    ],
                    "dmId": "330600",
                    "name": "绍兴市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330702",
                            "name": "婺城区"
                        },
                        {
                            "dmId": "330703",
                            "name": "金东区"
                        },
                        {
                            "dmId": "330723",
                            "name": "武义县"
                        },
                        {
                            "dmId": "330726",
                            "name": "浦江县"
                        },
                        {
                            "dmId": "330727",
                            "name": "磐安县"
                        },
                        {
                            "dmId": "330781",
                            "name": "兰溪市"
                        },
                        {
                            "dmId": "330782",
                            "name": "义乌市"
                        },
                        {
                            "dmId": "330783",
                            "name": "东阳市"
                        },
                        {
                            "dmId": "330784",
                            "name": "永康市"
                        }
                    ],
                    "dmId": "330700",
                    "name": "金华市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330802",
                            "name": "柯城区"
                        },
                        {
                            "dmId": "330803",
                            "name": "衢江区"
                        },
                        {
                            "dmId": "330822",
                            "name": "常山县"
                        },
                        {
                            "dmId": "330824",
                            "name": "开化县"
                        },
                        {
                            "dmId": "330825",
                            "name": "龙游县"
                        },
                        {
                            "dmId": "330881",
                            "name": "江山市"
                        }
                    ],
                    "dmId": "330800",
                    "name": "衢州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "330902",
                            "name": "定海区"
                        },
                        {
                            "dmId": "330903",
                            "name": "普陀区"
                        },
                        {
                            "dmId": "330921",
                            "name": "岱山县"
                        },
                        {
                            "dmId": "330922",
                            "name": "嵊泗县"
                        }
                    ],
                    "dmId": "330900",
                    "name": "舟山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "331002",
                            "name": "椒江区"
                        },
                        {
                            "dmId": "331003",
                            "name": "黄岩区"
                        },
                        {
                            "dmId": "331004",
                            "name": "路桥区"
                        },
                        {
                            "dmId": "331021",
                            "name": "玉环县"
                        },
                        {
                            "dmId": "331022",
                            "name": "三门县"
                        },
                        {
                            "dmId": "331023",
                            "name": "天台县"
                        },
                        {
                            "dmId": "331024",
                            "name": "仙居县"
                        },
                        {
                            "dmId": "331081",
                            "name": "温岭市"
                        },
                        {
                            "dmId": "331082",
                            "name": "临海市"
                        }
                    ],
                    "dmId": "331000",
                    "name": "台州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "331102",
                            "name": "莲都区"
                        },
                        {
                            "dmId": "331121",
                            "name": "青田县"
                        },
                        {
                            "dmId": "331122",
                            "name": "缙云县"
                        },
                        {
                            "dmId": "331123",
                            "name": "遂昌县"
                        },
                        {
                            "dmId": "331124",
                            "name": "松阳县"
                        },
                        {
                            "dmId": "331125",
                            "name": "云和县"
                        },
                        {
                            "dmId": "331126",
                            "name": "庆元县"
                        },
                        {
                            "dmId": "331127",
                            "name": "景宁畲族自治县"
                        },
                        {
                            "dmId": "331181",
                            "name": "龙泉市"
                        }
                    ],
                    "dmId": "331100",
                    "name": "丽水市"
                }
            ],
            "dmId": "330000",
            "name": "浙江省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "340102",
                            "name": "瑶海区"
                        },
                        {
                            "dmId": "340103",
                            "name": "庐阳区"
                        },
                        {
                            "dmId": "340104",
                            "name": "蜀山区"
                        },
                        {
                            "dmId": "340111",
                            "name": "包河区"
                        },
                        {
                            "dmId": "340121",
                            "name": "长丰县"
                        },
                        {
                            "dmId": "340122",
                            "name": "肥东县"
                        },
                        {
                            "dmId": "340123",
                            "name": "肥西县"
                        },
                        {
                            "dmId": "341400",
                            "name": "巢湖市"
                        },
                        {
                            "dmId": "341421",
                            "name": "庐江县"
                        }
                    ],
                    "dmId": "340100",
                    "name": "合肥市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340202",
                            "name": "镜湖区"
                        },
                        {
                            "dmId": "340203",
                            "name": "弋江区"
                        },
                        {
                            "dmId": "340207",
                            "name": "鸠江区"
                        },
                        {
                            "dmId": "340208",
                            "name": "三山区"
                        },
                        {
                            "dmId": "340221",
                            "name": "芜湖县"
                        },
                        {
                            "dmId": "340222",
                            "name": "繁昌县"
                        },
                        {
                            "dmId": "340223",
                            "name": "南陵县"
                        },
                        {
                            "dmId": "341422",
                            "name": "无为县"
                        }
                    ],
                    "dmId": "340200",
                    "name": "芜湖市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340302",
                            "name": "龙子湖区"
                        },
                        {
                            "dmId": "340303",
                            "name": "蚌山区"
                        },
                        {
                            "dmId": "340304",
                            "name": "禹会区"
                        },
                        {
                            "dmId": "340311",
                            "name": "淮上区"
                        },
                        {
                            "dmId": "340321",
                            "name": "怀远县"
                        },
                        {
                            "dmId": "340322",
                            "name": "五河县"
                        },
                        {
                            "dmId": "340323",
                            "name": "固镇县"
                        }
                    ],
                    "dmId": "340300",
                    "name": "蚌埠市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340402",
                            "name": "大通区"
                        },
                        {
                            "dmId": "340403",
                            "name": "田家庵区"
                        },
                        {
                            "dmId": "340404",
                            "name": "谢家集区"
                        },
                        {
                            "dmId": "340405",
                            "name": "八公山区"
                        },
                        {
                            "dmId": "340406",
                            "name": "潘集区"
                        },
                        {
                            "dmId": "340421",
                            "name": "凤台县"
                        }
                    ],
                    "dmId": "340400",
                    "name": "淮南市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340503",
                            "name": "花山区"
                        },
                        {
                            "dmId": "340504",
                            "name": "雨山区"
                        },
                        {
                            "dmId": "340506",
                            "name": "博望区"
                        },
                        {
                            "dmId": "340521",
                            "name": "当涂县"
                        },
                        {
                            "dmId": "341423",
                            "name": "含山县"
                        },
                        {
                            "dmId": "341424",
                            "name": "和县"
                        }
                    ],
                    "dmId": "340500",
                    "name": "马鞍山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340602",
                            "name": "杜集区"
                        },
                        {
                            "dmId": "340603",
                            "name": "相山区"
                        },
                        {
                            "dmId": "340604",
                            "name": "烈山区"
                        },
                        {
                            "dmId": "340621",
                            "name": "濉溪县"
                        }
                    ],
                    "dmId": "340600",
                    "name": "淮北市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340702",
                            "name": "铜官山区"
                        },
                        {
                            "dmId": "340703",
                            "name": "狮子山区"
                        },
                        {
                            "dmId": "340711",
                            "name": "郊区"
                        },
                        {
                            "dmId": "340721",
                            "name": "铜陵县"
                        }
                    ],
                    "dmId": "340700",
                    "name": "铜陵市"
                },
                {
                    "childs": [
                        {
                            "dmId": "340802",
                            "name": "迎江区"
                        },
                        {
                            "dmId": "340803",
                            "name": "大观区"
                        },
                        {
                            "dmId": "340811",
                            "name": "宜秀区"
                        },
                        {
                            "dmId": "340822",
                            "name": "怀宁县"
                        },
                        {
                            "dmId": "340823",
                            "name": "枞阳县"
                        },
                        {
                            "dmId": "340824",
                            "name": "潜山县"
                        },
                        {
                            "dmId": "340825",
                            "name": "太湖县"
                        },
                        {
                            "dmId": "340826",
                            "name": "宿松县"
                        },
                        {
                            "dmId": "340827",
                            "name": "望江县"
                        },
                        {
                            "dmId": "340828",
                            "name": "岳西县"
                        },
                        {
                            "dmId": "340881",
                            "name": "桐城市"
                        }
                    ],
                    "dmId": "340800",
                    "name": "安庆市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341002",
                            "name": "屯溪区"
                        },
                        {
                            "dmId": "341003",
                            "name": "黄山区"
                        },
                        {
                            "dmId": "341004",
                            "name": "徽州区"
                        },
                        {
                            "dmId": "341021",
                            "name": "歙县"
                        },
                        {
                            "dmId": "341022",
                            "name": "休宁县"
                        },
                        {
                            "dmId": "341023",
                            "name": "黟县"
                        },
                        {
                            "dmId": "341024",
                            "name": "祁门县"
                        }
                    ],
                    "dmId": "341000",
                    "name": "黄山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341102",
                            "name": "琅琊区"
                        },
                        {
                            "dmId": "341103",
                            "name": "南谯区"
                        },
                        {
                            "dmId": "341122",
                            "name": "来安县"
                        },
                        {
                            "dmId": "341124",
                            "name": "全椒县"
                        },
                        {
                            "dmId": "341125",
                            "name": "定远县"
                        },
                        {
                            "dmId": "341126",
                            "name": "凤阳县"
                        },
                        {
                            "dmId": "341181",
                            "name": "天长市"
                        },
                        {
                            "dmId": "341182",
                            "name": "明光市"
                        }
                    ],
                    "dmId": "341100",
                    "name": "滁州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341202",
                            "name": "颍州区"
                        },
                        {
                            "dmId": "341203",
                            "name": "颍东区"
                        },
                        {
                            "dmId": "341204",
                            "name": "颍泉区"
                        },
                        {
                            "dmId": "341221",
                            "name": "临泉县"
                        },
                        {
                            "dmId": "341222",
                            "name": "太和县"
                        },
                        {
                            "dmId": "341225",
                            "name": "阜南县"
                        },
                        {
                            "dmId": "341226",
                            "name": "颍上县"
                        },
                        {
                            "dmId": "341282",
                            "name": "界首市"
                        }
                    ],
                    "dmId": "341200",
                    "name": "阜阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341302",
                            "name": "埇桥区"
                        },
                        {
                            "dmId": "341321",
                            "name": "砀山县"
                        },
                        {
                            "dmId": "341322",
                            "name": "萧县"
                        },
                        {
                            "dmId": "341323",
                            "name": "灵璧县"
                        },
                        {
                            "dmId": "341324",
                            "name": "泗县"
                        }
                    ],
                    "dmId": "341300",
                    "name": "宿州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341502",
                            "name": "金安区"
                        },
                        {
                            "dmId": "341503",
                            "name": "裕安区"
                        },
                        {
                            "dmId": "341521",
                            "name": "寿县"
                        },
                        {
                            "dmId": "341522",
                            "name": "霍邱县"
                        },
                        {
                            "dmId": "341523",
                            "name": "舒城县"
                        },
                        {
                            "dmId": "341524",
                            "name": "金寨县"
                        },
                        {
                            "dmId": "341525",
                            "name": "霍山县"
                        }
                    ],
                    "dmId": "341500",
                    "name": "六安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341602",
                            "name": "谯城区"
                        },
                        {
                            "dmId": "341621",
                            "name": "涡阳县"
                        },
                        {
                            "dmId": "341622",
                            "name": "蒙城县"
                        },
                        {
                            "dmId": "341623",
                            "name": "利辛县"
                        }
                    ],
                    "dmId": "341600",
                    "name": "亳州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341702",
                            "name": "贵池区"
                        },
                        {
                            "dmId": "341721",
                            "name": "东至县"
                        },
                        {
                            "dmId": "341722",
                            "name": "石台县"
                        },
                        {
                            "dmId": "341723",
                            "name": "青阳县"
                        }
                    ],
                    "dmId": "341700",
                    "name": "池州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "341802",
                            "name": "宣州区"
                        },
                        {
                            "dmId": "341821",
                            "name": "郎溪县"
                        },
                        {
                            "dmId": "341822",
                            "name": "广德县"
                        },
                        {
                            "dmId": "341823",
                            "name": "泾县"
                        },
                        {
                            "dmId": "341824",
                            "name": "绩溪县"
                        },
                        {
                            "dmId": "341825",
                            "name": "旌德县"
                        },
                        {
                            "dmId": "341881",
                            "name": "宁国市"
                        }
                    ],
                    "dmId": "341800",
                    "name": "宣城市"
                }
            ],
            "dmId": "340000",
            "name": "安徽省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "350102",
                            "name": "鼓楼区"
                        },
                        {
                            "dmId": "350103",
                            "name": "台江区"
                        },
                        {
                            "dmId": "350104",
                            "name": "仓山区"
                        },
                        {
                            "dmId": "350105",
                            "name": "马尾区"
                        },
                        {
                            "dmId": "350111",
                            "name": "晋安区"
                        },
                        {
                            "dmId": "350121",
                            "name": "闽侯县"
                        },
                        {
                            "dmId": "350122",
                            "name": "连江县"
                        },
                        {
                            "dmId": "350123",
                            "name": "罗源县"
                        },
                        {
                            "dmId": "350124",
                            "name": "闽清县"
                        },
                        {
                            "dmId": "350125",
                            "name": "永泰县"
                        },
                        {
                            "dmId": "350128",
                            "name": "平潭县"
                        },
                        {
                            "dmId": "350181",
                            "name": "福清市"
                        },
                        {
                            "dmId": "350182",
                            "name": "长乐市"
                        }
                    ],
                    "dmId": "350100",
                    "name": "福州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350203",
                            "name": "思明区"
                        },
                        {
                            "dmId": "350205",
                            "name": "海沧区"
                        },
                        {
                            "dmId": "350206",
                            "name": "湖里区"
                        },
                        {
                            "dmId": "350211",
                            "name": "集美区"
                        },
                        {
                            "dmId": "350212",
                            "name": "同安区"
                        },
                        {
                            "dmId": "350213",
                            "name": "翔安区"
                        }
                    ],
                    "dmId": "350200",
                    "name": "厦门市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350302",
                            "name": "城厢区"
                        },
                        {
                            "dmId": "350303",
                            "name": "涵江区"
                        },
                        {
                            "dmId": "350304",
                            "name": "荔城区"
                        },
                        {
                            "dmId": "350305",
                            "name": "秀屿区"
                        },
                        {
                            "dmId": "350322",
                            "name": "仙游县"
                        }
                    ],
                    "dmId": "350300",
                    "name": "莆田市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350402",
                            "name": "梅列区"
                        },
                        {
                            "dmId": "350403",
                            "name": "三元区"
                        },
                        {
                            "dmId": "350421",
                            "name": "明溪县"
                        },
                        {
                            "dmId": "350423",
                            "name": "清流县"
                        },
                        {
                            "dmId": "350424",
                            "name": "宁化县"
                        },
                        {
                            "dmId": "350425",
                            "name": "大田县"
                        },
                        {
                            "dmId": "350426",
                            "name": "尤溪县"
                        },
                        {
                            "dmId": "350427",
                            "name": "沙县"
                        },
                        {
                            "dmId": "350428",
                            "name": "将乐县"
                        },
                        {
                            "dmId": "350429",
                            "name": "泰宁县"
                        },
                        {
                            "dmId": "350430",
                            "name": "建宁县"
                        },
                        {
                            "dmId": "350481",
                            "name": "永安市"
                        }
                    ],
                    "dmId": "350400",
                    "name": "三明市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350502",
                            "name": "鲤城区"
                        },
                        {
                            "dmId": "350503",
                            "name": "丰泽区"
                        },
                        {
                            "dmId": "350504",
                            "name": "洛江区"
                        },
                        {
                            "dmId": "350505",
                            "name": "泉港区"
                        },
                        {
                            "dmId": "350521",
                            "name": "惠安县"
                        },
                        {
                            "dmId": "350524",
                            "name": "安溪县"
                        },
                        {
                            "dmId": "350525",
                            "name": "永春县"
                        },
                        {
                            "dmId": "350526",
                            "name": "德化县"
                        },
                        {
                            "dmId": "350527",
                            "name": "金门县"
                        },
                        {
                            "dmId": "350581",
                            "name": "石狮市"
                        },
                        {
                            "dmId": "350582",
                            "name": "晋江市"
                        },
                        {
                            "dmId": "350583",
                            "name": "南安市"
                        }
                    ],
                    "dmId": "350500",
                    "name": "泉州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350602",
                            "name": "芗城区"
                        },
                        {
                            "dmId": "350603",
                            "name": "龙文区"
                        },
                        {
                            "dmId": "350622",
                            "name": "云霄县"
                        },
                        {
                            "dmId": "350623",
                            "name": "漳浦县"
                        },
                        {
                            "dmId": "350624",
                            "name": "诏安县"
                        },
                        {
                            "dmId": "350625",
                            "name": "长泰县"
                        },
                        {
                            "dmId": "350626",
                            "name": "东山县"
                        },
                        {
                            "dmId": "350627",
                            "name": "南靖县"
                        },
                        {
                            "dmId": "350628",
                            "name": "平和县"
                        },
                        {
                            "dmId": "350629",
                            "name": "华安县"
                        },
                        {
                            "dmId": "350681",
                            "name": "龙海市"
                        }
                    ],
                    "dmId": "350600",
                    "name": "漳州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350702",
                            "name": "延平区"
                        },
                        {
                            "dmId": "350721",
                            "name": "顺昌县"
                        },
                        {
                            "dmId": "350722",
                            "name": "浦城县"
                        },
                        {
                            "dmId": "350723",
                            "name": "光泽县"
                        },
                        {
                            "dmId": "350724",
                            "name": "松溪县"
                        },
                        {
                            "dmId": "350725",
                            "name": "政和县"
                        },
                        {
                            "dmId": "350781",
                            "name": "邵武市"
                        },
                        {
                            "dmId": "350782",
                            "name": "武夷山市"
                        },
                        {
                            "dmId": "350783",
                            "name": "建瓯市"
                        },
                        {
                            "dmId": "350784",
                            "name": "建阳市"
                        }
                    ],
                    "dmId": "350700",
                    "name": "南平市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350802",
                            "name": "新罗区"
                        },
                        {
                            "dmId": "350821",
                            "name": "长汀县"
                        },
                        {
                            "dmId": "350822",
                            "name": "永定县"
                        },
                        {
                            "dmId": "350823",
                            "name": "上杭县"
                        },
                        {
                            "dmId": "350824",
                            "name": "武平县"
                        },
                        {
                            "dmId": "350825",
                            "name": "连城县"
                        },
                        {
                            "dmId": "350881",
                            "name": "漳平市"
                        }
                    ],
                    "dmId": "350800",
                    "name": "龙岩市"
                },
                {
                    "childs": [
                        {
                            "dmId": "350902",
                            "name": "蕉城区"
                        },
                        {
                            "dmId": "350921",
                            "name": "霞浦县"
                        },
                        {
                            "dmId": "350922",
                            "name": "古田县"
                        },
                        {
                            "dmId": "350923",
                            "name": "屏南县"
                        },
                        {
                            "dmId": "350924",
                            "name": "寿宁县"
                        },
                        {
                            "dmId": "350925",
                            "name": "周宁县"
                        },
                        {
                            "dmId": "350926",
                            "name": "柘荣县"
                        },
                        {
                            "dmId": "350981",
                            "name": "福安市"
                        },
                        {
                            "dmId": "350982",
                            "name": "福鼎市"
                        }
                    ],
                    "dmId": "350900",
                    "name": "宁德市"
                }
            ],
            "dmId": "350000",
            "name": "福建省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "360102",
                            "name": "东湖区"
                        },
                        {
                            "dmId": "360103",
                            "name": "西湖区"
                        },
                        {
                            "dmId": "360104",
                            "name": "青云谱区"
                        },
                        {
                            "dmId": "360105",
                            "name": "湾里区"
                        },
                        {
                            "dmId": "360111",
                            "name": "青山湖区"
                        },
                        {
                            "dmId": "360121",
                            "name": "南昌县"
                        },
                        {
                            "dmId": "360122",
                            "name": "新建县"
                        },
                        {
                            "dmId": "360123",
                            "name": "安义县"
                        },
                        {
                            "dmId": "360124",
                            "name": "进贤县"
                        }
                    ],
                    "dmId": "360100",
                    "name": "南昌市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360202",
                            "name": "昌江区"
                        },
                        {
                            "dmId": "360203",
                            "name": "珠山区"
                        },
                        {
                            "dmId": "360222",
                            "name": "浮梁县"
                        },
                        {
                            "dmId": "360281",
                            "name": "乐平市"
                        }
                    ],
                    "dmId": "360200",
                    "name": "景德镇市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360302",
                            "name": "安源区"
                        },
                        {
                            "dmId": "360313",
                            "name": "湘东区"
                        },
                        {
                            "dmId": "360321",
                            "name": "莲花县"
                        },
                        {
                            "dmId": "360322",
                            "name": "上栗县"
                        },
                        {
                            "dmId": "360323",
                            "name": "芦溪县"
                        }
                    ],
                    "dmId": "360300",
                    "name": "萍乡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360402",
                            "name": "庐山区"
                        },
                        {
                            "dmId": "360403",
                            "name": "浔阳区"
                        },
                        {
                            "dmId": "360421",
                            "name": "九江县"
                        },
                        {
                            "dmId": "360423",
                            "name": "武宁县"
                        },
                        {
                            "dmId": "360424",
                            "name": "修水县"
                        },
                        {
                            "dmId": "360425",
                            "name": "永修县"
                        },
                        {
                            "dmId": "360426",
                            "name": "德安县"
                        },
                        {
                            "dmId": "360427",
                            "name": "星子县"
                        },
                        {
                            "dmId": "360428",
                            "name": "都昌县"
                        },
                        {
                            "dmId": "360429",
                            "name": "湖口县"
                        },
                        {
                            "dmId": "360430",
                            "name": "彭泽县"
                        },
                        {
                            "dmId": "360481",
                            "name": "瑞昌市"
                        },
                        {
                            "dmId": "360483",
                            "name": "共青城市"
                        }
                    ],
                    "dmId": "360400",
                    "name": "九江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360502",
                            "name": "渝水区"
                        },
                        {
                            "dmId": "360521",
                            "name": "分宜县"
                        }
                    ],
                    "dmId": "360500",
                    "name": "新余市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360602",
                            "name": "月湖区"
                        },
                        {
                            "dmId": "360622",
                            "name": "余江县"
                        },
                        {
                            "dmId": "360681",
                            "name": "贵溪市"
                        }
                    ],
                    "dmId": "360600",
                    "name": "鹰潭市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360702",
                            "name": "章贡区"
                        },
                        {
                            "dmId": "360721",
                            "name": "赣县"
                        },
                        {
                            "dmId": "360722",
                            "name": "信丰县"
                        },
                        {
                            "dmId": "360723",
                            "name": "大余县"
                        },
                        {
                            "dmId": "360724",
                            "name": "上犹县"
                        },
                        {
                            "dmId": "360725",
                            "name": "崇义县"
                        },
                        {
                            "dmId": "360726",
                            "name": "安远县"
                        },
                        {
                            "dmId": "360727",
                            "name": "龙南县"
                        },
                        {
                            "dmId": "360728",
                            "name": "定南县"
                        },
                        {
                            "dmId": "360729",
                            "name": "全南县"
                        },
                        {
                            "dmId": "360730",
                            "name": "宁都县"
                        },
                        {
                            "dmId": "360731",
                            "name": "于都县"
                        },
                        {
                            "dmId": "360732",
                            "name": "兴国县"
                        },
                        {
                            "dmId": "360733",
                            "name": "会昌县"
                        },
                        {
                            "dmId": "360734",
                            "name": "寻乌县"
                        },
                        {
                            "dmId": "360735",
                            "name": "石城县"
                        },
                        {
                            "dmId": "360781",
                            "name": "瑞金市"
                        },
                        {
                            "dmId": "360782",
                            "name": "南康市"
                        }
                    ],
                    "dmId": "360700",
                    "name": "赣州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360802",
                            "name": "吉州区"
                        },
                        {
                            "dmId": "360803",
                            "name": "青原区"
                        },
                        {
                            "dmId": "360821",
                            "name": "吉安县"
                        },
                        {
                            "dmId": "360822",
                            "name": "吉水县"
                        },
                        {
                            "dmId": "360823",
                            "name": "峡江县"
                        },
                        {
                            "dmId": "360824",
                            "name": "新干县"
                        },
                        {
                            "dmId": "360825",
                            "name": "永丰县"
                        },
                        {
                            "dmId": "360826",
                            "name": "泰和县"
                        },
                        {
                            "dmId": "360827",
                            "name": "遂川县"
                        },
                        {
                            "dmId": "360828",
                            "name": "万安县"
                        },
                        {
                            "dmId": "360829",
                            "name": "安福县"
                        },
                        {
                            "dmId": "360830",
                            "name": "永新县"
                        },
                        {
                            "dmId": "360881",
                            "name": "井冈山市"
                        }
                    ],
                    "dmId": "360800",
                    "name": "吉安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "360902",
                            "name": "袁州区"
                        },
                        {
                            "dmId": "360921",
                            "name": "奉新县"
                        },
                        {
                            "dmId": "360922",
                            "name": "万载县"
                        },
                        {
                            "dmId": "360923",
                            "name": "上高县"
                        },
                        {
                            "dmId": "360924",
                            "name": "宜丰县"
                        },
                        {
                            "dmId": "360925",
                            "name": "靖安县"
                        },
                        {
                            "dmId": "360926",
                            "name": "铜鼓县"
                        },
                        {
                            "dmId": "360981",
                            "name": "丰城市"
                        },
                        {
                            "dmId": "360982",
                            "name": "樟树市"
                        },
                        {
                            "dmId": "360983",
                            "name": "高安市"
                        }
                    ],
                    "dmId": "360900",
                    "name": "宜春市"
                },
                {
                    "childs": [
                        {
                            "dmId": "361002",
                            "name": "临川区"
                        },
                        {
                            "dmId": "361021",
                            "name": "南城县"
                        },
                        {
                            "dmId": "361022",
                            "name": "黎川县"
                        },
                        {
                            "dmId": "361023",
                            "name": "南丰县"
                        },
                        {
                            "dmId": "361024",
                            "name": "崇仁县"
                        },
                        {
                            "dmId": "361025",
                            "name": "乐安县"
                        },
                        {
                            "dmId": "361026",
                            "name": "宜黄县"
                        },
                        {
                            "dmId": "361027",
                            "name": "金溪县"
                        },
                        {
                            "dmId": "361028",
                            "name": "资溪县"
                        },
                        {
                            "dmId": "361029",
                            "name": "东乡县"
                        },
                        {
                            "dmId": "361030",
                            "name": "广昌县"
                        }
                    ],
                    "dmId": "361000",
                    "name": "抚州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "361102",
                            "name": "信州区"
                        },
                        {
                            "dmId": "361121",
                            "name": "上饶县"
                        },
                        {
                            "dmId": "361122",
                            "name": "广丰县"
                        },
                        {
                            "dmId": "361123",
                            "name": "玉山县"
                        },
                        {
                            "dmId": "361124",
                            "name": "铅山县"
                        },
                        {
                            "dmId": "361125",
                            "name": "横峰县"
                        },
                        {
                            "dmId": "361126",
                            "name": "弋阳县"
                        },
                        {
                            "dmId": "361127",
                            "name": "余干县"
                        },
                        {
                            "dmId": "361128",
                            "name": "鄱阳县"
                        },
                        {
                            "dmId": "361129",
                            "name": "万年县"
                        },
                        {
                            "dmId": "361130",
                            "name": "婺源县"
                        },
                        {
                            "dmId": "361181",
                            "name": "德兴市"
                        }
                    ],
                    "dmId": "361100",
                    "name": "上饶市"
                }
            ],
            "dmId": "360000",
            "name": "江西省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "370102",
                            "name": "历下区"
                        },
                        {
                            "dmId": "370103",
                            "name": "市中区"
                        },
                        {
                            "dmId": "370104",
                            "name": "槐荫区"
                        },
                        {
                            "dmId": "370105",
                            "name": "天桥区"
                        },
                        {
                            "dmId": "370112",
                            "name": "历城区"
                        },
                        {
                            "dmId": "370113",
                            "name": "长清区"
                        },
                        {
                            "dmId": "370124",
                            "name": "平阴县"
                        },
                        {
                            "dmId": "370125",
                            "name": "济阳县"
                        },
                        {
                            "dmId": "370126",
                            "name": "商河县"
                        },
                        {
                            "dmId": "370181",
                            "name": "章丘市"
                        }
                    ],
                    "dmId": "370100",
                    "name": "济南市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370202",
                            "name": "市南区"
                        },
                        {
                            "dmId": "370203",
                            "name": "市北区"
                        },
                        {
                            "dmId": "370211",
                            "name": "黄岛区"
                        },
                        {
                            "dmId": "370212",
                            "name": "崂山区"
                        },
                        {
                            "dmId": "370213",
                            "name": "李沧区"
                        },
                        {
                            "dmId": "370214",
                            "name": "城阳区"
                        },
                        {
                            "dmId": "370281",
                            "name": "胶州市"
                        },
                        {
                            "dmId": "370282",
                            "name": "即墨市"
                        },
                        {
                            "dmId": "370283",
                            "name": "平度市"
                        },
                        {
                            "dmId": "370285",
                            "name": "莱西市"
                        }
                    ],
                    "dmId": "370200",
                    "name": "青岛市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370302",
                            "name": "淄川区"
                        },
                        {
                            "dmId": "370303",
                            "name": "张店区"
                        },
                        {
                            "dmId": "370304",
                            "name": "博山区"
                        },
                        {
                            "dmId": "370305",
                            "name": "临淄区"
                        },
                        {
                            "dmId": "370306",
                            "name": "周村区"
                        },
                        {
                            "dmId": "370321",
                            "name": "桓台县"
                        },
                        {
                            "dmId": "370322",
                            "name": "高青县"
                        },
                        {
                            "dmId": "370323",
                            "name": "沂源县"
                        }
                    ],
                    "dmId": "370300",
                    "name": "淄博市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370402",
                            "name": "市中区"
                        },
                        {
                            "dmId": "370403",
                            "name": "薛城区"
                        },
                        {
                            "dmId": "370404",
                            "name": "峄城区"
                        },
                        {
                            "dmId": "370405",
                            "name": "台儿庄区"
                        },
                        {
                            "dmId": "370406",
                            "name": "山亭区"
                        },
                        {
                            "dmId": "370481",
                            "name": "滕州市"
                        }
                    ],
                    "dmId": "370400",
                    "name": "枣庄市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370502",
                            "name": "东营区"
                        },
                        {
                            "dmId": "370503",
                            "name": "河口区"
                        },
                        {
                            "dmId": "370521",
                            "name": "垦利县"
                        },
                        {
                            "dmId": "370522",
                            "name": "利津县"
                        },
                        {
                            "dmId": "370523",
                            "name": "广饶县"
                        }
                    ],
                    "dmId": "370500",
                    "name": "东营市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370602",
                            "name": "芝罘区"
                        },
                        {
                            "dmId": "370611",
                            "name": "福山区"
                        },
                        {
                            "dmId": "370612",
                            "name": "牟平区"
                        },
                        {
                            "dmId": "370613",
                            "name": "莱山区"
                        },
                        {
                            "dmId": "370634",
                            "name": "长岛县"
                        },
                        {
                            "dmId": "370681",
                            "name": "龙口市"
                        },
                        {
                            "dmId": "370682",
                            "name": "莱阳市"
                        },
                        {
                            "dmId": "370683",
                            "name": "莱州市"
                        },
                        {
                            "dmId": "370684",
                            "name": "蓬莱市"
                        },
                        {
                            "dmId": "370685",
                            "name": "招远市"
                        },
                        {
                            "dmId": "370686",
                            "name": "栖霞市"
                        },
                        {
                            "dmId": "370687",
                            "name": "海阳市"
                        }
                    ],
                    "dmId": "370600",
                    "name": "烟台市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370702",
                            "name": "潍城区"
                        },
                        {
                            "dmId": "370703",
                            "name": "寒亭区"
                        },
                        {
                            "dmId": "370704",
                            "name": "坊子区"
                        },
                        {
                            "dmId": "370705",
                            "name": "奎文区"
                        },
                        {
                            "dmId": "370724",
                            "name": "临朐县"
                        },
                        {
                            "dmId": "370725",
                            "name": "昌乐县"
                        },
                        {
                            "dmId": "370781",
                            "name": "青州市"
                        },
                        {
                            "dmId": "370782",
                            "name": "诸城市"
                        },
                        {
                            "dmId": "370783",
                            "name": "寿光市"
                        },
                        {
                            "dmId": "370784",
                            "name": "安丘市"
                        },
                        {
                            "dmId": "370785",
                            "name": "高密市"
                        },
                        {
                            "dmId": "370786",
                            "name": "昌邑市"
                        }
                    ],
                    "dmId": "370700",
                    "name": "潍坊市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370802",
                            "name": "市中区"
                        },
                        {
                            "dmId": "370811",
                            "name": "任城区"
                        },
                        {
                            "dmId": "370826",
                            "name": "微山县"
                        },
                        {
                            "dmId": "370827",
                            "name": "鱼台县"
                        },
                        {
                            "dmId": "370828",
                            "name": "金乡县"
                        },
                        {
                            "dmId": "370829",
                            "name": "嘉祥县"
                        },
                        {
                            "dmId": "370830",
                            "name": "汶上县"
                        },
                        {
                            "dmId": "370831",
                            "name": "泗水县"
                        },
                        {
                            "dmId": "370832",
                            "name": "梁山县"
                        },
                        {
                            "dmId": "370881",
                            "name": "曲阜市"
                        },
                        {
                            "dmId": "370882",
                            "name": "兖州市"
                        },
                        {
                            "dmId": "370883",
                            "name": "邹城市"
                        }
                    ],
                    "dmId": "370800",
                    "name": "济宁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "370902",
                            "name": "泰山区"
                        },
                        {
                            "dmId": "370903",
                            "name": "岱岳区"
                        },
                        {
                            "dmId": "370921",
                            "name": "宁阳县"
                        },
                        {
                            "dmId": "370923",
                            "name": "东平县"
                        },
                        {
                            "dmId": "370982",
                            "name": "新泰市"
                        },
                        {
                            "dmId": "370983",
                            "name": "肥城市"
                        }
                    ],
                    "dmId": "370900",
                    "name": "泰安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371002",
                            "name": "环翠区"
                        },
                        {
                            "dmId": "371081",
                            "name": "文登市"
                        },
                        {
                            "dmId": "371082",
                            "name": "荣成市"
                        },
                        {
                            "dmId": "371083",
                            "name": "乳山市"
                        }
                    ],
                    "dmId": "371000",
                    "name": "威海市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371102",
                            "name": "东港区"
                        },
                        {
                            "dmId": "371103",
                            "name": "岚山区"
                        },
                        {
                            "dmId": "371121",
                            "name": "五莲县"
                        },
                        {
                            "dmId": "371122",
                            "name": "莒县"
                        }
                    ],
                    "dmId": "371100",
                    "name": "日照市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371202",
                            "name": "莱城区"
                        },
                        {
                            "dmId": "371203",
                            "name": "钢城区"
                        }
                    ],
                    "dmId": "371200",
                    "name": "莱芜市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371302",
                            "name": "兰山区"
                        },
                        {
                            "dmId": "371311",
                            "name": "罗庄区"
                        },
                        {
                            "dmId": "371312",
                            "name": "河东区"
                        },
                        {
                            "dmId": "371321",
                            "name": "沂南县"
                        },
                        {
                            "dmId": "371322",
                            "name": "郯城县"
                        },
                        {
                            "dmId": "371323",
                            "name": "沂水县"
                        },
                        {
                            "dmId": "371324",
                            "name": "苍山县"
                        },
                        {
                            "dmId": "371325",
                            "name": "费县"
                        },
                        {
                            "dmId": "371326",
                            "name": "平邑县"
                        },
                        {
                            "dmId": "371327",
                            "name": "莒南县"
                        },
                        {
                            "dmId": "371328",
                            "name": "蒙阴县"
                        },
                        {
                            "dmId": "371329",
                            "name": "临沭县"
                        }
                    ],
                    "dmId": "371300",
                    "name": "临沂市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371402",
                            "name": "德城区"
                        },
                        {
                            "dmId": "371421",
                            "name": "陵县"
                        },
                        {
                            "dmId": "371422",
                            "name": "宁津县"
                        },
                        {
                            "dmId": "371423",
                            "name": "庆云县"
                        },
                        {
                            "dmId": "371424",
                            "name": "临邑县"
                        },
                        {
                            "dmId": "371425",
                            "name": "齐河县"
                        },
                        {
                            "dmId": "371426",
                            "name": "平原县"
                        },
                        {
                            "dmId": "371427",
                            "name": "夏津县"
                        },
                        {
                            "dmId": "371428",
                            "name": "武城县"
                        },
                        {
                            "dmId": "371481",
                            "name": "乐陵市"
                        },
                        {
                            "dmId": "371482",
                            "name": "禹城市"
                        }
                    ],
                    "dmId": "371400",
                    "name": "德州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371502",
                            "name": "东昌府区"
                        },
                        {
                            "dmId": "371521",
                            "name": "阳谷县"
                        },
                        {
                            "dmId": "371522",
                            "name": "莘县"
                        },
                        {
                            "dmId": "371523",
                            "name": "茌平县"
                        },
                        {
                            "dmId": "371524",
                            "name": "东阿县"
                        },
                        {
                            "dmId": "371525",
                            "name": "冠县"
                        },
                        {
                            "dmId": "371526",
                            "name": "高唐县"
                        },
                        {
                            "dmId": "371581",
                            "name": "临清市"
                        }
                    ],
                    "dmId": "371500",
                    "name": "聊城市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371602",
                            "name": "滨城区"
                        },
                        {
                            "dmId": "371621",
                            "name": "惠民县"
                        },
                        {
                            "dmId": "371622",
                            "name": "阳信县"
                        },
                        {
                            "dmId": "371623",
                            "name": "无棣县"
                        },
                        {
                            "dmId": "371624",
                            "name": "沾化县"
                        },
                        {
                            "dmId": "371625",
                            "name": "博兴县"
                        },
                        {
                            "dmId": "371626",
                            "name": "邹平县"
                        }
                    ],
                    "dmId": "371600",
                    "name": "滨州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "371702",
                            "name": "牡丹区"
                        },
                        {
                            "dmId": "371721",
                            "name": "曹县"
                        },
                        {
                            "dmId": "371722",
                            "name": "单县"
                        },
                        {
                            "dmId": "371723",
                            "name": "成武县"
                        },
                        {
                            "dmId": "371724",
                            "name": "巨野县"
                        },
                        {
                            "dmId": "371725",
                            "name": "郓城县"
                        },
                        {
                            "dmId": "371726",
                            "name": "鄄城县"
                        },
                        {
                            "dmId": "371727",
                            "name": "定陶县"
                        },
                        {
                            "dmId": "371728",
                            "name": "东明县"
                        }
                    ],
                    "dmId": "371700",
                    "name": "菏泽市"
                }
            ],
            "dmId": "370000",
            "name": "山东省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "410102",
                            "name": "中原区"
                        },
                        {
                            "dmId": "410103",
                            "name": "二七区"
                        },
                        {
                            "dmId": "410104",
                            "name": "管城回族区"
                        },
                        {
                            "dmId": "410105",
                            "name": "金水区"
                        },
                        {
                            "dmId": "410106",
                            "name": "上街区"
                        },
                        {
                            "dmId": "410108",
                            "name": "惠济区"
                        },
                        {
                            "dmId": "410122",
                            "name": "中牟县"
                        },
                        {
                            "dmId": "410181",
                            "name": "巩义市"
                        },
                        {
                            "dmId": "410182",
                            "name": "荥阳市"
                        },
                        {
                            "dmId": "410183",
                            "name": "新密市"
                        },
                        {
                            "dmId": "410184",
                            "name": "新郑市"
                        },
                        {
                            "dmId": "410185",
                            "name": "登封市"
                        }
                    ],
                    "dmId": "410100",
                    "name": "郑州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410202",
                            "name": "龙亭区"
                        },
                        {
                            "dmId": "410203",
                            "name": "顺河回族区"
                        },
                        {
                            "dmId": "410204",
                            "name": "鼓楼区"
                        },
                        {
                            "dmId": "410205",
                            "name": "禹王台区"
                        },
                        {
                            "dmId": "410211",
                            "name": "金明区"
                        },
                        {
                            "dmId": "410221",
                            "name": "杞县"
                        },
                        {
                            "dmId": "410222",
                            "name": "通许县"
                        },
                        {
                            "dmId": "410223",
                            "name": "尉氏县"
                        },
                        {
                            "dmId": "410224",
                            "name": "开封县"
                        },
                        {
                            "dmId": "410225",
                            "name": "兰考县"
                        }
                    ],
                    "dmId": "410200",
                    "name": "开封市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410302",
                            "name": "老城区"
                        },
                        {
                            "dmId": "410303",
                            "name": "西工区"
                        },
                        {
                            "dmId": "410304",
                            "name": "瀍河回族区"
                        },
                        {
                            "dmId": "410305",
                            "name": "涧西区"
                        },
                        {
                            "dmId": "410306",
                            "name": "吉利区"
                        },
                        {
                            "dmId": "410307",
                            "name": "洛龙区"
                        },
                        {
                            "dmId": "410322",
                            "name": "孟津县"
                        },
                        {
                            "dmId": "410323",
                            "name": "新安县"
                        },
                        {
                            "dmId": "410324",
                            "name": "栾川县"
                        },
                        {
                            "dmId": "410325",
                            "name": "嵩县"
                        },
                        {
                            "dmId": "410326",
                            "name": "汝阳县"
                        },
                        {
                            "dmId": "410327",
                            "name": "宜阳县"
                        },
                        {
                            "dmId": "410328",
                            "name": "洛宁县"
                        },
                        {
                            "dmId": "410329",
                            "name": "伊川县"
                        },
                        {
                            "dmId": "410381",
                            "name": "偃师市"
                        }
                    ],
                    "dmId": "410300",
                    "name": "洛阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410402",
                            "name": "新华区"
                        },
                        {
                            "dmId": "410403",
                            "name": "卫东区"
                        },
                        {
                            "dmId": "410404",
                            "name": "石龙区"
                        },
                        {
                            "dmId": "410411",
                            "name": "湛河区"
                        },
                        {
                            "dmId": "410421",
                            "name": "宝丰县"
                        },
                        {
                            "dmId": "410422",
                            "name": "叶县"
                        },
                        {
                            "dmId": "410423",
                            "name": "鲁山县"
                        },
                        {
                            "dmId": "410425",
                            "name": "郏县"
                        },
                        {
                            "dmId": "410481",
                            "name": "舞钢市"
                        },
                        {
                            "dmId": "410482",
                            "name": "汝州市"
                        }
                    ],
                    "dmId": "410400",
                    "name": "平顶山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410502",
                            "name": "文峰区"
                        },
                        {
                            "dmId": "410503",
                            "name": "北关区"
                        },
                        {
                            "dmId": "410505",
                            "name": "殷都区"
                        },
                        {
                            "dmId": "410506",
                            "name": "龙安区"
                        },
                        {
                            "dmId": "410522",
                            "name": "安阳县"
                        },
                        {
                            "dmId": "410523",
                            "name": "汤阴县"
                        },
                        {
                            "dmId": "410526",
                            "name": "滑县"
                        },
                        {
                            "dmId": "410527",
                            "name": "内黄县"
                        },
                        {
                            "dmId": "410581",
                            "name": "林州市"
                        }
                    ],
                    "dmId": "410500",
                    "name": "安阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410602",
                            "name": "鹤山区"
                        },
                        {
                            "dmId": "410603",
                            "name": "山城区"
                        },
                        {
                            "dmId": "410611",
                            "name": "淇滨区"
                        },
                        {
                            "dmId": "410621",
                            "name": "浚县"
                        },
                        {
                            "dmId": "410622",
                            "name": "淇县"
                        }
                    ],
                    "dmId": "410600",
                    "name": "鹤壁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410702",
                            "name": "红旗区"
                        },
                        {
                            "dmId": "410703",
                            "name": "卫滨区"
                        },
                        {
                            "dmId": "410704",
                            "name": "凤泉区"
                        },
                        {
                            "dmId": "410711",
                            "name": "牧野区"
                        },
                        {
                            "dmId": "410721",
                            "name": "新乡县"
                        },
                        {
                            "dmId": "410724",
                            "name": "获嘉县"
                        },
                        {
                            "dmId": "410725",
                            "name": "原阳县"
                        },
                        {
                            "dmId": "410726",
                            "name": "延津县"
                        },
                        {
                            "dmId": "410727",
                            "name": "封丘县"
                        },
                        {
                            "dmId": "410728",
                            "name": "长垣县"
                        },
                        {
                            "dmId": "410781",
                            "name": "卫辉市"
                        },
                        {
                            "dmId": "410782",
                            "name": "辉县市"
                        }
                    ],
                    "dmId": "410700",
                    "name": "新乡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410802",
                            "name": "解放区"
                        },
                        {
                            "dmId": "410803",
                            "name": "中站区"
                        },
                        {
                            "dmId": "410804",
                            "name": "马村区"
                        },
                        {
                            "dmId": "410811",
                            "name": "山阳区"
                        },
                        {
                            "dmId": "410821",
                            "name": "修武县"
                        },
                        {
                            "dmId": "410822",
                            "name": "博爱县"
                        },
                        {
                            "dmId": "410823",
                            "name": "武陟县"
                        },
                        {
                            "dmId": "410825",
                            "name": "温县"
                        },
                        {
                            "dmId": "410882",
                            "name": "沁阳市"
                        },
                        {
                            "dmId": "410883",
                            "name": "孟州市"
                        }
                    ],
                    "dmId": "410800",
                    "name": "焦作市"
                },
                {
                    "childs": [
                        {
                            "dmId": "410902",
                            "name": "华龙区"
                        },
                        {
                            "dmId": "410922",
                            "name": "清丰县"
                        },
                        {
                            "dmId": "410923",
                            "name": "南乐县"
                        },
                        {
                            "dmId": "410926",
                            "name": "范县"
                        },
                        {
                            "dmId": "410927",
                            "name": "台前县"
                        },
                        {
                            "dmId": "410928",
                            "name": "濮阳县"
                        }
                    ],
                    "dmId": "410900",
                    "name": "濮阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411002",
                            "name": "魏都区"
                        },
                        {
                            "dmId": "411023",
                            "name": "许昌县"
                        },
                        {
                            "dmId": "411024",
                            "name": "鄢陵县"
                        },
                        {
                            "dmId": "411025",
                            "name": "襄城县"
                        },
                        {
                            "dmId": "411081",
                            "name": "禹州市"
                        },
                        {
                            "dmId": "411082",
                            "name": "长葛市"
                        }
                    ],
                    "dmId": "411000",
                    "name": "许昌市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411102",
                            "name": "源汇区"
                        },
                        {
                            "dmId": "411103",
                            "name": "郾城区"
                        },
                        {
                            "dmId": "411104",
                            "name": "召陵区"
                        },
                        {
                            "dmId": "411121",
                            "name": "舞阳县"
                        },
                        {
                            "dmId": "411122",
                            "name": "临颍县"
                        }
                    ],
                    "dmId": "411100",
                    "name": "漯河市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411202",
                            "name": "湖滨区"
                        },
                        {
                            "dmId": "411221",
                            "name": "渑池县"
                        },
                        {
                            "dmId": "411222",
                            "name": "陕县"
                        },
                        {
                            "dmId": "411224",
                            "name": "卢氏县"
                        },
                        {
                            "dmId": "411281",
                            "name": "义马市"
                        },
                        {
                            "dmId": "411282",
                            "name": "灵宝市"
                        }
                    ],
                    "dmId": "411200",
                    "name": "三门峡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411302",
                            "name": "宛城区"
                        },
                        {
                            "dmId": "411303",
                            "name": "卧龙区"
                        },
                        {
                            "dmId": "411321",
                            "name": "南召县"
                        },
                        {
                            "dmId": "411322",
                            "name": "方城县"
                        },
                        {
                            "dmId": "411323",
                            "name": "西峡县"
                        },
                        {
                            "dmId": "411324",
                            "name": "镇平县"
                        },
                        {
                            "dmId": "411325",
                            "name": "内乡县"
                        },
                        {
                            "dmId": "411326",
                            "name": "淅川县"
                        },
                        {
                            "dmId": "411327",
                            "name": "社旗县"
                        },
                        {
                            "dmId": "411328",
                            "name": "唐河县"
                        },
                        {
                            "dmId": "411329",
                            "name": "新野县"
                        },
                        {
                            "dmId": "411330",
                            "name": "桐柏县"
                        },
                        {
                            "dmId": "411381",
                            "name": "邓州市"
                        }
                    ],
                    "dmId": "411300",
                    "name": "南阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411402",
                            "name": "梁园区"
                        },
                        {
                            "dmId": "411403",
                            "name": "睢阳区"
                        },
                        {
                            "dmId": "411421",
                            "name": "民权县"
                        },
                        {
                            "dmId": "411422",
                            "name": "睢县"
                        },
                        {
                            "dmId": "411423",
                            "name": "宁陵县"
                        },
                        {
                            "dmId": "411424",
                            "name": "柘城县"
                        },
                        {
                            "dmId": "411425",
                            "name": "虞城县"
                        },
                        {
                            "dmId": "411426",
                            "name": "夏邑县"
                        },
                        {
                            "dmId": "411481",
                            "name": "永城市"
                        }
                    ],
                    "dmId": "411400",
                    "name": "商丘市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411502",
                            "name": "浉河区"
                        },
                        {
                            "dmId": "411503",
                            "name": "平桥区"
                        },
                        {
                            "dmId": "411521",
                            "name": "罗山县"
                        },
                        {
                            "dmId": "411522",
                            "name": "光山县"
                        },
                        {
                            "dmId": "411523",
                            "name": "新县"
                        },
                        {
                            "dmId": "411524",
                            "name": "商城县"
                        },
                        {
                            "dmId": "411525",
                            "name": "固始县"
                        },
                        {
                            "dmId": "411526",
                            "name": "潢川县"
                        },
                        {
                            "dmId": "411527",
                            "name": "淮滨县"
                        },
                        {
                            "dmId": "411528",
                            "name": "息县"
                        }
                    ],
                    "dmId": "411500",
                    "name": "信阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411602",
                            "name": "川汇区"
                        },
                        {
                            "dmId": "411621",
                            "name": "扶沟县"
                        },
                        {
                            "dmId": "411622",
                            "name": "西华县"
                        },
                        {
                            "dmId": "411623",
                            "name": "商水县"
                        },
                        {
                            "dmId": "411624",
                            "name": "沈丘县"
                        },
                        {
                            "dmId": "411625",
                            "name": "郸城县"
                        },
                        {
                            "dmId": "411626",
                            "name": "淮阳县"
                        },
                        {
                            "dmId": "411627",
                            "name": "太康县"
                        },
                        {
                            "dmId": "411628",
                            "name": "鹿邑县"
                        },
                        {
                            "dmId": "411681",
                            "name": "项城市"
                        }
                    ],
                    "dmId": "411600",
                    "name": "周口市"
                },
                {
                    "childs": [
                        {
                            "dmId": "411702",
                            "name": "驿城区"
                        },
                        {
                            "dmId": "411721",
                            "name": "西平县"
                        },
                        {
                            "dmId": "411722",
                            "name": "上蔡县"
                        },
                        {
                            "dmId": "411723",
                            "name": "平舆县"
                        },
                        {
                            "dmId": "411724",
                            "name": "正阳县"
                        },
                        {
                            "dmId": "411725",
                            "name": "确山县"
                        },
                        {
                            "dmId": "411726",
                            "name": "泌阳县"
                        },
                        {
                            "dmId": "411727",
                            "name": "汝南县"
                        },
                        {
                            "dmId": "411728",
                            "name": "遂平县"
                        },
                        {
                            "dmId": "411729",
                            "name": "新蔡县"
                        }
                    ],
                    "dmId": "411700",
                    "name": "驻马店市"
                },
                {
                    "childs": [
                        {
                            "dmId": "419001",
                            "name": "济源市"
                        }
                    ],
                    "dmId": "419000",
                    "name": "直辖县级"
                }
            ],
            "dmId": "410000",
            "name": "河南省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "420102",
                            "name": "江岸区"
                        },
                        {
                            "dmId": "420103",
                            "name": "江汉区"
                        },
                        {
                            "dmId": "420104",
                            "name": "硚口区"
                        },
                        {
                            "dmId": "420105",
                            "name": "汉阳区"
                        },
                        {
                            "dmId": "420106",
                            "name": "武昌区"
                        },
                        {
                            "dmId": "420107",
                            "name": "青山区"
                        },
                        {
                            "dmId": "420111",
                            "name": "洪山区"
                        },
                        {
                            "dmId": "420112",
                            "name": "东西湖区"
                        },
                        {
                            "dmId": "420113",
                            "name": "汉南区"
                        },
                        {
                            "dmId": "420114",
                            "name": "蔡甸区"
                        },
                        {
                            "dmId": "420115",
                            "name": "江夏区"
                        },
                        {
                            "dmId": "420116",
                            "name": "黄陂区"
                        },
                        {
                            "dmId": "420117",
                            "name": "新洲区"
                        }
                    ],
                    "dmId": "420100",
                    "name": "武汉市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420202",
                            "name": "黄石港区"
                        },
                        {
                            "dmId": "420203",
                            "name": "西塞山区"
                        },
                        {
                            "dmId": "420204",
                            "name": "下陆区"
                        },
                        {
                            "dmId": "420205",
                            "name": "铁山区"
                        },
                        {
                            "dmId": "420222",
                            "name": "阳新县"
                        },
                        {
                            "dmId": "420281",
                            "name": "大冶市"
                        }
                    ],
                    "dmId": "420200",
                    "name": "黄石市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420302",
                            "name": "茅箭区"
                        },
                        {
                            "dmId": "420303",
                            "name": "张湾区"
                        },
                        {
                            "dmId": "420321",
                            "name": "郧县"
                        },
                        {
                            "dmId": "420322",
                            "name": "郧西县"
                        },
                        {
                            "dmId": "420323",
                            "name": "竹山县"
                        },
                        {
                            "dmId": "420324",
                            "name": "竹溪县"
                        },
                        {
                            "dmId": "420325",
                            "name": "房县"
                        },
                        {
                            "dmId": "420381",
                            "name": "丹江口市"
                        }
                    ],
                    "dmId": "420300",
                    "name": "十堰市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420502",
                            "name": "西陵区"
                        },
                        {
                            "dmId": "420503",
                            "name": "伍家岗区"
                        },
                        {
                            "dmId": "420504",
                            "name": "点军区"
                        },
                        {
                            "dmId": "420505",
                            "name": "猇亭区"
                        },
                        {
                            "dmId": "420506",
                            "name": "夷陵区"
                        },
                        {
                            "dmId": "420525",
                            "name": "远安县"
                        },
                        {
                            "dmId": "420526",
                            "name": "兴山县"
                        },
                        {
                            "dmId": "420527",
                            "name": "秭归县"
                        },
                        {
                            "dmId": "420528",
                            "name": "长阳土家族自治县"
                        },
                        {
                            "dmId": "420529",
                            "name": "五峰土家族自治县"
                        },
                        {
                            "dmId": "420581",
                            "name": "宜都市"
                        },
                        {
                            "dmId": "420582",
                            "name": "当阳市"
                        },
                        {
                            "dmId": "420583",
                            "name": "枝江市"
                        }
                    ],
                    "dmId": "420500",
                    "name": "宜昌市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420602",
                            "name": "襄城区"
                        },
                        {
                            "dmId": "420606",
                            "name": "樊城区"
                        },
                        {
                            "dmId": "420607",
                            "name": "襄州区"
                        },
                        {
                            "dmId": "420624",
                            "name": "南漳县"
                        },
                        {
                            "dmId": "420625",
                            "name": "谷城县"
                        },
                        {
                            "dmId": "420626",
                            "name": "保康县"
                        },
                        {
                            "dmId": "420682",
                            "name": "老河口市"
                        },
                        {
                            "dmId": "420683",
                            "name": "枣阳市"
                        },
                        {
                            "dmId": "420684",
                            "name": "宜城市"
                        }
                    ],
                    "dmId": "420600",
                    "name": "襄阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420702",
                            "name": "梁子湖区"
                        },
                        {
                            "dmId": "420703",
                            "name": "华容区"
                        },
                        {
                            "dmId": "420704",
                            "name": "鄂城区"
                        }
                    ],
                    "dmId": "420700",
                    "name": "鄂州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420802",
                            "name": "东宝区"
                        },
                        {
                            "dmId": "420804",
                            "name": "掇刀区"
                        },
                        {
                            "dmId": "420821",
                            "name": "京山县"
                        },
                        {
                            "dmId": "420822",
                            "name": "沙洋县"
                        },
                        {
                            "dmId": "420881",
                            "name": "钟祥市"
                        }
                    ],
                    "dmId": "420800",
                    "name": "荆门市"
                },
                {
                    "childs": [
                        {
                            "dmId": "420902",
                            "name": "孝南区"
                        },
                        {
                            "dmId": "420921",
                            "name": "孝昌县"
                        },
                        {
                            "dmId": "420922",
                            "name": "大悟县"
                        },
                        {
                            "dmId": "420923",
                            "name": "云梦县"
                        },
                        {
                            "dmId": "420981",
                            "name": "应城市"
                        },
                        {
                            "dmId": "420982",
                            "name": "安陆市"
                        },
                        {
                            "dmId": "420984",
                            "name": "汉川市"
                        }
                    ],
                    "dmId": "420900",
                    "name": "孝感市"
                },
                {
                    "childs": [
                        {
                            "dmId": "421002",
                            "name": "沙市区"
                        },
                        {
                            "dmId": "421003",
                            "name": "荆州区"
                        },
                        {
                            "dmId": "421022",
                            "name": "公安县"
                        },
                        {
                            "dmId": "421023",
                            "name": "监利县"
                        },
                        {
                            "dmId": "421024",
                            "name": "江陵县"
                        },
                        {
                            "dmId": "421081",
                            "name": "石首市"
                        },
                        {
                            "dmId": "421083",
                            "name": "洪湖市"
                        },
                        {
                            "dmId": "421087",
                            "name": "松滋市"
                        }
                    ],
                    "dmId": "421000",
                    "name": "荆州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "421102",
                            "name": "黄州区"
                        },
                        {
                            "dmId": "421121",
                            "name": "团风县"
                        },
                        {
                            "dmId": "421122",
                            "name": "红安县"
                        },
                        {
                            "dmId": "421123",
                            "name": "罗田县"
                        },
                        {
                            "dmId": "421124",
                            "name": "英山县"
                        },
                        {
                            "dmId": "421125",
                            "name": "浠水县"
                        },
                        {
                            "dmId": "421126",
                            "name": "蕲春县"
                        },
                        {
                            "dmId": "421127",
                            "name": "黄梅县"
                        },
                        {
                            "dmId": "421181",
                            "name": "麻城市"
                        },
                        {
                            "dmId": "421182",
                            "name": "武穴市"
                        }
                    ],
                    "dmId": "421100",
                    "name": "黄冈市"
                },
                {
                    "childs": [
                        {
                            "dmId": "421202",
                            "name": "咸安区"
                        },
                        {
                            "dmId": "421221",
                            "name": "嘉鱼县"
                        },
                        {
                            "dmId": "421222",
                            "name": "通城县"
                        },
                        {
                            "dmId": "421223",
                            "name": "崇阳县"
                        },
                        {
                            "dmId": "421224",
                            "name": "通山县"
                        },
                        {
                            "dmId": "421281",
                            "name": "赤壁市"
                        }
                    ],
                    "dmId": "421200",
                    "name": "咸宁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "421302",
                            "name": "曾都区"
                        },
                        {
                            "dmId": "421321",
                            "name": "随县"
                        },
                        {
                            "dmId": "421381",
                            "name": "广水市"
                        }
                    ],
                    "dmId": "421300",
                    "name": "随州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "422801",
                            "name": "恩施市"
                        },
                        {
                            "dmId": "422802",
                            "name": "利川市"
                        },
                        {
                            "dmId": "422822",
                            "name": "建始县"
                        },
                        {
                            "dmId": "422823",
                            "name": "巴东县"
                        },
                        {
                            "dmId": "422825",
                            "name": "宣恩县"
                        },
                        {
                            "dmId": "422826",
                            "name": "咸丰县"
                        },
                        {
                            "dmId": "422827",
                            "name": "来凤县"
                        },
                        {
                            "dmId": "422828",
                            "name": "鹤峰县"
                        }
                    ],
                    "dmId": "422800",
                    "name": "恩施土家族苗族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "429004",
                            "name": "仙桃市"
                        },
                        {
                            "dmId": "429005",
                            "name": "潜江市"
                        },
                        {
                            "dmId": "429006",
                            "name": "天门市"
                        },
                        {
                            "dmId": "429021",
                            "name": "神农架林区"
                        }
                    ],
                    "dmId": "429000",
                    "name": "直辖县级"
                }
            ],
            "dmId": "420000",
            "name": "湖北省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "430102",
                            "name": "芙蓉区"
                        },
                        {
                            "dmId": "430103",
                            "name": "天心区"
                        },
                        {
                            "dmId": "430104",
                            "name": "岳麓区"
                        },
                        {
                            "dmId": "430105",
                            "name": "开福区"
                        },
                        {
                            "dmId": "430111",
                            "name": "雨花区"
                        },
                        {
                            "dmId": "430121",
                            "name": "长沙县"
                        },
                        {
                            "dmId": "430122",
                            "name": "望城区"
                        },
                        {
                            "dmId": "430124",
                            "name": "宁乡县"
                        },
                        {
                            "dmId": "430181",
                            "name": "浏阳市"
                        }
                    ],
                    "dmId": "430100",
                    "name": "长沙市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430202",
                            "name": "荷塘区"
                        },
                        {
                            "dmId": "430203",
                            "name": "芦淞区"
                        },
                        {
                            "dmId": "430204",
                            "name": "石峰区"
                        },
                        {
                            "dmId": "430211",
                            "name": "天元区"
                        },
                        {
                            "dmId": "430221",
                            "name": "株洲县"
                        },
                        {
                            "dmId": "430223",
                            "name": "攸县"
                        },
                        {
                            "dmId": "430224",
                            "name": "茶陵县"
                        },
                        {
                            "dmId": "430225",
                            "name": "炎陵县"
                        },
                        {
                            "dmId": "430281",
                            "name": "醴陵市"
                        }
                    ],
                    "dmId": "430200",
                    "name": "株洲市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430302",
                            "name": "雨湖区"
                        },
                        {
                            "dmId": "430304",
                            "name": "岳塘区"
                        },
                        {
                            "dmId": "430321",
                            "name": "湘潭县"
                        },
                        {
                            "dmId": "430381",
                            "name": "湘乡市"
                        },
                        {
                            "dmId": "430382",
                            "name": "韶山市"
                        }
                    ],
                    "dmId": "430300",
                    "name": "湘潭市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430405",
                            "name": "珠晖区"
                        },
                        {
                            "dmId": "430406",
                            "name": "雁峰区"
                        },
                        {
                            "dmId": "430407",
                            "name": "石鼓区"
                        },
                        {
                            "dmId": "430408",
                            "name": "蒸湘区"
                        },
                        {
                            "dmId": "430412",
                            "name": "南岳区"
                        },
                        {
                            "dmId": "430421",
                            "name": "衡阳县"
                        },
                        {
                            "dmId": "430422",
                            "name": "衡南县"
                        },
                        {
                            "dmId": "430423",
                            "name": "衡山县"
                        },
                        {
                            "dmId": "430424",
                            "name": "衡东县"
                        },
                        {
                            "dmId": "430426",
                            "name": "祁东县"
                        },
                        {
                            "dmId": "430481",
                            "name": "耒阳市"
                        },
                        {
                            "dmId": "430482",
                            "name": "常宁市"
                        }
                    ],
                    "dmId": "430400",
                    "name": "衡阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430502",
                            "name": "双清区"
                        },
                        {
                            "dmId": "430503",
                            "name": "大祥区"
                        },
                        {
                            "dmId": "430511",
                            "name": "北塔区"
                        },
                        {
                            "dmId": "430521",
                            "name": "邵东县"
                        },
                        {
                            "dmId": "430522",
                            "name": "新邵县"
                        },
                        {
                            "dmId": "430523",
                            "name": "邵阳县"
                        },
                        {
                            "dmId": "430524",
                            "name": "隆回县"
                        },
                        {
                            "dmId": "430525",
                            "name": "洞口县"
                        },
                        {
                            "dmId": "430527",
                            "name": "绥宁县"
                        },
                        {
                            "dmId": "430528",
                            "name": "新宁县"
                        },
                        {
                            "dmId": "430529",
                            "name": "城步苗族自治县"
                        },
                        {
                            "dmId": "430581",
                            "name": "武冈市"
                        }
                    ],
                    "dmId": "430500",
                    "name": "邵阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430602",
                            "name": "岳阳楼区"
                        },
                        {
                            "dmId": "430603",
                            "name": "云溪区"
                        },
                        {
                            "dmId": "430611",
                            "name": "君山区"
                        },
                        {
                            "dmId": "430621",
                            "name": "岳阳县"
                        },
                        {
                            "dmId": "430623",
                            "name": "华容县"
                        },
                        {
                            "dmId": "430624",
                            "name": "湘阴县"
                        },
                        {
                            "dmId": "430626",
                            "name": "平江县"
                        },
                        {
                            "dmId": "430681",
                            "name": "汨罗市"
                        },
                        {
                            "dmId": "430682",
                            "name": "临湘市"
                        }
                    ],
                    "dmId": "430600",
                    "name": "岳阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430702",
                            "name": "武陵区"
                        },
                        {
                            "dmId": "430703",
                            "name": "鼎城区"
                        },
                        {
                            "dmId": "430721",
                            "name": "安乡县"
                        },
                        {
                            "dmId": "430722",
                            "name": "汉寿县"
                        },
                        {
                            "dmId": "430723",
                            "name": "澧县"
                        },
                        {
                            "dmId": "430724",
                            "name": "临澧县"
                        },
                        {
                            "dmId": "430725",
                            "name": "桃源县"
                        },
                        {
                            "dmId": "430726",
                            "name": "石门县"
                        },
                        {
                            "dmId": "430781",
                            "name": "津市市"
                        }
                    ],
                    "dmId": "430700",
                    "name": "常德市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430802",
                            "name": "永定区"
                        },
                        {
                            "dmId": "430811",
                            "name": "武陵源区"
                        },
                        {
                            "dmId": "430821",
                            "name": "慈利县"
                        },
                        {
                            "dmId": "430822",
                            "name": "桑植县"
                        }
                    ],
                    "dmId": "430800",
                    "name": "张家界市"
                },
                {
                    "childs": [
                        {
                            "dmId": "430902",
                            "name": "资阳区"
                        },
                        {
                            "dmId": "430903",
                            "name": "赫山区"
                        },
                        {
                            "dmId": "430921",
                            "name": "南县"
                        },
                        {
                            "dmId": "430922",
                            "name": "桃江县"
                        },
                        {
                            "dmId": "430923",
                            "name": "安化县"
                        },
                        {
                            "dmId": "430981",
                            "name": "沅江市"
                        }
                    ],
                    "dmId": "430900",
                    "name": "益阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "431002",
                            "name": "北湖区"
                        },
                        {
                            "dmId": "431003",
                            "name": "苏仙区"
                        },
                        {
                            "dmId": "431021",
                            "name": "桂阳县"
                        },
                        {
                            "dmId": "431022",
                            "name": "宜章县"
                        },
                        {
                            "dmId": "431023",
                            "name": "永兴县"
                        },
                        {
                            "dmId": "431024",
                            "name": "嘉禾县"
                        },
                        {
                            "dmId": "431025",
                            "name": "临武县"
                        },
                        {
                            "dmId": "431026",
                            "name": "汝城县"
                        },
                        {
                            "dmId": "431027",
                            "name": "桂东县"
                        },
                        {
                            "dmId": "431028",
                            "name": "安仁县"
                        },
                        {
                            "dmId": "431081",
                            "name": "资兴市"
                        }
                    ],
                    "dmId": "431000",
                    "name": "郴州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "431102",
                            "name": "零陵区"
                        },
                        {
                            "dmId": "431103",
                            "name": "冷水滩区"
                        },
                        {
                            "dmId": "431121",
                            "name": "祁阳县"
                        },
                        {
                            "dmId": "431122",
                            "name": "东安县"
                        },
                        {
                            "dmId": "431123",
                            "name": "双牌县"
                        },
                        {
                            "dmId": "431124",
                            "name": "道县"
                        },
                        {
                            "dmId": "431125",
                            "name": "江永县"
                        },
                        {
                            "dmId": "431126",
                            "name": "宁远县"
                        },
                        {
                            "dmId": "431127",
                            "name": "蓝山县"
                        },
                        {
                            "dmId": "431128",
                            "name": "新田县"
                        },
                        {
                            "dmId": "431129",
                            "name": "江华瑶族自治县"
                        }
                    ],
                    "dmId": "431100",
                    "name": "永州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "431202",
                            "name": "鹤城区"
                        },
                        {
                            "dmId": "431221",
                            "name": "中方县"
                        },
                        {
                            "dmId": "431222",
                            "name": "沅陵县"
                        },
                        {
                            "dmId": "431223",
                            "name": "辰溪县"
                        },
                        {
                            "dmId": "431224",
                            "name": "溆浦县"
                        },
                        {
                            "dmId": "431225",
                            "name": "会同县"
                        },
                        {
                            "dmId": "431226",
                            "name": "麻阳苗族自治县"
                        },
                        {
                            "dmId": "431227",
                            "name": "新晃侗族自治县"
                        },
                        {
                            "dmId": "431228",
                            "name": "芷江侗族自治县"
                        },
                        {
                            "dmId": "431229",
                            "name": "靖州苗族侗族自治县"
                        },
                        {
                            "dmId": "431230",
                            "name": "通道侗族自治县"
                        },
                        {
                            "dmId": "431281",
                            "name": "洪江市"
                        }
                    ],
                    "dmId": "431200",
                    "name": "怀化市"
                },
                {
                    "childs": [
                        {
                            "dmId": "431302",
                            "name": "娄星区"
                        },
                        {
                            "dmId": "431321",
                            "name": "双峰县"
                        },
                        {
                            "dmId": "431322",
                            "name": "新化县"
                        },
                        {
                            "dmId": "431381",
                            "name": "冷水江市"
                        },
                        {
                            "dmId": "431382",
                            "name": "涟源市"
                        }
                    ],
                    "dmId": "431300",
                    "name": "娄底市"
                },
                {
                    "childs": [
                        {
                            "dmId": "433101",
                            "name": "吉首市"
                        },
                        {
                            "dmId": "433122",
                            "name": "泸溪县"
                        },
                        {
                            "dmId": "433123",
                            "name": "凤凰县"
                        },
                        {
                            "dmId": "433124",
                            "name": "花垣县"
                        },
                        {
                            "dmId": "433125",
                            "name": "保靖县"
                        },
                        {
                            "dmId": "433126",
                            "name": "古丈县"
                        },
                        {
                            "dmId": "433127",
                            "name": "永顺县"
                        },
                        {
                            "dmId": "433130",
                            "name": "龙山县"
                        }
                    ],
                    "dmId": "433100",
                    "name": "湘西土家族苗族自治州"
                }
            ],
            "dmId": "430000",
            "name": "湖南省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "440103",
                            "name": "荔湾区"
                        },
                        {
                            "dmId": "440104",
                            "name": "越秀区"
                        },
                        {
                            "dmId": "440105",
                            "name": "海珠区"
                        },
                        {
                            "dmId": "440106",
                            "name": "天河区"
                        },
                        {
                            "dmId": "440111",
                            "name": "白云区"
                        },
                        {
                            "dmId": "440112",
                            "name": "黄埔区"
                        },
                        {
                            "dmId": "440113",
                            "name": "番禺区"
                        },
                        {
                            "dmId": "440114",
                            "name": "花都区"
                        },
                        {
                            "dmId": "440115",
                            "name": "南沙区"
                        },
                        {
                            "dmId": "440116",
                            "name": "萝岗区"
                        },
                        {
                            "dmId": "440183",
                            "name": "增城市"
                        },
                        {
                            "dmId": "440184",
                            "name": "从化市"
                        }
                    ],
                    "dmId": "440100",
                    "name": "广州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440203",
                            "name": "武江区"
                        },
                        {
                            "dmId": "440204",
                            "name": "浈江区"
                        },
                        {
                            "dmId": "440205",
                            "name": "曲江区"
                        },
                        {
                            "dmId": "440222",
                            "name": "始兴县"
                        },
                        {
                            "dmId": "440224",
                            "name": "仁化县"
                        },
                        {
                            "dmId": "440229",
                            "name": "翁源县"
                        },
                        {
                            "dmId": "440232",
                            "name": "乳源瑶族自治县"
                        },
                        {
                            "dmId": "440233",
                            "name": "新丰县"
                        },
                        {
                            "dmId": "440281",
                            "name": "乐昌市"
                        },
                        {
                            "dmId": "440282",
                            "name": "南雄市"
                        }
                    ],
                    "dmId": "440200",
                    "name": "韶关市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440303",
                            "name": "罗湖区"
                        },
                        {
                            "dmId": "440304",
                            "name": "福田区"
                        },
                        {
                            "dmId": "440305",
                            "name": "南山区"
                        },
                        {
                            "dmId": "440306",
                            "name": "宝安区"
                        },
                        {
                            "dmId": "440307",
                            "name": "龙岗区"
                        },
                        {
                            "dmId": "440308",
                            "name": "盐田区"
                        },
                        {
                            "dmId": "440320",
                            "name": "光明新区"
                        },
                        {
                            "dmId": "440321",
                            "name": "坪山新区"
                        },
                        {
                            "dmId": "440322",
                            "name": "大鹏新区"
                        },
                        {
                            "dmId": "440323",
                            "name": "龙华新区"
                        }
                    ],
                    "dmId": "440300",
                    "name": "深圳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440402",
                            "name": "香洲区"
                        },
                        {
                            "dmId": "440403",
                            "name": "斗门区"
                        },
                        {
                            "dmId": "440404",
                            "name": "金湾区"
                        }
                    ],
                    "dmId": "440400",
                    "name": "珠海市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440507",
                            "name": "龙湖区"
                        },
                        {
                            "dmId": "440511",
                            "name": "金平区"
                        },
                        {
                            "dmId": "440512",
                            "name": "濠江区"
                        },
                        {
                            "dmId": "440513",
                            "name": "潮阳区"
                        },
                        {
                            "dmId": "440514",
                            "name": "潮南区"
                        },
                        {
                            "dmId": "440515",
                            "name": "澄海区"
                        },
                        {
                            "dmId": "440523",
                            "name": "南澳县"
                        }
                    ],
                    "dmId": "440500",
                    "name": "汕头市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440604",
                            "name": "禅城区"
                        },
                        {
                            "dmId": "440605",
                            "name": "南海区"
                        },
                        {
                            "dmId": "440606",
                            "name": "顺德区"
                        },
                        {
                            "dmId": "440607",
                            "name": "三水区"
                        },
                        {
                            "dmId": "440608",
                            "name": "高明区"
                        }
                    ],
                    "dmId": "440600",
                    "name": "佛山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440703",
                            "name": "蓬江区"
                        },
                        {
                            "dmId": "440704",
                            "name": "江海区"
                        },
                        {
                            "dmId": "440705",
                            "name": "新会区"
                        },
                        {
                            "dmId": "440781",
                            "name": "台山市"
                        },
                        {
                            "dmId": "440783",
                            "name": "开平市"
                        },
                        {
                            "dmId": "440784",
                            "name": "鹤山市"
                        },
                        {
                            "dmId": "440785",
                            "name": "恩平市"
                        }
                    ],
                    "dmId": "440700",
                    "name": "江门市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440802",
                            "name": "赤坎区"
                        },
                        {
                            "dmId": "440803",
                            "name": "霞山区"
                        },
                        {
                            "dmId": "440804",
                            "name": "坡头区"
                        },
                        {
                            "dmId": "440811",
                            "name": "麻章区"
                        },
                        {
                            "dmId": "440823",
                            "name": "遂溪县"
                        },
                        {
                            "dmId": "440825",
                            "name": "徐闻县"
                        },
                        {
                            "dmId": "440881",
                            "name": "廉江市"
                        },
                        {
                            "dmId": "440882",
                            "name": "雷州市"
                        },
                        {
                            "dmId": "440883",
                            "name": "吴川市"
                        }
                    ],
                    "dmId": "440800",
                    "name": "湛江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "440902",
                            "name": "茂南区"
                        },
                        {
                            "dmId": "440903",
                            "name": "茂港区"
                        },
                        {
                            "dmId": "440923",
                            "name": "电白县"
                        },
                        {
                            "dmId": "440981",
                            "name": "高州市"
                        },
                        {
                            "dmId": "440982",
                            "name": "化州市"
                        },
                        {
                            "dmId": "440983",
                            "name": "信宜市"
                        }
                    ],
                    "dmId": "440900",
                    "name": "茂名市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441202",
                            "name": "端州区"
                        },
                        {
                            "dmId": "441203",
                            "name": "鼎湖区"
                        },
                        {
                            "dmId": "441223",
                            "name": "广宁县"
                        },
                        {
                            "dmId": "441224",
                            "name": "怀集县"
                        },
                        {
                            "dmId": "441225",
                            "name": "封开县"
                        },
                        {
                            "dmId": "441226",
                            "name": "德庆县"
                        },
                        {
                            "dmId": "441283",
                            "name": "高要市"
                        },
                        {
                            "dmId": "441284",
                            "name": "四会市"
                        }
                    ],
                    "dmId": "441200",
                    "name": "肇庆市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441302",
                            "name": "惠城区"
                        },
                        {
                            "dmId": "441303",
                            "name": "惠阳区"
                        },
                        {
                            "dmId": "441322",
                            "name": "博罗县"
                        },
                        {
                            "dmId": "441323",
                            "name": "惠东县"
                        },
                        {
                            "dmId": "441324",
                            "name": "龙门县"
                        }
                    ],
                    "dmId": "441300",
                    "name": "惠州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441402",
                            "name": "梅江区"
                        },
                        {
                            "dmId": "441421",
                            "name": "梅县"
                        },
                        {
                            "dmId": "441422",
                            "name": "大埔县"
                        },
                        {
                            "dmId": "441423",
                            "name": "丰顺县"
                        },
                        {
                            "dmId": "441424",
                            "name": "五华县"
                        },
                        {
                            "dmId": "441426",
                            "name": "平远县"
                        },
                        {
                            "dmId": "441427",
                            "name": "蕉岭县"
                        },
                        {
                            "dmId": "441481",
                            "name": "兴宁市"
                        }
                    ],
                    "dmId": "441400",
                    "name": "梅州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441502",
                            "name": "城区"
                        },
                        {
                            "dmId": "441521",
                            "name": "海丰县"
                        },
                        {
                            "dmId": "441523",
                            "name": "陆河县"
                        },
                        {
                            "dmId": "441581",
                            "name": "陆丰市"
                        }
                    ],
                    "dmId": "441500",
                    "name": "汕尾市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441602",
                            "name": "源城区"
                        },
                        {
                            "dmId": "441621",
                            "name": "紫金县"
                        },
                        {
                            "dmId": "441622",
                            "name": "龙川县"
                        },
                        {
                            "dmId": "441623",
                            "name": "连平县"
                        },
                        {
                            "dmId": "441624",
                            "name": "和平县"
                        },
                        {
                            "dmId": "441625",
                            "name": "东源县"
                        }
                    ],
                    "dmId": "441600",
                    "name": "河源市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441702",
                            "name": "江城区"
                        },
                        {
                            "dmId": "441721",
                            "name": "阳西县"
                        },
                        {
                            "dmId": "441723",
                            "name": "阳东县"
                        },
                        {
                            "dmId": "441781",
                            "name": "阳春市"
                        }
                    ],
                    "dmId": "441700",
                    "name": "阳江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441802",
                            "name": "清城区"
                        },
                        {
                            "dmId": "441821",
                            "name": "佛冈县"
                        },
                        {
                            "dmId": "441823",
                            "name": "阳山县"
                        },
                        {
                            "dmId": "441825",
                            "name": "连山壮族瑶族自治县"
                        },
                        {
                            "dmId": "441826",
                            "name": "连南瑶族自治县"
                        },
                        {
                            "dmId": "441827",
                            "name": "清新区"
                        },
                        {
                            "dmId": "441881",
                            "name": "英德市"
                        },
                        {
                            "dmId": "441882",
                            "name": "连州市"
                        }
                    ],
                    "dmId": "441800",
                    "name": "清远市"
                },
                {
                    "childs": [
                        {
                            "dmId": "441901003",
                            "name": "东城街道"
                        },
                        {
                            "dmId": "441901004",
                            "name": "南城街道"
                        },
                        {
                            "dmId": "441901005",
                            "name": "万江街道"
                        },
                        {
                            "dmId": "441901006",
                            "name": "莞城街道"
                        },
                        {
                            "dmId": "441901101",
                            "name": "石碣镇"
                        },
                        {
                            "dmId": "441901102",
                            "name": "石龙镇"
                        },
                        {
                            "dmId": "441901103",
                            "name": "茶山镇"
                        },
                        {
                            "dmId": "441901104",
                            "name": "石排镇"
                        },
                        {
                            "dmId": "441901105",
                            "name": "企石镇"
                        },
                        {
                            "dmId": "441901106",
                            "name": "横沥镇"
                        },
                        {
                            "dmId": "441901107",
                            "name": "桥头镇"
                        },
                        {
                            "dmId": "441901108",
                            "name": "谢岗镇"
                        },
                        {
                            "dmId": "441901109",
                            "name": "东坑镇"
                        },
                        {
                            "dmId": "441901110",
                            "name": "常平镇"
                        },
                        {
                            "dmId": "441901111",
                            "name": "寮步镇"
                        },
                        {
                            "dmId": "441901112",
                            "name": "樟木头镇"
                        },
                        {
                            "dmId": "441901113",
                            "name": "大朗镇"
                        },
                        {
                            "dmId": "441901114",
                            "name": "黄江镇"
                        },
                        {
                            "dmId": "441901115",
                            "name": "清溪镇"
                        },
                        {
                            "dmId": "441901116",
                            "name": "塘厦镇"
                        },
                        {
                            "dmId": "441901117",
                            "name": "凤岗镇"
                        },
                        {
                            "dmId": "441901118",
                            "name": "大岭山镇"
                        },
                        {
                            "dmId": "441901119",
                            "name": "长安镇"
                        },
                        {
                            "dmId": "441901121",
                            "name": "虎门镇"
                        },
                        {
                            "dmId": "441901122",
                            "name": "厚街镇"
                        },
                        {
                            "dmId": "441901123",
                            "name": "沙田镇"
                        },
                        {
                            "dmId": "441901124",
                            "name": "道滘镇"
                        },
                        {
                            "dmId": "441901125",
                            "name": "洪梅镇"
                        },
                        {
                            "dmId": "441901126",
                            "name": "麻涌镇"
                        },
                        {
                            "dmId": "441901127",
                            "name": "望牛墩镇"
                        },
                        {
                            "dmId": "441901128",
                            "name": "中堂镇"
                        },
                        {
                            "dmId": "441901129",
                            "name": "高埗镇"
                        },
                        {
                            "dmId": "441901401",
                            "name": "松山湖管委会"
                        },
                        {
                            "dmId": "441901402",
                            "name": "虎门港管委会"
                        },
                        {
                            "dmId": "441901403",
                            "name": "东莞生态园"
                        }
                    ],
                    "dmId": "441900",
                    "name": "东莞市"
                },
                {
                    "childs": [
                        {
                            "dmId": "442001001",
                            "name": "石岐区街道"
                        },
                        {
                            "dmId": "442001002",
                            "name": "东区街道"
                        },
                        {
                            "dmId": "442001003",
                            "name": "火炬开发区街道"
                        },
                        {
                            "dmId": "442001004",
                            "name": "西区街道"
                        },
                        {
                            "dmId": "442001005",
                            "name": "南区街道"
                        },
                        {
                            "dmId": "442001006",
                            "name": "五桂山街道"
                        },
                        {
                            "dmId": "442001100",
                            "name": "小榄镇"
                        },
                        {
                            "dmId": "442001101",
                            "name": "黄圃镇"
                        },
                        {
                            "dmId": "442001102",
                            "name": "民众镇"
                        },
                        {
                            "dmId": "442001103",
                            "name": "东凤镇"
                        },
                        {
                            "dmId": "442001104",
                            "name": "东升镇"
                        },
                        {
                            "dmId": "442001105",
                            "name": "古镇镇"
                        },
                        {
                            "dmId": "442001106",
                            "name": "沙溪镇"
                        },
                        {
                            "dmId": "442001107",
                            "name": "坦洲镇"
                        },
                        {
                            "dmId": "442001108",
                            "name": "港口镇"
                        },
                        {
                            "dmId": "442001109",
                            "name": "三角镇"
                        },
                        {
                            "dmId": "442001110",
                            "name": "横栏镇"
                        },
                        {
                            "dmId": "442001111",
                            "name": "南头镇"
                        },
                        {
                            "dmId": "442001112",
                            "name": "阜沙镇"
                        },
                        {
                            "dmId": "442001113",
                            "name": "南朗镇"
                        },
                        {
                            "dmId": "442001114",
                            "name": "三乡镇"
                        },
                        {
                            "dmId": "442001115",
                            "name": "板芙镇"
                        },
                        {
                            "dmId": "442001116",
                            "name": "大涌镇"
                        },
                        {
                            "dmId": "442001117",
                            "name": "神湾镇"
                        }
                    ],
                    "dmId": "442000",
                    "name": "中山市"
                },
                {
                    "dmId": "442101",
                    "name": "东沙群岛"
                },
                {
                    "childs": [
                        {
                            "dmId": "445102",
                            "name": "湘桥区"
                        },
                        {
                            "dmId": "445121",
                            "name": "潮安区"
                        },
                        {
                            "dmId": "445122",
                            "name": "饶平县"
                        }
                    ],
                    "dmId": "445100",
                    "name": "潮州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "445202",
                            "name": "榕城区"
                        },
                        {
                            "dmId": "445221",
                            "name": "揭东区"
                        },
                        {
                            "dmId": "445222",
                            "name": "揭西县"
                        },
                        {
                            "dmId": "445224",
                            "name": "惠来县"
                        },
                        {
                            "dmId": "445281",
                            "name": "普宁市"
                        }
                    ],
                    "dmId": "445200",
                    "name": "揭阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "445302",
                            "name": "云城区"
                        },
                        {
                            "dmId": "445321",
                            "name": "新兴县"
                        },
                        {
                            "dmId": "445322",
                            "name": "郁南县"
                        },
                        {
                            "dmId": "445323",
                            "name": "云安县"
                        },
                        {
                            "dmId": "445381",
                            "name": "罗定市"
                        }
                    ],
                    "dmId": "445300",
                    "name": "云浮市"
                }
            ],
            "dmId": "440000",
            "name": "广东省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "450102",
                            "name": "兴宁区"
                        },
                        {
                            "dmId": "450103",
                            "name": "青秀区"
                        },
                        {
                            "dmId": "450105",
                            "name": "江南区"
                        },
                        {
                            "dmId": "450107",
                            "name": "西乡塘区"
                        },
                        {
                            "dmId": "450108",
                            "name": "良庆区"
                        },
                        {
                            "dmId": "450109",
                            "name": "邕宁区"
                        },
                        {
                            "dmId": "450122",
                            "name": "武鸣县"
                        },
                        {
                            "dmId": "450123",
                            "name": "隆安县"
                        },
                        {
                            "dmId": "450124",
                            "name": "马山县"
                        },
                        {
                            "dmId": "450125",
                            "name": "上林县"
                        },
                        {
                            "dmId": "450126",
                            "name": "宾阳县"
                        },
                        {
                            "dmId": "450127",
                            "name": "横县"
                        }
                    ],
                    "dmId": "450100",
                    "name": "南宁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450202",
                            "name": "城中区"
                        },
                        {
                            "dmId": "450203",
                            "name": "鱼峰区"
                        },
                        {
                            "dmId": "450204",
                            "name": "柳南区"
                        },
                        {
                            "dmId": "450205",
                            "name": "柳北区"
                        },
                        {
                            "dmId": "450221",
                            "name": "柳江县"
                        },
                        {
                            "dmId": "450222",
                            "name": "柳城县"
                        },
                        {
                            "dmId": "450223",
                            "name": "鹿寨县"
                        },
                        {
                            "dmId": "450224",
                            "name": "融安县"
                        },
                        {
                            "dmId": "450225",
                            "name": "融水苗族自治县"
                        },
                        {
                            "dmId": "450226",
                            "name": "三江侗族自治县"
                        }
                    ],
                    "dmId": "450200",
                    "name": "柳州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450302",
                            "name": "秀峰区"
                        },
                        {
                            "dmId": "450303",
                            "name": "叠彩区"
                        },
                        {
                            "dmId": "450304",
                            "name": "象山区"
                        },
                        {
                            "dmId": "450305",
                            "name": "七星区"
                        },
                        {
                            "dmId": "450311",
                            "name": "雁山区"
                        },
                        {
                            "dmId": "450321",
                            "name": "阳朔县"
                        },
                        {
                            "dmId": "450322",
                            "name": "临桂区"
                        },
                        {
                            "dmId": "450323",
                            "name": "灵川县"
                        },
                        {
                            "dmId": "450324",
                            "name": "全州县"
                        },
                        {
                            "dmId": "450325",
                            "name": "兴安县"
                        },
                        {
                            "dmId": "450326",
                            "name": "永福县"
                        },
                        {
                            "dmId": "450327",
                            "name": "灌阳县"
                        },
                        {
                            "dmId": "450328",
                            "name": "龙胜各族自治县"
                        },
                        {
                            "dmId": "450329",
                            "name": "资源县"
                        },
                        {
                            "dmId": "450330",
                            "name": "平乐县"
                        },
                        {
                            "dmId": "450331",
                            "name": "荔浦县"
                        },
                        {
                            "dmId": "450332",
                            "name": "恭城瑶族自治县"
                        }
                    ],
                    "dmId": "450300",
                    "name": "桂林市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450403",
                            "name": "万秀区"
                        },
                        {
                            "dmId": "450405",
                            "name": "长洲区"
                        },
                        {
                            "dmId": "450406",
                            "name": "龙圩区"
                        },
                        {
                            "dmId": "450421",
                            "name": "苍梧县"
                        },
                        {
                            "dmId": "450422",
                            "name": "藤县"
                        },
                        {
                            "dmId": "450423",
                            "name": "蒙山县"
                        },
                        {
                            "dmId": "450481",
                            "name": "岑溪市"
                        }
                    ],
                    "dmId": "450400",
                    "name": "梧州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450502",
                            "name": "海城区"
                        },
                        {
                            "dmId": "450503",
                            "name": "银海区"
                        },
                        {
                            "dmId": "450512",
                            "name": "铁山港区"
                        },
                        {
                            "dmId": "450521",
                            "name": "合浦县"
                        }
                    ],
                    "dmId": "450500",
                    "name": "北海市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450602",
                            "name": "港口区"
                        },
                        {
                            "dmId": "450603",
                            "name": "防城区"
                        },
                        {
                            "dmId": "450621",
                            "name": "上思县"
                        },
                        {
                            "dmId": "450681",
                            "name": "东兴市"
                        }
                    ],
                    "dmId": "450600",
                    "name": "防城港市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450702",
                            "name": "钦南区"
                        },
                        {
                            "dmId": "450703",
                            "name": "钦北区"
                        },
                        {
                            "dmId": "450721",
                            "name": "灵山县"
                        },
                        {
                            "dmId": "450722",
                            "name": "浦北县"
                        }
                    ],
                    "dmId": "450700",
                    "name": "钦州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450802",
                            "name": "港北区"
                        },
                        {
                            "dmId": "450803",
                            "name": "港南区"
                        },
                        {
                            "dmId": "450804",
                            "name": "覃塘区"
                        },
                        {
                            "dmId": "450821",
                            "name": "平南县"
                        },
                        {
                            "dmId": "450881",
                            "name": "桂平市"
                        }
                    ],
                    "dmId": "450800",
                    "name": "贵港市"
                },
                {
                    "childs": [
                        {
                            "dmId": "450902",
                            "name": "玉州区"
                        },
                        {
                            "dmId": "450903",
                            "name": "福绵区"
                        },
                        {
                            "dmId": "450921",
                            "name": "容县"
                        },
                        {
                            "dmId": "450922",
                            "name": "陆川县"
                        },
                        {
                            "dmId": "450923",
                            "name": "博白县"
                        },
                        {
                            "dmId": "450924",
                            "name": "兴业县"
                        },
                        {
                            "dmId": "450981",
                            "name": "北流市"
                        }
                    ],
                    "dmId": "450900",
                    "name": "玉林市"
                },
                {
                    "childs": [
                        {
                            "dmId": "451002",
                            "name": "右江区"
                        },
                        {
                            "dmId": "451021",
                            "name": "田阳县"
                        },
                        {
                            "dmId": "451022",
                            "name": "田东县"
                        },
                        {
                            "dmId": "451023",
                            "name": "平果县"
                        },
                        {
                            "dmId": "451024",
                            "name": "德保县"
                        },
                        {
                            "dmId": "451025",
                            "name": "靖西县"
                        },
                        {
                            "dmId": "451026",
                            "name": "那坡县"
                        },
                        {
                            "dmId": "451027",
                            "name": "凌云县"
                        },
                        {
                            "dmId": "451028",
                            "name": "乐业县"
                        },
                        {
                            "dmId": "451029",
                            "name": "田林县"
                        },
                        {
                            "dmId": "451030",
                            "name": "西林县"
                        },
                        {
                            "dmId": "451031",
                            "name": "隆林各族自治县"
                        }
                    ],
                    "dmId": "451000",
                    "name": "百色市"
                },
                {
                    "childs": [
                        {
                            "dmId": "451102",
                            "name": "八步区"
                        },
                        {
                            "dmId": "451119",
                            "name": "平桂管理区"
                        },
                        {
                            "dmId": "451121",
                            "name": "昭平县"
                        },
                        {
                            "dmId": "451122",
                            "name": "钟山县"
                        },
                        {
                            "dmId": "451123",
                            "name": "富川瑶族自治县"
                        }
                    ],
                    "dmId": "451100",
                    "name": "贺州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "451202",
                            "name": "金城江区"
                        },
                        {
                            "dmId": "451221",
                            "name": "南丹县"
                        },
                        {
                            "dmId": "451222",
                            "name": "天峨县"
                        },
                        {
                            "dmId": "451223",
                            "name": "凤山县"
                        },
                        {
                            "dmId": "451224",
                            "name": "东兰县"
                        },
                        {
                            "dmId": "451225",
                            "name": "罗城仫佬族自治县"
                        },
                        {
                            "dmId": "451226",
                            "name": "环江毛南族自治县"
                        },
                        {
                            "dmId": "451227",
                            "name": "巴马瑶族自治县"
                        },
                        {
                            "dmId": "451228",
                            "name": "都安瑶族自治县"
                        },
                        {
                            "dmId": "451229",
                            "name": "大化瑶族自治县"
                        },
                        {
                            "dmId": "451281",
                            "name": "宜州市"
                        }
                    ],
                    "dmId": "451200",
                    "name": "河池市"
                },
                {
                    "childs": [
                        {
                            "dmId": "451302",
                            "name": "兴宾区"
                        },
                        {
                            "dmId": "451321",
                            "name": "忻城县"
                        },
                        {
                            "dmId": "451322",
                            "name": "象州县"
                        },
                        {
                            "dmId": "451323",
                            "name": "武宣县"
                        },
                        {
                            "dmId": "451324",
                            "name": "金秀瑶族自治县"
                        },
                        {
                            "dmId": "451381",
                            "name": "合山市"
                        }
                    ],
                    "dmId": "451300",
                    "name": "来宾市"
                },
                {
                    "childs": [
                        {
                            "dmId": "451402",
                            "name": "江州区"
                        },
                        {
                            "dmId": "451421",
                            "name": "扶绥县"
                        },
                        {
                            "dmId": "451422",
                            "name": "宁明县"
                        },
                        {
                            "dmId": "451423",
                            "name": "龙州县"
                        },
                        {
                            "dmId": "451424",
                            "name": "大新县"
                        },
                        {
                            "dmId": "451425",
                            "name": "天等县"
                        },
                        {
                            "dmId": "451481",
                            "name": "凭祥市"
                        }
                    ],
                    "dmId": "451400",
                    "name": "崇左市"
                }
            ],
            "dmId": "450000",
            "name": "广西壮族自治区"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "460105",
                            "name": "秀英区"
                        },
                        {
                            "dmId": "460106",
                            "name": "龙华区"
                        },
                        {
                            "dmId": "460107",
                            "name": "琼山区"
                        },
                        {
                            "dmId": "460108",
                            "name": "美兰区"
                        }
                    ],
                    "dmId": "460100",
                    "name": "海口市"
                },
                {
                    "childs": [
                        {
                            "dmId": "460201100",
                            "name": "海棠湾镇"
                        },
                        {
                            "dmId": "460201101",
                            "name": "吉阳镇"
                        },
                        {
                            "dmId": "460201102",
                            "name": "凤凰镇"
                        },
                        {
                            "dmId": "460201103",
                            "name": "崖城镇"
                        },
                        {
                            "dmId": "460201104",
                            "name": "天涯镇"
                        },
                        {
                            "dmId": "460201105",
                            "name": "育才镇"
                        },
                        {
                            "dmId": "460201400",
                            "name": "国营南田农场"
                        },
                        {
                            "dmId": "460201401",
                            "name": "国营南新农场"
                        },
                        {
                            "dmId": "460201403",
                            "name": "国营立才农场"
                        },
                        {
                            "dmId": "460201404",
                            "name": "国营南滨农场"
                        },
                        {
                            "dmId": "460201451",
                            "name": "河西区街道"
                        },
                        {
                            "dmId": "460201452",
                            "name": "河东区街道"
                        }
                    ],
                    "dmId": "460200",
                    "name": "三亚市"
                },
                {
                    "childs": [
                        {
                            "dmId": "460321",
                            "name": "西沙群岛"
                        },
                        {
                            "dmId": "460322",
                            "name": "南沙群岛"
                        },
                        {
                            "dmId": "460323",
                            "name": "中沙群岛的岛礁及其海域"
                        }
                    ],
                    "dmId": "460300",
                    "name": "三沙市"
                },
                {
                    "childs": [
                        {
                            "dmId": "469001",
                            "name": "五指山市"
                        },
                        {
                            "dmId": "469002",
                            "name": "琼海市"
                        },
                        {
                            "dmId": "469005",
                            "name": "文昌市"
                        },
                        {
                            "dmId": "469006",
                            "name": "万宁市"
                        },
                        {
                            "dmId": "469007",
                            "name": "东方市"
                        },
                        {
                            "dmId": "469025",
                            "name": "定安县"
                        },
                        {
                            "dmId": "469026",
                            "name": "屯昌县"
                        },
                        {
                            "dmId": "469027",
                            "name": "澄迈县"
                        },
                        {
                            "dmId": "469028",
                            "name": "临高县"
                        },
                        {
                            "dmId": "469030",
                            "name": "白沙黎族自治县"
                        },
                        {
                            "dmId": "469031",
                            "name": "昌江黎族自治县"
                        },
                        {
                            "dmId": "469033",
                            "name": "乐东黎族自治县"
                        },
                        {
                            "dmId": "469034",
                            "name": "陵水黎族自治县"
                        },
                        {
                            "dmId": "469035",
                            "name": "保亭黎族苗族自治县"
                        },
                        {
                            "dmId": "469036",
                            "name": "琼中黎族苗族自治县"
                        }
                    ],
                    "dmId": "469000",
                    "name": "直辖县级"
                },
                {
                    "childs": [
                        {
                            "dmId": "469003100",
                            "name": "那大镇"
                        },
                        {
                            "dmId": "469003101",
                            "name": "和庆镇"
                        },
                        {
                            "dmId": "469003102",
                            "name": "南丰镇"
                        },
                        {
                            "dmId": "469003103",
                            "name": "大成镇"
                        },
                        {
                            "dmId": "469003104",
                            "name": "雅星镇"
                        },
                        {
                            "dmId": "469003105",
                            "name": "兰洋镇"
                        },
                        {
                            "dmId": "469003106",
                            "name": "光村镇"
                        },
                        {
                            "dmId": "469003107",
                            "name": "木棠镇"
                        },
                        {
                            "dmId": "469003108",
                            "name": "海头镇"
                        },
                        {
                            "dmId": "469003109",
                            "name": "峨蔓镇"
                        },
                        {
                            "dmId": "469003110",
                            "name": "三都镇"
                        },
                        {
                            "dmId": "469003111",
                            "name": "王五镇"
                        },
                        {
                            "dmId": "469003112",
                            "name": "白马井镇"
                        },
                        {
                            "dmId": "469003113",
                            "name": "中和镇"
                        },
                        {
                            "dmId": "469003114",
                            "name": "排浦镇"
                        },
                        {
                            "dmId": "469003115",
                            "name": "东成镇"
                        },
                        {
                            "dmId": "469003116",
                            "name": "新州镇"
                        },
                        {
                            "dmId": "469003400",
                            "name": "国营西培农场"
                        },
                        {
                            "dmId": "469003404",
                            "name": "国营西联农场"
                        },
                        {
                            "dmId": "469003405",
                            "name": "国营蓝洋农场"
                        },
                        {
                            "dmId": "469003407",
                            "name": "国营八一农场"
                        },
                        {
                            "dmId": "469003499",
                            "name": "洋浦经济开发区"
                        },
                        {
                            "dmId": "469003500",
                            "name": "华南热作学院"
                        }
                    ],
                    "dmId": "469003",
                    "name": "儋州市"
                }
            ],
            "dmId": "460000",
            "name": "海南省"
        },
        {
             "childs": [
                {
                    "dmId": "500101",
                    "name": "万州区"
                },
                {
                    "dmId": "500102",
                    "name": "涪陵区"
                },
                {
                    "dmId": "500103",
                    "name": "渝中区"
                },
                {
                    "dmId": "500104",
                    "name": "大渡口区"
                },
                {
                    "dmId": "500105",
                    "name": "江北区"
                },
                {
                    "dmId": "500106",
                    "name": "沙坪坝区"
                },
                {
                    "dmId": "500107",
                    "name": "九龙坡区"
                },
                {
                    "dmId": "500108",
                    "name": "南岸区"
                },
                {
                    "dmId": "500109",
                    "name": "北碚区"
                },
                {
                    "dmId": "500112",
                    "name": "渝北区"
                },
                {
                    "dmId": "500113",
                    "name": "巴南区"
                },
                {
                    "dmId": "500114",
                    "name": "黔江区"
                },
                {
                    "dmId": "500115",
                    "name": "长寿区"
                },
                {
                    "dmId": "500222",
                    "name": "綦江区"
                },
                {
                    "dmId": "500223",
                    "name": "潼南县"
                },
                {
                    "dmId": "500224",
                    "name": "铜梁县"
                },
                {
                    "dmId": "500225",
                    "name": "大足区"
                },
                {
                    "dmId": "500226",
                    "name": "荣昌县"
                },
                {
                    "dmId": "500227",
                    "name": "璧山县"
                },
                {
                    "dmId": "500228",
                    "name": "梁平县"
                },
                {
                    "dmId": "500229",
                    "name": "城口县"
                },
                {
                    "dmId": "500230",
                    "name": "丰都县"
                },
                {
                    "dmId": "500231",
                    "name": "垫江县"
                },
                {
                    "dmId": "500232",
                    "name": "武隆县"
                },
                {
                    "dmId": "500233",
                    "name": "忠县"
                },
                {
                    "dmId": "500234",
                    "name": "开县"
                },
                {
                    "dmId": "500235",
                    "name": "云阳县"
                },
                {
                    "dmId": "500236",
                    "name": "奉节县"
                },
                {
                    "dmId": "500237",
                    "name": "巫山县"
                },
                {
                    "dmId": "500238",
                    "name": "巫溪县"
                },
                {
                    "dmId": "500240",
                    "name": "石柱土家族自治县"
                },
                {
                    "dmId": "500241",
                    "name": "秀山土家族苗族自治县"
                },
                {
                    "dmId": "500242",
                    "name": "酉阳土家族苗族自治县"
                },
                {
                    "dmId": "500243",
                    "name": "彭水苗族土家族自治县"
                },
                {
                    "dmId": "500381",
                    "name": "江津区"
                },
                {
                    "dmId": "500382",
                    "name": "合川区"
                },
                {
                    "dmId": "500383",
                    "name": "永川区"
                },
                {
                    "dmId": "500384",
                    "name": "南川区"
                }
            ],
            "dmId": "500100",
            "name": "重庆市"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "510104",
                            "name": "锦江区"
                        },
                        {
                            "dmId": "510105",
                            "name": "青羊区"
                        },
                        {
                            "dmId": "510106",
                            "name": "金牛区"
                        },
                        {
                            "dmId": "510107",
                            "name": "武侯区"
                        },
                        {
                            "dmId": "510108",
                            "name": "成华区"
                        },
                        {
                            "dmId": "510112",
                            "name": "龙泉驿区"
                        },
                        {
                            "dmId": "510113",
                            "name": "青白江区"
                        },
                        {
                            "dmId": "510114",
                            "name": "新都区"
                        },
                        {
                            "dmId": "510115",
                            "name": "温江区"
                        },
                        {
                            "dmId": "510121",
                            "name": "金堂县"
                        },
                        {
                            "dmId": "510122",
                            "name": "双流县"
                        },
                        {
                            "dmId": "510124",
                            "name": "郫县"
                        },
                        {
                            "dmId": "510129",
                            "name": "大邑县"
                        },
                        {
                            "dmId": "510131",
                            "name": "蒲江县"
                        },
                        {
                            "dmId": "510132",
                            "name": "新津县"
                        },
                        {
                            "dmId": "510181",
                            "name": "都江堰市"
                        },
                        {
                            "dmId": "510182",
                            "name": "彭州市"
                        },
                        {
                            "dmId": "510183",
                            "name": "邛崃市"
                        },
                        {
                            "dmId": "510184",
                            "name": "崇州市"
                        }
                    ],
                    "dmId": "510100",
                    "name": "成都市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510302",
                            "name": "自流井区"
                        },
                        {
                            "dmId": "510303",
                            "name": "贡井区"
                        },
                        {
                            "dmId": "510304",
                            "name": "大安区"
                        },
                        {
                            "dmId": "510311",
                            "name": "沿滩区"
                        },
                        {
                            "dmId": "510321",
                            "name": "荣县"
                        },
                        {
                            "dmId": "510322",
                            "name": "富顺县"
                        }
                    ],
                    "dmId": "510300",
                    "name": "自贡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510402",
                            "name": "东区"
                        },
                        {
                            "dmId": "510403",
                            "name": "西区"
                        },
                        {
                            "dmId": "510411",
                            "name": "仁和区"
                        },
                        {
                            "dmId": "510421",
                            "name": "米易县"
                        },
                        {
                            "dmId": "510422",
                            "name": "盐边县"
                        }
                    ],
                    "dmId": "510400",
                    "name": "攀枝花市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510502",
                            "name": "江阳区"
                        },
                        {
                            "dmId": "510503",
                            "name": "纳溪区"
                        },
                        {
                            "dmId": "510504",
                            "name": "龙马潭区"
                        },
                        {
                            "dmId": "510521",
                            "name": "泸县"
                        },
                        {
                            "dmId": "510522",
                            "name": "合江县"
                        },
                        {
                            "dmId": "510524",
                            "name": "叙永县"
                        },
                        {
                            "dmId": "510525",
                            "name": "古蔺县"
                        }
                    ],
                    "dmId": "510500",
                    "name": "泸州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510603",
                            "name": "旌阳区"
                        },
                        {
                            "dmId": "510623",
                            "name": "中江县"
                        },
                        {
                            "dmId": "510626",
                            "name": "罗江县"
                        },
                        {
                            "dmId": "510681",
                            "name": "广汉市"
                        },
                        {
                            "dmId": "510682",
                            "name": "什邡市"
                        },
                        {
                            "dmId": "510683",
                            "name": "绵竹市"
                        }
                    ],
                    "dmId": "510600",
                    "name": "德阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510703",
                            "name": "涪城区"
                        },
                        {
                            "dmId": "510704",
                            "name": "游仙区"
                        },
                        {
                            "dmId": "510722",
                            "name": "三台县"
                        },
                        {
                            "dmId": "510723",
                            "name": "盐亭县"
                        },
                        {
                            "dmId": "510724",
                            "name": "安县"
                        },
                        {
                            "dmId": "510725",
                            "name": "梓潼县"
                        },
                        {
                            "dmId": "510726",
                            "name": "北川羌族自治县"
                        },
                        {
                            "dmId": "510727",
                            "name": "平武县"
                        },
                        {
                            "dmId": "510781",
                            "name": "江油市"
                        }
                    ],
                    "dmId": "510700",
                    "name": "绵阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510802",
                            "name": "利州区"
                        },
                        {
                            "dmId": "510811",
                            "name": "昭化区"
                        },
                        {
                            "dmId": "510812",
                            "name": "朝天区"
                        },
                        {
                            "dmId": "510821",
                            "name": "旺苍县"
                        },
                        {
                            "dmId": "510822",
                            "name": "青川县"
                        },
                        {
                            "dmId": "510823",
                            "name": "剑阁县"
                        },
                        {
                            "dmId": "510824",
                            "name": "苍溪县"
                        }
                    ],
                    "dmId": "510800",
                    "name": "广元市"
                },
                {
                    "childs": [
                        {
                            "dmId": "510903",
                            "name": "船山区"
                        },
                        {
                            "dmId": "510904",
                            "name": "安居区"
                        },
                        {
                            "dmId": "510921",
                            "name": "蓬溪县"
                        },
                        {
                            "dmId": "510922",
                            "name": "射洪县"
                        },
                        {
                            "dmId": "510923",
                            "name": "大英县"
                        }
                    ],
                    "dmId": "510900",
                    "name": "遂宁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511002",
                            "name": "市中区"
                        },
                        {
                            "dmId": "511011",
                            "name": "东兴区"
                        },
                        {
                            "dmId": "511024",
                            "name": "威远县"
                        },
                        {
                            "dmId": "511025",
                            "name": "资中县"
                        },
                        {
                            "dmId": "511028",
                            "name": "隆昌县"
                        }
                    ],
                    "dmId": "511000",
                    "name": "内江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511102",
                            "name": "市中区"
                        },
                        {
                            "dmId": "511111",
                            "name": "沙湾区"
                        },
                        {
                            "dmId": "511112",
                            "name": "五通桥区"
                        },
                        {
                            "dmId": "511113",
                            "name": "金口河区"
                        },
                        {
                            "dmId": "511123",
                            "name": "犍为县"
                        },
                        {
                            "dmId": "511124",
                            "name": "井研县"
                        },
                        {
                            "dmId": "511126",
                            "name": "夹江县"
                        },
                        {
                            "dmId": "511129",
                            "name": "沐川县"
                        },
                        {
                            "dmId": "511132",
                            "name": "峨边彝族自治县"
                        },
                        {
                            "dmId": "511133",
                            "name": "马边彝族自治县"
                        },
                        {
                            "dmId": "511181",
                            "name": "峨眉山市"
                        }
                    ],
                    "dmId": "511100",
                    "name": "乐山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511302",
                            "name": "顺庆区"
                        },
                        {
                            "dmId": "511303",
                            "name": "高坪区"
                        },
                        {
                            "dmId": "511304",
                            "name": "嘉陵区"
                        },
                        {
                            "dmId": "511321",
                            "name": "南部县"
                        },
                        {
                            "dmId": "511322",
                            "name": "营山县"
                        },
                        {
                            "dmId": "511323",
                            "name": "蓬安县"
                        },
                        {
                            "dmId": "511324",
                            "name": "仪陇县"
                        },
                        {
                            "dmId": "511325",
                            "name": "西充县"
                        },
                        {
                            "dmId": "511381",
                            "name": "阆中市"
                        }
                    ],
                    "dmId": "511300",
                    "name": "南充市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511402",
                            "name": "东坡区"
                        },
                        {
                            "dmId": "511421",
                            "name": "仁寿县"
                        },
                        {
                            "dmId": "511422",
                            "name": "彭山县"
                        },
                        {
                            "dmId": "511423",
                            "name": "洪雅县"
                        },
                        {
                            "dmId": "511424",
                            "name": "丹棱县"
                        },
                        {
                            "dmId": "511425",
                            "name": "青神县"
                        }
                    ],
                    "dmId": "511400",
                    "name": "眉山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511502",
                            "name": "翠屏区"
                        },
                        {
                            "dmId": "511521",
                            "name": "宜宾县"
                        },
                        {
                            "dmId": "511522",
                            "name": "南溪区"
                        },
                        {
                            "dmId": "511523",
                            "name": "江安县"
                        },
                        {
                            "dmId": "511524",
                            "name": "长宁县"
                        },
                        {
                            "dmId": "511525",
                            "name": "高县"
                        },
                        {
                            "dmId": "511526",
                            "name": "珙县"
                        },
                        {
                            "dmId": "511527",
                            "name": "筠连县"
                        },
                        {
                            "dmId": "511528",
                            "name": "兴文县"
                        },
                        {
                            "dmId": "511529",
                            "name": "屏山县"
                        }
                    ],
                    "dmId": "511500",
                    "name": "宜宾市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511602",
                            "name": "广安区"
                        },
                        {
                            "dmId": "511603",
                            "name": "前锋区"
                        },
                        {
                            "dmId": "511621",
                            "name": "岳池县"
                        },
                        {
                            "dmId": "511622",
                            "name": "武胜县"
                        },
                        {
                            "dmId": "511623",
                            "name": "邻水县"
                        },
                        {
                            "dmId": "511681",
                            "name": "华蓥市"
                        }
                    ],
                    "dmId": "511600",
                    "name": "广安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511702",
                            "name": "通川区"
                        },
                        {
                            "dmId": "511721",
                            "name": "达川区"
                        },
                        {
                            "dmId": "511722",
                            "name": "宣汉县"
                        },
                        {
                            "dmId": "511723",
                            "name": "开江县"
                        },
                        {
                            "dmId": "511724",
                            "name": "大竹县"
                        },
                        {
                            "dmId": "511725",
                            "name": "渠县"
                        },
                        {
                            "dmId": "511781",
                            "name": "万源市"
                        }
                    ],
                    "dmId": "511700",
                    "name": "达州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511802",
                            "name": "雨城区"
                        },
                        {
                            "dmId": "511821",
                            "name": "名山区"
                        },
                        {
                            "dmId": "511822",
                            "name": "荥经县"
                        },
                        {
                            "dmId": "511823",
                            "name": "汉源县"
                        },
                        {
                            "dmId": "511824",
                            "name": "石棉县"
                        },
                        {
                            "dmId": "511825",
                            "name": "天全县"
                        },
                        {
                            "dmId": "511826",
                            "name": "芦山县"
                        },
                        {
                            "dmId": "511827",
                            "name": "宝兴县"
                        }
                    ],
                    "dmId": "511800",
                    "name": "雅安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "511902",
                            "name": "巴州区"
                        },
                        {
                            "dmId": "511903",
                            "name": "恩阳区"
                        },
                        {
                            "dmId": "511921",
                            "name": "通江县"
                        },
                        {
                            "dmId": "511922",
                            "name": "南江县"
                        },
                        {
                            "dmId": "511923",
                            "name": "平昌县"
                        }
                    ],
                    "dmId": "511900",
                    "name": "巴中市"
                },
                {
                    "childs": [
                        {
                            "dmId": "512002",
                            "name": "雁江区"
                        },
                        {
                            "dmId": "512021",
                            "name": "安岳县"
                        },
                        {
                            "dmId": "512022",
                            "name": "乐至县"
                        },
                        {
                            "dmId": "512081",
                            "name": "简阳市"
                        }
                    ],
                    "dmId": "512000",
                    "name": "资阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "513221",
                            "name": "汶川县"
                        },
                        {
                            "dmId": "513222",
                            "name": "理县"
                        },
                        {
                            "dmId": "513223",
                            "name": "茂县"
                        },
                        {
                            "dmId": "513224",
                            "name": "松潘县"
                        },
                        {
                            "dmId": "513225",
                            "name": "九寨沟县"
                        },
                        {
                            "dmId": "513226",
                            "name": "金川县"
                        },
                        {
                            "dmId": "513227",
                            "name": "小金县"
                        },
                        {
                            "dmId": "513228",
                            "name": "黑水县"
                        },
                        {
                            "dmId": "513229",
                            "name": "马尔康县"
                        },
                        {
                            "dmId": "513230",
                            "name": "壤塘县"
                        },
                        {
                            "dmId": "513231",
                            "name": "阿坝县"
                        },
                        {
                            "dmId": "513232",
                            "name": "若尔盖县"
                        },
                        {
                            "dmId": "513233",
                            "name": "红原县"
                        }
                    ],
                    "dmId": "513200",
                    "name": "阿坝藏族羌族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "513321",
                            "name": "康定县"
                        },
                        {
                            "dmId": "513322",
                            "name": "泸定县"
                        },
                        {
                            "dmId": "513323",
                            "name": "丹巴县"
                        },
                        {
                            "dmId": "513324",
                            "name": "九龙县"
                        },
                        {
                            "dmId": "513325",
                            "name": "雅江县"
                        },
                        {
                            "dmId": "513326",
                            "name": "道孚县"
                        },
                        {
                            "dmId": "513327",
                            "name": "炉霍县"
                        },
                        {
                            "dmId": "513328",
                            "name": "甘孜县"
                        },
                        {
                            "dmId": "513329",
                            "name": "新龙县"
                        },
                        {
                            "dmId": "513330",
                            "name": "德格县"
                        },
                        {
                            "dmId": "513331",
                            "name": "白玉县"
                        },
                        {
                            "dmId": "513332",
                            "name": "石渠县"
                        },
                        {
                            "dmId": "513333",
                            "name": "色达县"
                        },
                        {
                            "dmId": "513334",
                            "name": "理塘县"
                        },
                        {
                            "dmId": "513335",
                            "name": "巴塘县"
                        },
                        {
                            "dmId": "513336",
                            "name": "乡城县"
                        },
                        {
                            "dmId": "513337",
                            "name": "稻城县"
                        },
                        {
                            "dmId": "513338",
                            "name": "得荣县"
                        }
                    ],
                    "dmId": "513300",
                    "name": "甘孜藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "513401",
                            "name": "西昌市"
                        },
                        {
                            "dmId": "513422",
                            "name": "木里藏族自治县"
                        },
                        {
                            "dmId": "513423",
                            "name": "盐源县"
                        },
                        {
                            "dmId": "513424",
                            "name": "德昌县"
                        },
                        {
                            "dmId": "513425",
                            "name": "会理县"
                        },
                        {
                            "dmId": "513426",
                            "name": "会东县"
                        },
                        {
                            "dmId": "513427",
                            "name": "宁南县"
                        },
                        {
                            "dmId": "513428",
                            "name": "普格县"
                        },
                        {
                            "dmId": "513429",
                            "name": "布拖县"
                        },
                        {
                            "dmId": "513430",
                            "name": "金阳县"
                        },
                        {
                            "dmId": "513431",
                            "name": "昭觉县"
                        },
                        {
                            "dmId": "513432",
                            "name": "喜德县"
                        },
                        {
                            "dmId": "513433",
                            "name": "冕宁县"
                        },
                        {
                            "dmId": "513434",
                            "name": "越西县"
                        },
                        {
                            "dmId": "513435",
                            "name": "甘洛县"
                        },
                        {
                            "dmId": "513436",
                            "name": "美姑县"
                        },
                        {
                            "dmId": "513437",
                            "name": "雷波县"
                        }
                    ],
                    "dmId": "513400",
                    "name": "凉山彝族自治州"
                }
            ],
            "dmId": "510000",
            "name": "四川省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "520102",
                            "name": "南明区"
                        },
                        {
                            "dmId": "520103",
                            "name": "云岩区"
                        },
                        {
                            "dmId": "520111",
                            "name": "花溪区"
                        },
                        {
                            "dmId": "520112",
                            "name": "乌当区"
                        },
                        {
                            "dmId": "520113",
                            "name": "白云区"
                        },
                        {
                            "dmId": "520121",
                            "name": "开阳县"
                        },
                        {
                            "dmId": "520122",
                            "name": "息烽县"
                        },
                        {
                            "dmId": "520123",
                            "name": "修文县"
                        },
                        {
                            "dmId": "520151",
                            "name": "观山湖区"
                        },
                        {
                            "dmId": "520181",
                            "name": "清镇市"
                        }
                    ],
                    "dmId": "520100",
                    "name": "贵阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "520201",
                            "name": "钟山区"
                        },
                        {
                            "dmId": "520203",
                            "name": "六枝特区"
                        },
                        {
                            "dmId": "520221",
                            "name": "水城县"
                        },
                        {
                            "dmId": "520222",
                            "name": "盘县"
                        }
                    ],
                    "dmId": "520200",
                    "name": "六盘水市"
                },
                {
                    "childs": [
                        {
                            "dmId": "520302",
                            "name": "红花岗区"
                        },
                        {
                            "dmId": "520303",
                            "name": "汇川区"
                        },
                        {
                            "dmId": "520321",
                            "name": "遵义县"
                        },
                        {
                            "dmId": "520322",
                            "name": "桐梓县"
                        },
                        {
                            "dmId": "520323",
                            "name": "绥阳县"
                        },
                        {
                            "dmId": "520324",
                            "name": "正安县"
                        },
                        {
                            "dmId": "520325",
                            "name": "道真仡佬族苗族自治县"
                        },
                        {
                            "dmId": "520326",
                            "name": "务川仡佬族苗族自治县"
                        },
                        {
                            "dmId": "520327",
                            "name": "凤冈县"
                        },
                        {
                            "dmId": "520328",
                            "name": "湄潭县"
                        },
                        {
                            "dmId": "520329",
                            "name": "余庆县"
                        },
                        {
                            "dmId": "520330",
                            "name": "习水县"
                        },
                        {
                            "dmId": "520381",
                            "name": "赤水市"
                        },
                        {
                            "dmId": "520382",
                            "name": "仁怀市"
                        }
                    ],
                    "dmId": "520300",
                    "name": "遵义市"
                },
                {
                    "childs": [
                        {
                            "dmId": "520402",
                            "name": "西秀区"
                        },
                        {
                            "dmId": "520421",
                            "name": "平坝县"
                        },
                        {
                            "dmId": "520422",
                            "name": "普定县"
                        },
                        {
                            "dmId": "520423",
                            "name": "镇宁布依族苗族自治县"
                        },
                        {
                            "dmId": "520424",
                            "name": "关岭布依族苗族自治县"
                        },
                        {
                            "dmId": "520425",
                            "name": "紫云苗族布依族自治县"
                        }
                    ],
                    "dmId": "520400",
                    "name": "安顺市"
                },
                {
                    "childs": [
                        {
                            "dmId": "522201",
                            "name": "碧江区"
                        },
                        {
                            "dmId": "522222",
                            "name": "江口县"
                        },
                        {
                            "dmId": "522223",
                            "name": "玉屏侗族自治县"
                        },
                        {
                            "dmId": "522224",
                            "name": "石阡县"
                        },
                        {
                            "dmId": "522225",
                            "name": "思南县"
                        },
                        {
                            "dmId": "522226",
                            "name": "印江土家族苗族自治县"
                        },
                        {
                            "dmId": "522227",
                            "name": "德江县"
                        },
                        {
                            "dmId": "522228",
                            "name": "沿河土家族自治县"
                        },
                        {
                            "dmId": "522229",
                            "name": "松桃苗族自治县"
                        },
                        {
                            "dmId": "522230",
                            "name": "万山区"
                        }
                    ],
                    "dmId": "522200",
                    "name": "铜仁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "522301",
                            "name": "兴义市"
                        },
                        {
                            "dmId": "522322",
                            "name": "兴仁县"
                        },
                        {
                            "dmId": "522323",
                            "name": "普安县"
                        },
                        {
                            "dmId": "522324",
                            "name": "晴隆县"
                        },
                        {
                            "dmId": "522325",
                            "name": "贞丰县"
                        },
                        {
                            "dmId": "522326",
                            "name": "望谟县"
                        },
                        {
                            "dmId": "522327",
                            "name": "册亨县"
                        },
                        {
                            "dmId": "522328",
                            "name": "安龙县"
                        }
                    ],
                    "dmId": "522300",
                    "name": "黔西南布依族苗族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "522401",
                            "name": "七星关区"
                        },
                        {
                            "dmId": "522422",
                            "name": "大方县"
                        },
                        {
                            "dmId": "522423",
                            "name": "黔西县"
                        },
                        {
                            "dmId": "522424",
                            "name": "金沙县"
                        },
                        {
                            "dmId": "522425",
                            "name": "织金县"
                        },
                        {
                            "dmId": "522426",
                            "name": "纳雍县"
                        },
                        {
                            "dmId": "522427",
                            "name": "威宁彝族回族苗族自治县"
                        },
                        {
                            "dmId": "522428",
                            "name": "赫章县"
                        }
                    ],
                    "dmId": "522400",
                    "name": "毕节市"
                },
                {
                    "childs": [
                        {
                            "dmId": "522601",
                            "name": "凯里市"
                        },
                        {
                            "dmId": "522622",
                            "name": "黄平县"
                        },
                        {
                            "dmId": "522623",
                            "name": "施秉县"
                        },
                        {
                            "dmId": "522624",
                            "name": "三穗县"
                        },
                        {
                            "dmId": "522625",
                            "name": "镇远县"
                        },
                        {
                            "dmId": "522626",
                            "name": "岑巩县"
                        },
                        {
                            "dmId": "522627",
                            "name": "天柱县"
                        },
                        {
                            "dmId": "522628",
                            "name": "锦屏县"
                        },
                        {
                            "dmId": "522629",
                            "name": "剑河县"
                        },
                        {
                            "dmId": "522630",
                            "name": "台江县"
                        },
                        {
                            "dmId": "522631",
                            "name": "黎平县"
                        },
                        {
                            "dmId": "522632",
                            "name": "榕江县"
                        },
                        {
                            "dmId": "522633",
                            "name": "从江县"
                        },
                        {
                            "dmId": "522634",
                            "name": "雷山县"
                        },
                        {
                            "dmId": "522635",
                            "name": "麻江县"
                        },
                        {
                            "dmId": "522636",
                            "name": "丹寨县"
                        }
                    ],
                    "dmId": "522600",
                    "name": "黔东南苗族侗族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "522701",
                            "name": "都匀市"
                        },
                        {
                            "dmId": "522702",
                            "name": "福泉市"
                        },
                        {
                            "dmId": "522722",
                            "name": "荔波县"
                        },
                        {
                            "dmId": "522723",
                            "name": "贵定县"
                        },
                        {
                            "dmId": "522725",
                            "name": "瓮安县"
                        },
                        {
                            "dmId": "522726",
                            "name": "独山县"
                        },
                        {
                            "dmId": "522727",
                            "name": "平塘县"
                        },
                        {
                            "dmId": "522728",
                            "name": "罗甸县"
                        },
                        {
                            "dmId": "522729",
                            "name": "长顺县"
                        },
                        {
                            "dmId": "522730",
                            "name": "龙里县"
                        },
                        {
                            "dmId": "522731",
                            "name": "惠水县"
                        },
                        {
                            "dmId": "522732",
                            "name": "三都水族自治县"
                        }
                    ],
                    "dmId": "522700",
                    "name": "黔南布依族苗族自治州"
                }
            ],
            "dmId": "520000",
            "name": "贵州省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "530102",
                            "name": "五华区"
                        },
                        {
                            "dmId": "530103",
                            "name": "盘龙区"
                        },
                        {
                            "dmId": "530111",
                            "name": "官渡区"
                        },
                        {
                            "dmId": "530112",
                            "name": "西山区"
                        },
                        {
                            "dmId": "530113",
                            "name": "东川区"
                        },
                        {
                            "dmId": "530121",
                            "name": "呈贡区"
                        },
                        {
                            "dmId": "530122",
                            "name": "晋宁县"
                        },
                        {
                            "dmId": "530124",
                            "name": "富民县"
                        },
                        {
                            "dmId": "530125",
                            "name": "宜良县"
                        },
                        {
                            "dmId": "530126",
                            "name": "石林彝族自治县"
                        },
                        {
                            "dmId": "530127",
                            "name": "嵩明县"
                        },
                        {
                            "dmId": "530128",
                            "name": "禄劝彝族苗族自治县"
                        },
                        {
                            "dmId": "530129",
                            "name": "寻甸回族彝族自治县"
                        },
                        {
                            "dmId": "530181",
                            "name": "安宁市"
                        }
                    ],
                    "dmId": "530100",
                    "name": "昆明市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530302",
                            "name": "麒麟区"
                        },
                        {
                            "dmId": "530321",
                            "name": "马龙县"
                        },
                        {
                            "dmId": "530322",
                            "name": "陆良县"
                        },
                        {
                            "dmId": "530323",
                            "name": "师宗县"
                        },
                        {
                            "dmId": "530324",
                            "name": "罗平县"
                        },
                        {
                            "dmId": "530325",
                            "name": "富源县"
                        },
                        {
                            "dmId": "530326",
                            "name": "会泽县"
                        },
                        {
                            "dmId": "530328",
                            "name": "沾益县"
                        },
                        {
                            "dmId": "530381",
                            "name": "宣威市"
                        }
                    ],
                    "dmId": "530300",
                    "name": "曲靖市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530402",
                            "name": "红塔区"
                        },
                        {
                            "dmId": "530421",
                            "name": "江川县"
                        },
                        {
                            "dmId": "530422",
                            "name": "澄江县"
                        },
                        {
                            "dmId": "530423",
                            "name": "通海县"
                        },
                        {
                            "dmId": "530424",
                            "name": "华宁县"
                        },
                        {
                            "dmId": "530425",
                            "name": "易门县"
                        },
                        {
                            "dmId": "530426",
                            "name": "峨山彝族自治县"
                        },
                        {
                            "dmId": "530427",
                            "name": "新平彝族傣族自治县"
                        },
                        {
                            "dmId": "530428",
                            "name": "元江哈尼族彝族傣族自治县"
                        }
                    ],
                    "dmId": "530400",
                    "name": "玉溪市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530502",
                            "name": "隆阳区"
                        },
                        {
                            "dmId": "530521",
                            "name": "施甸县"
                        },
                        {
                            "dmId": "530522",
                            "name": "腾冲县"
                        },
                        {
                            "dmId": "530523",
                            "name": "龙陵县"
                        },
                        {
                            "dmId": "530524",
                            "name": "昌宁县"
                        }
                    ],
                    "dmId": "530500",
                    "name": "保山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530602",
                            "name": "昭阳区"
                        },
                        {
                            "dmId": "530621",
                            "name": "鲁甸县"
                        },
                        {
                            "dmId": "530622",
                            "name": "巧家县"
                        },
                        {
                            "dmId": "530623",
                            "name": "盐津县"
                        },
                        {
                            "dmId": "530624",
                            "name": "大关县"
                        },
                        {
                            "dmId": "530625",
                            "name": "永善县"
                        },
                        {
                            "dmId": "530626",
                            "name": "绥江县"
                        },
                        {
                            "dmId": "530627",
                            "name": "镇雄县"
                        },
                        {
                            "dmId": "530628",
                            "name": "彝良县"
                        },
                        {
                            "dmId": "530629",
                            "name": "威信县"
                        },
                        {
                            "dmId": "530630",
                            "name": "水富县"
                        }
                    ],
                    "dmId": "530600",
                    "name": "昭通市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530702",
                            "name": "古城区"
                        },
                        {
                            "dmId": "530721",
                            "name": "玉龙纳西族自治县"
                        },
                        {
                            "dmId": "530722",
                            "name": "永胜县"
                        },
                        {
                            "dmId": "530723",
                            "name": "华坪县"
                        },
                        {
                            "dmId": "530724",
                            "name": "宁蒗彝族自治县"
                        }
                    ],
                    "dmId": "530700",
                    "name": "丽江市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530802",
                            "name": "思茅区"
                        },
                        {
                            "dmId": "530821",
                            "name": "宁洱哈尼族彝族自治县"
                        },
                        {
                            "dmId": "530822",
                            "name": "墨江哈尼族自治县"
                        },
                        {
                            "dmId": "530823",
                            "name": "景东彝族自治县"
                        },
                        {
                            "dmId": "530824",
                            "name": "景谷傣族彝族自治县"
                        },
                        {
                            "dmId": "530825",
                            "name": "镇沅彝族哈尼族拉祜族自治县"
                        },
                        {
                            "dmId": "530826",
                            "name": "江城哈尼族彝族自治县"
                        },
                        {
                            "dmId": "530827",
                            "name": "孟连傣族拉祜族佤族自治县"
                        },
                        {
                            "dmId": "530828",
                            "name": "澜沧拉祜族自治县"
                        },
                        {
                            "dmId": "530829",
                            "name": "西盟佤族自治县"
                        }
                    ],
                    "dmId": "530800",
                    "name": "普洱市"
                },
                {
                    "childs": [
                        {
                            "dmId": "530902",
                            "name": "临翔区"
                        },
                        {
                            "dmId": "530921",
                            "name": "凤庆县"
                        },
                        {
                            "dmId": "530922",
                            "name": "云县"
                        },
                        {
                            "dmId": "530923",
                            "name": "永德县"
                        },
                        {
                            "dmId": "530924",
                            "name": "镇康县"
                        },
                        {
                            "dmId": "530925",
                            "name": "双江拉祜族佤族布朗族傣族自治县"
                        },
                        {
                            "dmId": "530926",
                            "name": "耿马傣族佤族自治县"
                        },
                        {
                            "dmId": "530927",
                            "name": "沧源佤族自治县"
                        }
                    ],
                    "dmId": "530900",
                    "name": "临沧市"
                },
                {
                    "childs": [
                        {
                            "dmId": "532301",
                            "name": "楚雄市"
                        },
                        {
                            "dmId": "532322",
                            "name": "双柏县"
                        },
                        {
                            "dmId": "532323",
                            "name": "牟定县"
                        },
                        {
                            "dmId": "532324",
                            "name": "南华县"
                        },
                        {
                            "dmId": "532325",
                            "name": "姚安县"
                        },
                        {
                            "dmId": "532326",
                            "name": "大姚县"
                        },
                        {
                            "dmId": "532327",
                            "name": "永仁县"
                        },
                        {
                            "dmId": "532328",
                            "name": "元谋县"
                        },
                        {
                            "dmId": "532329",
                            "name": "武定县"
                        },
                        {
                            "dmId": "532331",
                            "name": "禄丰县"
                        }
                    ],
                    "dmId": "532300",
                    "name": "楚雄彝族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "532501",
                            "name": "个旧市"
                        },
                        {
                            "dmId": "532502",
                            "name": "开远市"
                        },
                        {
                            "dmId": "532522",
                            "name": "蒙自市"
                        },
                        {
                            "dmId": "532523",
                            "name": "屏边苗族自治县"
                        },
                        {
                            "dmId": "532524",
                            "name": "建水县"
                        },
                        {
                            "dmId": "532525",
                            "name": "石屏县"
                        },
                        {
                            "dmId": "532526",
                            "name": "弥勒市"
                        },
                        {
                            "dmId": "532527",
                            "name": "泸西县"
                        },
                        {
                            "dmId": "532528",
                            "name": "元阳县"
                        },
                        {
                            "dmId": "532529",
                            "name": "红河县"
                        },
                        {
                            "dmId": "532530",
                            "name": "金平苗族瑶族傣族自治县"
                        },
                        {
                            "dmId": "532531",
                            "name": "绿春县"
                        },
                        {
                            "dmId": "532532",
                            "name": "河口瑶族自治县"
                        }
                    ],
                    "dmId": "532500",
                    "name": "红河哈尼族彝族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "532621",
                            "name": "文山市"
                        },
                        {
                            "dmId": "532622",
                            "name": "砚山县"
                        },
                        {
                            "dmId": "532623",
                            "name": "西畴县"
                        },
                        {
                            "dmId": "532624",
                            "name": "麻栗坡县"
                        },
                        {
                            "dmId": "532625",
                            "name": "马关县"
                        },
                        {
                            "dmId": "532626",
                            "name": "丘北县"
                        },
                        {
                            "dmId": "532627",
                            "name": "广南县"
                        },
                        {
                            "dmId": "532628",
                            "name": "富宁县"
                        }
                    ],
                    "dmId": "532600",
                    "name": "文山壮族苗族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "532801",
                            "name": "景洪市"
                        },
                        {
                            "dmId": "532822",
                            "name": "勐海县"
                        },
                        {
                            "dmId": "532823",
                            "name": "勐腊县"
                        }
                    ],
                    "dmId": "532800",
                    "name": "西双版纳傣族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "532901",
                            "name": "大理市"
                        },
                        {
                            "dmId": "532922",
                            "name": "漾濞彝族自治县"
                        },
                        {
                            "dmId": "532923",
                            "name": "祥云县"
                        },
                        {
                            "dmId": "532924",
                            "name": "宾川县"
                        },
                        {
                            "dmId": "532925",
                            "name": "弥渡县"
                        },
                        {
                            "dmId": "532926",
                            "name": "南涧彝族自治县"
                        },
                        {
                            "dmId": "532927",
                            "name": "巍山彝族回族自治县"
                        },
                        {
                            "dmId": "532928",
                            "name": "永平县"
                        },
                        {
                            "dmId": "532929",
                            "name": "云龙县"
                        },
                        {
                            "dmId": "532930",
                            "name": "洱源县"
                        },
                        {
                            "dmId": "532931",
                            "name": "剑川县"
                        },
                        {
                            "dmId": "532932",
                            "name": "鹤庆县"
                        }
                    ],
                    "dmId": "532900",
                    "name": "大理白族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "533102",
                            "name": "瑞丽市"
                        },
                        {
                            "dmId": "533103",
                            "name": "芒市"
                        },
                        {
                            "dmId": "533122",
                            "name": "梁河县"
                        },
                        {
                            "dmId": "533123",
                            "name": "盈江县"
                        },
                        {
                            "dmId": "533124",
                            "name": "陇川县"
                        }
                    ],
                    "dmId": "533100",
                    "name": "德宏傣族景颇族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "533321",
                            "name": "泸水县"
                        },
                        {
                            "dmId": "533323",
                            "name": "福贡县"
                        },
                        {
                            "dmId": "533324",
                            "name": "贡山独龙族怒族自治县"
                        },
                        {
                            "dmId": "533325",
                            "name": "兰坪白族普米族自治县"
                        }
                    ],
                    "dmId": "533300",
                    "name": "怒江傈僳族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "533421",
                            "name": "香格里拉县"
                        },
                        {
                            "dmId": "533422",
                            "name": "德钦县"
                        },
                        {
                            "dmId": "533423",
                            "name": "维西傈僳族自治县"
                        }
                    ],
                    "dmId": "533400",
                    "name": "迪庆藏族自治州"
                }
            ],
            "dmId": "530000",
            "name": "云南省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "540102",
                            "name": "城关区"
                        },
                        {
                            "dmId": "540121",
                            "name": "林周县"
                        },
                        {
                            "dmId": "540122",
                            "name": "当雄县"
                        },
                        {
                            "dmId": "540123",
                            "name": "尼木县"
                        },
                        {
                            "dmId": "540124",
                            "name": "曲水县"
                        },
                        {
                            "dmId": "540125",
                            "name": "堆龙德庆县"
                        },
                        {
                            "dmId": "540126",
                            "name": "达孜县"
                        },
                        {
                            "dmId": "540127",
                            "name": "墨竹工卡县"
                        }
                    ],
                    "dmId": "540100",
                    "name": "拉萨市"
                },
                {
                    "childs": [
                        {
                            "dmId": "542121",
                            "name": "昌都县"
                        },
                        {
                            "dmId": "542122",
                            "name": "江达县"
                        },
                        {
                            "dmId": "542123",
                            "name": "贡觉县"
                        },
                        {
                            "dmId": "542124",
                            "name": "类乌齐县"
                        },
                        {
                            "dmId": "542125",
                            "name": "丁青县"
                        },
                        {
                            "dmId": "542126",
                            "name": "察雅县"
                        },
                        {
                            "dmId": "542127",
                            "name": "八宿县"
                        },
                        {
                            "dmId": "542128",
                            "name": "左贡县"
                        },
                        {
                            "dmId": "542129",
                            "name": "芒康县"
                        },
                        {
                            "dmId": "542132",
                            "name": "洛隆县"
                        },
                        {
                            "dmId": "542133",
                            "name": "边坝县"
                        }
                    ],
                    "dmId": "542100",
                    "name": "昌都地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "542221",
                            "name": "乃东县"
                        },
                        {
                            "dmId": "542222",
                            "name": "扎囊县"
                        },
                        {
                            "dmId": "542223",
                            "name": "贡嘎县"
                        },
                        {
                            "dmId": "542224",
                            "name": "桑日县"
                        },
                        {
                            "dmId": "542225",
                            "name": "琼结县"
                        },
                        {
                            "dmId": "542226",
                            "name": "曲松县"
                        },
                        {
                            "dmId": "542227",
                            "name": "措美县"
                        },
                        {
                            "dmId": "542228",
                            "name": "洛扎县"
                        },
                        {
                            "dmId": "542229",
                            "name": "加查县"
                        },
                        {
                            "dmId": "542231",
                            "name": "隆子县"
                        },
                        {
                            "dmId": "542232",
                            "name": "错那县"
                        },
                        {
                            "dmId": "542233",
                            "name": "浪卡子县"
                        }
                    ],
                    "dmId": "542200",
                    "name": "山南地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "542301",
                            "name": "日喀则市"
                        },
                        {
                            "dmId": "542322",
                            "name": "南木林县"
                        },
                        {
                            "dmId": "542323",
                            "name": "江孜县"
                        },
                        {
                            "dmId": "542324",
                            "name": "定日县"
                        },
                        {
                            "dmId": "542325",
                            "name": "萨迦县"
                        },
                        {
                            "dmId": "542326",
                            "name": "拉孜县"
                        },
                        {
                            "dmId": "542327",
                            "name": "昂仁县"
                        },
                        {
                            "dmId": "542328",
                            "name": "谢通门县"
                        },
                        {
                            "dmId": "542329",
                            "name": "白朗县"
                        },
                        {
                            "dmId": "542330",
                            "name": "仁布县"
                        },
                        {
                            "dmId": "542331",
                            "name": "康马县"
                        },
                        {
                            "dmId": "542332",
                            "name": "定结县"
                        },
                        {
                            "dmId": "542333",
                            "name": "仲巴县"
                        },
                        {
                            "dmId": "542334",
                            "name": "亚东县"
                        },
                        {
                            "dmId": "542335",
                            "name": "吉隆县"
                        },
                        {
                            "dmId": "542336",
                            "name": "聂拉木县"
                        },
                        {
                            "dmId": "542337",
                            "name": "萨嘎县"
                        },
                        {
                            "dmId": "542338",
                            "name": "岗巴县"
                        }
                    ],
                    "dmId": "542300",
                    "name": "日喀则地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "542421",
                            "name": "那曲县"
                        },
                        {
                            "dmId": "542422",
                            "name": "嘉黎县"
                        },
                        {
                            "dmId": "542423",
                            "name": "比如县"
                        },
                        {
                            "dmId": "542424",
                            "name": "聂荣县"
                        },
                        {
                            "dmId": "542425",
                            "name": "安多县"
                        },
                        {
                            "dmId": "542426",
                            "name": "申扎县"
                        },
                        {
                            "dmId": "542427",
                            "name": "索县"
                        },
                        {
                            "dmId": "542428",
                            "name": "班戈县"
                        },
                        {
                            "dmId": "542429",
                            "name": "巴青县"
                        },
                        {
                            "dmId": "542430",
                            "name": "尼玛县"
                        },
                        {
                            "dmId": "542432",
                            "name": "双湖县"
                        }
                    ],
                    "dmId": "542400",
                    "name": "那曲地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "542521",
                            "name": "普兰县"
                        },
                        {
                            "dmId": "542522",
                            "name": "札达县"
                        },
                        {
                            "dmId": "542523",
                            "name": "噶尔县"
                        },
                        {
                            "dmId": "542524",
                            "name": "日土县"
                        },
                        {
                            "dmId": "542525",
                            "name": "革吉县"
                        },
                        {
                            "dmId": "542526",
                            "name": "改则县"
                        },
                        {
                            "dmId": "542527",
                            "name": "措勤县"
                        }
                    ],
                    "dmId": "542500",
                    "name": "阿里地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "542621",
                            "name": "林芝县"
                        },
                        {
                            "dmId": "542622",
                            "name": "工布江达县"
                        },
                        {
                            "dmId": "542623",
                            "name": "米林县"
                        },
                        {
                            "dmId": "542624",
                            "name": "墨脱县"
                        },
                        {
                            "dmId": "542625",
                            "name": "波密县"
                        },
                        {
                            "dmId": "542626",
                            "name": "察隅县"
                        },
                        {
                            "dmId": "542627",
                            "name": "朗县"
                        }
                    ],
                    "dmId": "542600",
                    "name": "林芝地区"
                }
            ],
            "dmId": "540000",
            "name": "西藏自治区"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "610102",
                            "name": "新城区"
                        },
                        {
                            "dmId": "610103",
                            "name": "碑林区"
                        },
                        {
                            "dmId": "610104",
                            "name": "莲湖区"
                        },
                        {
                            "dmId": "610111",
                            "name": "灞桥区"
                        },
                        {
                            "dmId": "610112",
                            "name": "未央区"
                        },
                        {
                            "dmId": "610113",
                            "name": "雁塔区"
                        },
                        {
                            "dmId": "610114",
                            "name": "阎良区"
                        },
                        {
                            "dmId": "610115",
                            "name": "临潼区"
                        },
                        {
                            "dmId": "610116",
                            "name": "长安区"
                        },
                        {
                            "dmId": "610122",
                            "name": "蓝田县"
                        },
                        {
                            "dmId": "610124",
                            "name": "周至县"
                        },
                        {
                            "dmId": "610125",
                            "name": "户县"
                        },
                        {
                            "dmId": "610126",
                            "name": "高陵县"
                        }
                    ],
                    "dmId": "610100",
                    "name": "西安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610202",
                            "name": "王益区"
                        },
                        {
                            "dmId": "610203",
                            "name": "印台区"
                        },
                        {
                            "dmId": "610204",
                            "name": "耀州区"
                        },
                        {
                            "dmId": "610222",
                            "name": "宜君县"
                        }
                    ],
                    "dmId": "610200",
                    "name": "铜川市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610302",
                            "name": "渭滨区"
                        },
                        {
                            "dmId": "610303",
                            "name": "金台区"
                        },
                        {
                            "dmId": "610304",
                            "name": "陈仓区"
                        },
                        {
                            "dmId": "610322",
                            "name": "凤翔县"
                        },
                        {
                            "dmId": "610323",
                            "name": "岐山县"
                        },
                        {
                            "dmId": "610324",
                            "name": "扶风县"
                        },
                        {
                            "dmId": "610326",
                            "name": "眉县"
                        },
                        {
                            "dmId": "610327",
                            "name": "陇县"
                        },
                        {
                            "dmId": "610328",
                            "name": "千阳县"
                        },
                        {
                            "dmId": "610329",
                            "name": "麟游县"
                        },
                        {
                            "dmId": "610330",
                            "name": "凤县"
                        },
                        {
                            "dmId": "610331",
                            "name": "太白县"
                        }
                    ],
                    "dmId": "610300",
                    "name": "宝鸡市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610402",
                            "name": "秦都区"
                        },
                        {
                            "dmId": "610403",
                            "name": "杨陵区"
                        },
                        {
                            "dmId": "610404",
                            "name": "渭城区"
                        },
                        {
                            "dmId": "610422",
                            "name": "三原县"
                        },
                        {
                            "dmId": "610423",
                            "name": "泾阳县"
                        },
                        {
                            "dmId": "610424",
                            "name": "乾县"
                        },
                        {
                            "dmId": "610425",
                            "name": "礼泉县"
                        },
                        {
                            "dmId": "610426",
                            "name": "永寿县"
                        },
                        {
                            "dmId": "610427",
                            "name": "彬县"
                        },
                        {
                            "dmId": "610428",
                            "name": "长武县"
                        },
                        {
                            "dmId": "610429",
                            "name": "旬邑县"
                        },
                        {
                            "dmId": "610430",
                            "name": "淳化县"
                        },
                        {
                            "dmId": "610431",
                            "name": "武功县"
                        },
                        {
                            "dmId": "610481",
                            "name": "兴平市"
                        }
                    ],
                    "dmId": "610400",
                    "name": "咸阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610502",
                            "name": "临渭区"
                        },
                        {
                            "dmId": "610521",
                            "name": "华县"
                        },
                        {
                            "dmId": "610522",
                            "name": "潼关县"
                        },
                        {
                            "dmId": "610523",
                            "name": "大荔县"
                        },
                        {
                            "dmId": "610524",
                            "name": "合阳县"
                        },
                        {
                            "dmId": "610525",
                            "name": "澄城县"
                        },
                        {
                            "dmId": "610526",
                            "name": "蒲城县"
                        },
                        {
                            "dmId": "610527",
                            "name": "白水县"
                        },
                        {
                            "dmId": "610528",
                            "name": "富平县"
                        },
                        {
                            "dmId": "610581",
                            "name": "韩城市"
                        },
                        {
                            "dmId": "610582",
                            "name": "华阴市"
                        }
                    ],
                    "dmId": "610500",
                    "name": "渭南市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610602",
                            "name": "宝塔区"
                        },
                        {
                            "dmId": "610621",
                            "name": "延长县"
                        },
                        {
                            "dmId": "610622",
                            "name": "延川县"
                        },
                        {
                            "dmId": "610623",
                            "name": "子长县"
                        },
                        {
                            "dmId": "610624",
                            "name": "安塞县"
                        },
                        {
                            "dmId": "610625",
                            "name": "志丹县"
                        },
                        {
                            "dmId": "610626",
                            "name": "吴起县"
                        },
                        {
                            "dmId": "610627",
                            "name": "甘泉县"
                        },
                        {
                            "dmId": "610628",
                            "name": "富县"
                        },
                        {
                            "dmId": "610629",
                            "name": "洛川县"
                        },
                        {
                            "dmId": "610630",
                            "name": "宜川县"
                        },
                        {
                            "dmId": "610631",
                            "name": "黄龙县"
                        },
                        {
                            "dmId": "610632",
                            "name": "黄陵县"
                        }
                    ],
                    "dmId": "610600",
                    "name": "延安市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610702",
                            "name": "汉台区"
                        },
                        {
                            "dmId": "610721",
                            "name": "南郑县"
                        },
                        {
                            "dmId": "610722",
                            "name": "城固县"
                        },
                        {
                            "dmId": "610723",
                            "name": "洋县"
                        },
                        {
                            "dmId": "610724",
                            "name": "西乡县"
                        },
                        {
                            "dmId": "610725",
                            "name": "勉县"
                        },
                        {
                            "dmId": "610726",
                            "name": "宁强县"
                        },
                        {
                            "dmId": "610727",
                            "name": "略阳县"
                        },
                        {
                            "dmId": "610728",
                            "name": "镇巴县"
                        },
                        {
                            "dmId": "610729",
                            "name": "留坝县"
                        },
                        {
                            "dmId": "610730",
                            "name": "佛坪县"
                        }
                    ],
                    "dmId": "610700",
                    "name": "汉中市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610802",
                            "name": "榆阳区"
                        },
                        {
                            "dmId": "610821",
                            "name": "神木县"
                        },
                        {
                            "dmId": "610822",
                            "name": "府谷县"
                        },
                        {
                            "dmId": "610823",
                            "name": "横山县"
                        },
                        {
                            "dmId": "610824",
                            "name": "靖边县"
                        },
                        {
                            "dmId": "610825",
                            "name": "定边县"
                        },
                        {
                            "dmId": "610826",
                            "name": "绥德县"
                        },
                        {
                            "dmId": "610827",
                            "name": "米脂县"
                        },
                        {
                            "dmId": "610828",
                            "name": "佳县"
                        },
                        {
                            "dmId": "610829",
                            "name": "吴堡县"
                        },
                        {
                            "dmId": "610830",
                            "name": "清涧县"
                        },
                        {
                            "dmId": "610831",
                            "name": "子洲县"
                        }
                    ],
                    "dmId": "610800",
                    "name": "榆林市"
                },
                {
                    "childs": [
                        {
                            "dmId": "610902",
                            "name": "汉滨区"
                        },
                        {
                            "dmId": "610921",
                            "name": "汉阴县"
                        },
                        {
                            "dmId": "610922",
                            "name": "石泉县"
                        },
                        {
                            "dmId": "610923",
                            "name": "宁陕县"
                        },
                        {
                            "dmId": "610924",
                            "name": "紫阳县"
                        },
                        {
                            "dmId": "610925",
                            "name": "岚皋县"
                        },
                        {
                            "dmId": "610926",
                            "name": "平利县"
                        },
                        {
                            "dmId": "610927",
                            "name": "镇坪县"
                        },
                        {
                            "dmId": "610928",
                            "name": "旬阳县"
                        },
                        {
                            "dmId": "610929",
                            "name": "白河县"
                        }
                    ],
                    "dmId": "610900",
                    "name": "安康市"
                },
                {
                    "childs": [
                        {
                            "dmId": "611002",
                            "name": "商州区"
                        },
                        {
                            "dmId": "611021",
                            "name": "洛南县"
                        },
                        {
                            "dmId": "611022",
                            "name": "丹凤县"
                        },
                        {
                            "dmId": "611023",
                            "name": "商南县"
                        },
                        {
                            "dmId": "611024",
                            "name": "山阳县"
                        },
                        {
                            "dmId": "611025",
                            "name": "镇安县"
                        },
                        {
                            "dmId": "611026",
                            "name": "柞水县"
                        }
                    ],
                    "dmId": "611000",
                    "name": "商洛市"
                }
            ],
            "dmId": "610000",
            "name": "陕西省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "620102",
                            "name": "城关区"
                        },
                        {
                            "dmId": "620103",
                            "name": "七里河区"
                        },
                        {
                            "dmId": "620104",
                            "name": "西固区"
                        },
                        {
                            "dmId": "620105",
                            "name": "安宁区"
                        },
                        {
                            "dmId": "620111",
                            "name": "红古区"
                        },
                        {
                            "dmId": "620121",
                            "name": "永登县"
                        },
                        {
                            "dmId": "620122",
                            "name": "皋兰县"
                        },
                        {
                            "dmId": "620123",
                            "name": "榆中县"
                        }
                    ],
                    "dmId": "620100",
                    "name": "兰州市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620201100",
                            "name": "新城镇"
                        },
                        {
                            "dmId": "620201101",
                            "name": "峪泉镇"
                        },
                        {
                            "dmId": "620201102",
                            "name": "文殊镇"
                        },
                        {
                            "dmId": "620201401",
                            "name": "雄关区"
                        },
                        {
                            "dmId": "620201402",
                            "name": "镜铁区"
                        },
                        {
                            "dmId": "620201403",
                            "name": "长城区"
                        }
                    ],
                    "dmId": "620200",
                    "name": "嘉峪关市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620302",
                            "name": "金川区"
                        },
                        {
                            "dmId": "620321",
                            "name": "永昌县"
                        }
                    ],
                    "dmId": "620300",
                    "name": "金昌市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620402",
                            "name": "白银区"
                        },
                        {
                            "dmId": "620403",
                            "name": "平川区"
                        },
                        {
                            "dmId": "620421",
                            "name": "靖远县"
                        },
                        {
                            "dmId": "620422",
                            "name": "会宁县"
                        },
                        {
                            "dmId": "620423",
                            "name": "景泰县"
                        }
                    ],
                    "dmId": "620400",
                    "name": "白银市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620502",
                            "name": "秦州区"
                        },
                        {
                            "dmId": "620503",
                            "name": "麦积区"
                        },
                        {
                            "dmId": "620521",
                            "name": "清水县"
                        },
                        {
                            "dmId": "620522",
                            "name": "秦安县"
                        },
                        {
                            "dmId": "620523",
                            "name": "甘谷县"
                        },
                        {
                            "dmId": "620524",
                            "name": "武山县"
                        },
                        {
                            "dmId": "620525",
                            "name": "张家川回族自治县"
                        }
                    ],
                    "dmId": "620500",
                    "name": "天水市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620602",
                            "name": "凉州区"
                        },
                        {
                            "dmId": "620621",
                            "name": "民勤县"
                        },
                        {
                            "dmId": "620622",
                            "name": "古浪县"
                        },
                        {
                            "dmId": "620623",
                            "name": "天祝藏族自治县"
                        }
                    ],
                    "dmId": "620600",
                    "name": "武威市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620702",
                            "name": "甘州区"
                        },
                        {
                            "dmId": "620721",
                            "name": "肃南裕固族自治县"
                        },
                        {
                            "dmId": "620722",
                            "name": "民乐县"
                        },
                        {
                            "dmId": "620723",
                            "name": "临泽县"
                        },
                        {
                            "dmId": "620724",
                            "name": "高台县"
                        },
                        {
                            "dmId": "620725",
                            "name": "山丹县"
                        }
                    ],
                    "dmId": "620700",
                    "name": "张掖市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620802",
                            "name": "崆峒区"
                        },
                        {
                            "dmId": "620821",
                            "name": "泾川县"
                        },
                        {
                            "dmId": "620822",
                            "name": "灵台县"
                        },
                        {
                            "dmId": "620823",
                            "name": "崇信县"
                        },
                        {
                            "dmId": "620824",
                            "name": "华亭县"
                        },
                        {
                            "dmId": "620825",
                            "name": "庄浪县"
                        },
                        {
                            "dmId": "620826",
                            "name": "静宁县"
                        }
                    ],
                    "dmId": "620800",
                    "name": "平凉市"
                },
                {
                    "childs": [
                        {
                            "dmId": "620902",
                            "name": "肃州区"
                        },
                        {
                            "dmId": "620921",
                            "name": "金塔县"
                        },
                        {
                            "dmId": "620922",
                            "name": "瓜州县"
                        },
                        {
                            "dmId": "620923",
                            "name": "肃北蒙古族自治县"
                        },
                        {
                            "dmId": "620924",
                            "name": "阿克塞哈萨克族自治县"
                        },
                        {
                            "dmId": "620981",
                            "name": "玉门市"
                        },
                        {
                            "dmId": "620982",
                            "name": "敦煌市"
                        }
                    ],
                    "dmId": "620900",
                    "name": "酒泉市"
                },
                {
                    "childs": [
                        {
                            "dmId": "621002",
                            "name": "西峰区"
                        },
                        {
                            "dmId": "621021",
                            "name": "庆城县"
                        },
                        {
                            "dmId": "621022",
                            "name": "环县"
                        },
                        {
                            "dmId": "621023",
                            "name": "华池县"
                        },
                        {
                            "dmId": "621024",
                            "name": "合水县"
                        },
                        {
                            "dmId": "621025",
                            "name": "正宁县"
                        },
                        {
                            "dmId": "621026",
                            "name": "宁县"
                        },
                        {
                            "dmId": "621027",
                            "name": "镇原县"
                        }
                    ],
                    "dmId": "621000",
                    "name": "庆阳市"
                },
                {
                    "childs": [
                        {
                            "dmId": "621102",
                            "name": "安定区"
                        },
                        {
                            "dmId": "621121",
                            "name": "通渭县"
                        },
                        {
                            "dmId": "621122",
                            "name": "陇西县"
                        },
                        {
                            "dmId": "621123",
                            "name": "渭源县"
                        },
                        {
                            "dmId": "621124",
                            "name": "临洮县"
                        },
                        {
                            "dmId": "621125",
                            "name": "漳县"
                        },
                        {
                            "dmId": "621126",
                            "name": "岷县"
                        }
                    ],
                    "dmId": "621100",
                    "name": "定西市"
                },
                {
                    "childs": [
                        {
                            "dmId": "621202",
                            "name": "武都区"
                        },
                        {
                            "dmId": "621221",
                            "name": "成县"
                        },
                        {
                            "dmId": "621222",
                            "name": "文县"
                        },
                        {
                            "dmId": "621223",
                            "name": "宕昌县"
                        },
                        {
                            "dmId": "621224",
                            "name": "康县"
                        },
                        {
                            "dmId": "621225",
                            "name": "西和县"
                        },
                        {
                            "dmId": "621226",
                            "name": "礼县"
                        },
                        {
                            "dmId": "621227",
                            "name": "徽县"
                        },
                        {
                            "dmId": "621228",
                            "name": "两当县"
                        }
                    ],
                    "dmId": "621200",
                    "name": "陇南市"
                },
                {
                    "childs": [
                        {
                            "dmId": "622901",
                            "name": "临夏市"
                        },
                        {
                            "dmId": "622921",
                            "name": "临夏县"
                        },
                        {
                            "dmId": "622922",
                            "name": "康乐县"
                        },
                        {
                            "dmId": "622923",
                            "name": "永靖县"
                        },
                        {
                            "dmId": "622924",
                            "name": "广河县"
                        },
                        {
                            "dmId": "622925",
                            "name": "和政县"
                        },
                        {
                            "dmId": "622926",
                            "name": "东乡族自治县"
                        },
                        {
                            "dmId": "622927",
                            "name": "积石山保安族东乡族撒拉族自治县"
                        }
                    ],
                    "dmId": "622900",
                    "name": "临夏回族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "623001",
                            "name": "合作市"
                        },
                        {
                            "dmId": "623021",
                            "name": "临潭县"
                        },
                        {
                            "dmId": "623022",
                            "name": "卓尼县"
                        },
                        {
                            "dmId": "623023",
                            "name": "舟曲县"
                        },
                        {
                            "dmId": "623024",
                            "name": "迭部县"
                        },
                        {
                            "dmId": "623025",
                            "name": "玛曲县"
                        },
                        {
                            "dmId": "623026",
                            "name": "碌曲县"
                        },
                        {
                            "dmId": "623027",
                            "name": "夏河县"
                        }
                    ],
                    "dmId": "623000",
                    "name": "甘南藏族自治州"
                }
            ],
            "dmId": "620000",
            "name": "甘肃省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "630102",
                            "name": "城东区"
                        },
                        {
                            "dmId": "630103",
                            "name": "城中区"
                        },
                        {
                            "dmId": "630104",
                            "name": "城西区"
                        },
                        {
                            "dmId": "630105",
                            "name": "城北区"
                        },
                        {
                            "dmId": "630121",
                            "name": "大通回族土族自治县"
                        },
                        {
                            "dmId": "630122",
                            "name": "湟中县"
                        },
                        {
                            "dmId": "630123",
                            "name": "湟源县"
                        }
                    ],
                    "dmId": "630100",
                    "name": "西宁市"
                },
                {
                    "childs": [
                        {
                            "dmId": "632121",
                            "name": "平安县"
                        },
                        {
                            "dmId": "632122",
                            "name": "民和回族土族自治县"
                        },
                        {
                            "dmId": "632123",
                            "name": "乐都区"
                        },
                        {
                            "dmId": "632126",
                            "name": "互助土族自治县"
                        },
                        {
                            "dmId": "632127",
                            "name": "化隆回族自治县"
                        },
                        {
                            "dmId": "632128",
                            "name": "循化撒拉族自治县"
                        }
                    ],
                    "dmId": "632100",
                    "name": "海东市"
                },
                {
                    "childs": [
                        {
                            "dmId": "632221",
                            "name": "门源回族自治县"
                        },
                        {
                            "dmId": "632222",
                            "name": "祁连县"
                        },
                        {
                            "dmId": "632223",
                            "name": "海晏县"
                        },
                        {
                            "dmId": "632224",
                            "name": "刚察县"
                        }
                    ],
                    "dmId": "632200",
                    "name": "海北藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "632321",
                            "name": "同仁县"
                        },
                        {
                            "dmId": "632322",
                            "name": "尖扎县"
                        },
                        {
                            "dmId": "632323",
                            "name": "泽库县"
                        },
                        {
                            "dmId": "632324",
                            "name": "河南蒙古族自治县"
                        }
                    ],
                    "dmId": "632300",
                    "name": "黄南藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "632521",
                            "name": "共和县"
                        },
                        {
                            "dmId": "632522",
                            "name": "同德县"
                        },
                        {
                            "dmId": "632523",
                            "name": "贵德县"
                        },
                        {
                            "dmId": "632524",
                            "name": "兴海县"
                        },
                        {
                            "dmId": "632525",
                            "name": "贵南县"
                        }
                    ],
                    "dmId": "632500",
                    "name": "海南藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "632621",
                            "name": "玛沁县"
                        },
                        {
                            "dmId": "632622",
                            "name": "班玛县"
                        },
                        {
                            "dmId": "632623",
                            "name": "甘德县"
                        },
                        {
                            "dmId": "632624",
                            "name": "达日县"
                        },
                        {
                            "dmId": "632625",
                            "name": "久治县"
                        },
                        {
                            "dmId": "632626",
                            "name": "玛多县"
                        }
                    ],
                    "dmId": "632600",
                    "name": "果洛藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "632721",
                            "name": "玉树市"
                        },
                        {
                            "dmId": "632722",
                            "name": "杂多县"
                        },
                        {
                            "dmId": "632723",
                            "name": "称多县"
                        },
                        {
                            "dmId": "632724",
                            "name": "治多县"
                        },
                        {
                            "dmId": "632725",
                            "name": "囊谦县"
                        },
                        {
                            "dmId": "632726",
                            "name": "曲麻莱县"
                        }
                    ],
                    "dmId": "632700",
                    "name": "玉树藏族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "632801",
                            "name": "格尔木市"
                        },
                        {
                            "dmId": "632802",
                            "name": "德令哈市"
                        },
                        {
                            "dmId": "632821",
                            "name": "乌兰县"
                        },
                        {
                            "dmId": "632822",
                            "name": "都兰县"
                        },
                        {
                            "dmId": "632823",
                            "name": "天峻县"
                        }
                    ],
                    "dmId": "632800",
                    "name": "海西蒙古族藏族自治州"
                }
            ],
            "dmId": "630000",
            "name": "青海省"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "640104",
                            "name": "兴庆区"
                        },
                        {
                            "dmId": "640105",
                            "name": "西夏区"
                        },
                        {
                            "dmId": "640106",
                            "name": "金凤区"
                        },
                        {
                            "dmId": "640121",
                            "name": "永宁县"
                        },
                        {
                            "dmId": "640122",
                            "name": "贺兰县"
                        },
                        {
                            "dmId": "640181",
                            "name": "灵武市"
                        }
                    ],
                    "dmId": "640100",
                    "name": "银川市"
                },
                {
                    "childs": [
                        {
                            "dmId": "640202",
                            "name": "大武口区"
                        },
                        {
                            "dmId": "640205",
                            "name": "惠农区"
                        },
                        {
                            "dmId": "640221",
                            "name": "平罗县"
                        }
                    ],
                    "dmId": "640200",
                    "name": "石嘴山市"
                },
                {
                    "childs": [
                        {
                            "dmId": "640302",
                            "name": "利通区"
                        },
                        {
                            "dmId": "640303",
                            "name": "红寺堡区"
                        },
                        {
                            "dmId": "640323",
                            "name": "盐池县"
                        },
                        {
                            "dmId": "640324",
                            "name": "同心县"
                        },
                        {
                            "dmId": "640381",
                            "name": "青铜峡市"
                        }
                    ],
                    "dmId": "640300",
                    "name": "吴忠市"
                },
                {
                    "childs": [
                        {
                            "dmId": "640402",
                            "name": "原州区"
                        },
                        {
                            "dmId": "640422",
                            "name": "西吉县"
                        },
                        {
                            "dmId": "640423",
                            "name": "隆德县"
                        },
                        {
                            "dmId": "640424",
                            "name": "泾源县"
                        },
                        {
                            "dmId": "640425",
                            "name": "彭阳县"
                        }
                    ],
                    "dmId": "640400",
                    "name": "固原市"
                },
                {
                    "childs": [
                        {
                            "dmId": "640502",
                            "name": "沙坡头区"
                        },
                        {
                            "dmId": "640521",
                            "name": "中宁县"
                        },
                        {
                            "dmId": "640522",
                            "name": "海原县"
                        }
                    ],
                    "dmId": "640500",
                    "name": "中卫市"
                }
            ],
            "dmId": "640000",
            "name": "宁夏回族自治区"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "650102",
                            "name": "天山区"
                        },
                        {
                            "dmId": "650103",
                            "name": "沙依巴克区"
                        },
                        {
                            "dmId": "650104",
                            "name": "新市区"
                        },
                        {
                            "dmId": "650105",
                            "name": "水磨沟区"
                        },
                        {
                            "dmId": "650106",
                            "name": "头屯河区"
                        },
                        {
                            "dmId": "650107",
                            "name": "达坂城区"
                        },
                        {
                            "dmId": "650109",
                            "name": "米东区"
                        },
                        {
                            "dmId": "650121",
                            "name": "乌鲁木齐县"
                        }
                    ],
                    "dmId": "650100",
                    "name": "乌鲁木齐市"
                },
                {
                    "childs": [
                        {
                            "dmId": "650202",
                            "name": "独山子区"
                        },
                        {
                            "dmId": "650203",
                            "name": "克拉玛依区"
                        },
                        {
                            "dmId": "650204",
                            "name": "白碱滩区"
                        },
                        {
                            "dmId": "650205",
                            "name": "乌尔禾区"
                        }
                    ],
                    "dmId": "650200",
                    "name": "克拉玛依市"
                },
                {
                    "childs": [
                        {
                            "dmId": "652101",
                            "name": "吐鲁番市"
                        },
                        {
                            "dmId": "652122",
                            "name": "鄯善县"
                        },
                        {
                            "dmId": "652123",
                            "name": "托克逊县"
                        }
                    ],
                    "dmId": "652100",
                    "name": "吐鲁番地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "652201",
                            "name": "哈密市"
                        },
                        {
                            "dmId": "652222",
                            "name": "巴里坤哈萨克自治县"
                        },
                        {
                            "dmId": "652223",
                            "name": "伊吾县"
                        }
                    ],
                    "dmId": "652200",
                    "name": "哈密地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "652301",
                            "name": "昌吉市"
                        },
                        {
                            "dmId": "652302",
                            "name": "阜康市"
                        },
                        {
                            "dmId": "652323",
                            "name": "呼图壁县"
                        },
                        {
                            "dmId": "652324",
                            "name": "玛纳斯县"
                        },
                        {
                            "dmId": "652325",
                            "name": "奇台县"
                        },
                        {
                            "dmId": "652327",
                            "name": "吉木萨尔县"
                        },
                        {
                            "dmId": "652328",
                            "name": "木垒哈萨克自治县"
                        }
                    ],
                    "dmId": "652300",
                    "name": "昌吉回族自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "652701",
                            "name": "博乐市"
                        },
                        {
                            "dmId": "652702",
                            "name": "阿拉山口市"
                        },
                        {
                            "dmId": "652722",
                            "name": "精河县"
                        },
                        {
                            "dmId": "652723",
                            "name": "温泉县"
                        }
                    ],
                    "dmId": "652700",
                    "name": "博尔塔拉蒙古自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "652801",
                            "name": "库尔勒市"
                        },
                        {
                            "dmId": "652822",
                            "name": "轮台县"
                        },
                        {
                            "dmId": "652823",
                            "name": "尉犁县"
                        },
                        {
                            "dmId": "652824",
                            "name": "若羌县"
                        },
                        {
                            "dmId": "652825",
                            "name": "且末县"
                        },
                        {
                            "dmId": "652826",
                            "name": "焉耆回族自治县"
                        },
                        {
                            "dmId": "652827",
                            "name": "和静县"
                        },
                        {
                            "dmId": "652828",
                            "name": "和硕县"
                        },
                        {
                            "dmId": "652829",
                            "name": "博湖县"
                        }
                    ],
                    "dmId": "652800",
                    "name": "巴音郭楞蒙古自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "652901",
                            "name": "阿克苏市"
                        },
                        {
                            "dmId": "652922",
                            "name": "温宿县"
                        },
                        {
                            "dmId": "652923",
                            "name": "库车县"
                        },
                        {
                            "dmId": "652924",
                            "name": "沙雅县"
                        },
                        {
                            "dmId": "652925",
                            "name": "新和县"
                        },
                        {
                            "dmId": "652926",
                            "name": "拜城县"
                        },
                        {
                            "dmId": "652927",
                            "name": "乌什县"
                        },
                        {
                            "dmId": "652928",
                            "name": "阿瓦提县"
                        },
                        {
                            "dmId": "652929",
                            "name": "柯坪县"
                        }
                    ],
                    "dmId": "652900",
                    "name": "阿克苏地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "653001",
                            "name": "阿图什市"
                        },
                        {
                            "dmId": "653022",
                            "name": "阿克陶县"
                        },
                        {
                            "dmId": "653023",
                            "name": "阿合奇县"
                        },
                        {
                            "dmId": "653024",
                            "name": "乌恰县"
                        }
                    ],
                    "dmId": "653000",
                    "name": "克孜勒苏柯尔克孜自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "653101",
                            "name": "喀什市"
                        },
                        {
                            "dmId": "653121",
                            "name": "疏附县"
                        },
                        {
                            "dmId": "653122",
                            "name": "疏勒县"
                        },
                        {
                            "dmId": "653123",
                            "name": "英吉沙县"
                        },
                        {
                            "dmId": "653124",
                            "name": "泽普县"
                        },
                        {
                            "dmId": "653125",
                            "name": "莎车县"
                        },
                        {
                            "dmId": "653126",
                            "name": "叶城县"
                        },
                        {
                            "dmId": "653127",
                            "name": "麦盖提县"
                        },
                        {
                            "dmId": "653128",
                            "name": "岳普湖县"
                        },
                        {
                            "dmId": "653129",
                            "name": "伽师县"
                        },
                        {
                            "dmId": "653130",
                            "name": "巴楚县"
                        },
                        {
                            "dmId": "653131",
                            "name": "塔什库尔干塔吉克自治县"
                        }
                    ],
                    "dmId": "653100",
                    "name": "喀什地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "653201",
                            "name": "和田市"
                        },
                        {
                            "dmId": "653221",
                            "name": "和田县"
                        },
                        {
                            "dmId": "653222",
                            "name": "墨玉县"
                        },
                        {
                            "dmId": "653223",
                            "name": "皮山县"
                        },
                        {
                            "dmId": "653224",
                            "name": "洛浦县"
                        },
                        {
                            "dmId": "653225",
                            "name": "策勒县"
                        },
                        {
                            "dmId": "653226",
                            "name": "于田县"
                        },
                        {
                            "dmId": "653227",
                            "name": "民丰县"
                        }
                    ],
                    "dmId": "653200",
                    "name": "和田地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "654002",
                            "name": "伊宁市"
                        },
                        {
                            "dmId": "654003",
                            "name": "奎屯市"
                        },
                        {
                            "dmId": "654021",
                            "name": "伊宁县"
                        },
                        {
                            "dmId": "654022",
                            "name": "察布查尔锡伯自治县"
                        },
                        {
                            "dmId": "654023",
                            "name": "霍城县"
                        },
                        {
                            "dmId": "654024",
                            "name": "巩留县"
                        },
                        {
                            "dmId": "654025",
                            "name": "新源县"
                        },
                        {
                            "dmId": "654026",
                            "name": "昭苏县"
                        },
                        {
                            "dmId": "654027",
                            "name": "特克斯县"
                        },
                        {
                            "dmId": "654028",
                            "name": "尼勒克县"
                        }
                    ],
                    "dmId": "654000",
                    "name": "伊犁哈萨克自治州"
                },
                {
                    "childs": [
                        {
                            "dmId": "654201",
                            "name": "塔城市"
                        },
                        {
                            "dmId": "654202",
                            "name": "乌苏市"
                        },
                        {
                            "dmId": "654221",
                            "name": "额敏县"
                        },
                        {
                            "dmId": "654223",
                            "name": "沙湾县"
                        },
                        {
                            "dmId": "654224",
                            "name": "托里县"
                        },
                        {
                            "dmId": "654225",
                            "name": "裕民县"
                        },
                        {
                            "dmId": "654226",
                            "name": "和布克赛尔蒙古自治县"
                        }
                    ],
                    "dmId": "654200",
                    "name": "塔城地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "654301",
                            "name": "阿勒泰市"
                        },
                        {
                            "dmId": "654321",
                            "name": "布尔津县"
                        },
                        {
                            "dmId": "654322",
                            "name": "富蕴县"
                        },
                        {
                            "dmId": "654323",
                            "name": "福海县"
                        },
                        {
                            "dmId": "654324",
                            "name": "哈巴河县"
                        },
                        {
                            "dmId": "654325",
                            "name": "青河县"
                        },
                        {
                            "dmId": "654326",
                            "name": "吉木乃县"
                        }
                    ],
                    "dmId": "654300",
                    "name": "阿勒泰地区"
                },
                {
                    "childs": [
                        {
                            "dmId": "659001",
                            "name": "石河子市"
                        },
                        {
                            "dmId": "659002",
                            "name": "阿拉尔市"
                        },
                        {
                            "dmId": "659003",
                            "name": "图木舒克市"
                        },
                        {
                            "dmId": "659004",
                            "name": "五家渠市"
                        }
                    ],
                    "dmId": "659000",
                    "name": "直辖县级"
                }
            ],
            "dmId": "650000",
            "name": "新疆维吾尔自治区"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "710101",
                            "name": "中正区"
                        },
                        {
                            "dmId": "710102",
                            "name": "大同区"
                        },
                        {
                            "dmId": "710103",
                            "name": "中山区"
                        },
                        {
                            "dmId": "710104",
                            "name": "松山区"
                        },
                        {
                            "dmId": "710105",
                            "name": "大安区"
                        },
                        {
                            "dmId": "710106",
                            "name": "万华区"
                        },
                        {
                            "dmId": "710107",
                            "name": "信义区"
                        },
                        {
                            "dmId": "710108",
                            "name": "士林区"
                        },
                        {
                            "dmId": "710109",
                            "name": "北投区"
                        },
                        {
                            "dmId": "710110",
                            "name": "内湖区"
                        },
                        {
                            "dmId": "710111",
                            "name": "南港区"
                        },
                        {
                            "dmId": "710112",
                            "name": "文山区"
                        }
                    ],
                    "dmId": "710100",
                    "name": "台北市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710201",
                            "name": "新兴区"
                        },
                        {
                            "dmId": "710202",
                            "name": "前金区"
                        },
                        {
                            "dmId": "710203",
                            "name": "芩雅区"
                        },
                        {
                            "dmId": "710204",
                            "name": "盐埕区"
                        },
                        {
                            "dmId": "710205",
                            "name": "鼓山区"
                        },
                        {
                            "dmId": "710206",
                            "name": "旗津区"
                        },
                        {
                            "dmId": "710207",
                            "name": "前镇区"
                        },
                        {
                            "dmId": "710208",
                            "name": "三民区"
                        },
                        {
                            "dmId": "710209",
                            "name": "左营区"
                        },
                        {
                            "dmId": "710210",
                            "name": "楠梓区"
                        },
                        {
                            "dmId": "710211",
                            "name": "小港区"
                        },
                        {
                            "dmId": "710241",
                            "name": "苓雅区"
                        },
                        {
                            "dmId": "710242",
                            "name": "仁武区"
                        },
                        {
                            "dmId": "710243",
                            "name": "大社区"
                        },
                        {
                            "dmId": "710244",
                            "name": "冈山区"
                        },
                        {
                            "dmId": "710245",
                            "name": "路竹区"
                        },
                        {
                            "dmId": "710246",
                            "name": "阿莲区"
                        },
                        {
                            "dmId": "710247",
                            "name": "田寮区"
                        },
                        {
                            "dmId": "710248",
                            "name": "燕巢区"
                        },
                        {
                            "dmId": "710249",
                            "name": "桥头区"
                        },
                        {
                            "dmId": "710250",
                            "name": "梓官区"
                        },
                        {
                            "dmId": "710251",
                            "name": "弥陀区"
                        },
                        {
                            "dmId": "710252",
                            "name": "永安区"
                        },
                        {
                            "dmId": "710253",
                            "name": "湖内区"
                        },
                        {
                            "dmId": "710254",
                            "name": "凤山区"
                        },
                        {
                            "dmId": "710255",
                            "name": "大寮区"
                        },
                        {
                            "dmId": "710256",
                            "name": "林园区"
                        },
                        {
                            "dmId": "710257",
                            "name": "鸟松区"
                        },
                        {
                            "dmId": "710258",
                            "name": "大树区"
                        },
                        {
                            "dmId": "710259",
                            "name": "旗山区"
                        },
                        {
                            "dmId": "710260",
                            "name": "美浓区"
                        },
                        {
                            "dmId": "710261",
                            "name": "六龟区"
                        },
                        {
                            "dmId": "710262",
                            "name": "内门区"
                        },
                        {
                            "dmId": "710263",
                            "name": "杉林区"
                        },
                        {
                            "dmId": "710264",
                            "name": "甲仙区"
                        },
                        {
                            "dmId": "710265",
                            "name": "桃源区"
                        },
                        {
                            "dmId": "710266",
                            "name": "那玛夏区"
                        },
                        {
                            "dmId": "710267",
                            "name": "茂林区"
                        },
                        {
                            "dmId": "710268",
                            "name": "茄萣区"
                        }
                    ],
                    "dmId": "710200",
                    "name": "高雄市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710301",
                            "name": "中西区"
                        },
                        {
                            "dmId": "710302",
                            "name": "东区"
                        },
                        {
                            "dmId": "710303",
                            "name": "南区"
                        },
                        {
                            "dmId": "710304",
                            "name": "北区"
                        },
                        {
                            "dmId": "710305",
                            "name": "安平区"
                        },
                        {
                            "dmId": "710306",
                            "name": "安南区"
                        },
                        {
                            "dmId": "710339",
                            "name": "永康区"
                        },
                        {
                            "dmId": "710340",
                            "name": "归仁区"
                        },
                        {
                            "dmId": "710341",
                            "name": "新化区"
                        },
                        {
                            "dmId": "710342",
                            "name": "左镇区"
                        },
                        {
                            "dmId": "710343",
                            "name": "玉井区"
                        },
                        {
                            "dmId": "710344",
                            "name": "楠西区"
                        },
                        {
                            "dmId": "710345",
                            "name": "南化区"
                        },
                        {
                            "dmId": "710346",
                            "name": "仁德区"
                        },
                        {
                            "dmId": "710347",
                            "name": "关庙区"
                        },
                        {
                            "dmId": "710348",
                            "name": "龙崎区"
                        },
                        {
                            "dmId": "710349",
                            "name": "官田区"
                        },
                        {
                            "dmId": "710350",
                            "name": "麻豆区"
                        },
                        {
                            "dmId": "710351",
                            "name": "佳里区"
                        },
                        {
                            "dmId": "710352",
                            "name": "西港区"
                        },
                        {
                            "dmId": "710353",
                            "name": "七股区"
                        },
                        {
                            "dmId": "710354",
                            "name": "将军区"
                        },
                        {
                            "dmId": "710355",
                            "name": "学甲区"
                        },
                        {
                            "dmId": "710356",
                            "name": "北门区"
                        },
                        {
                            "dmId": "710357",
                            "name": "新营区"
                        },
                        {
                            "dmId": "710358",
                            "name": "后壁区"
                        },
                        {
                            "dmId": "710359",
                            "name": "白河区"
                        },
                        {
                            "dmId": "710360",
                            "name": "东山区"
                        },
                        {
                            "dmId": "710361",
                            "name": "六甲区"
                        },
                        {
                            "dmId": "710362",
                            "name": "下营区"
                        },
                        {
                            "dmId": "710363",
                            "name": "柳营区"
                        },
                        {
                            "dmId": "710364",
                            "name": "盐水区"
                        },
                        {
                            "dmId": "710365",
                            "name": "善化区"
                        },
                        {
                            "dmId": "710366",
                            "name": "大内区"
                        },
                        {
                            "dmId": "710367",
                            "name": "山上区"
                        },
                        {
                            "dmId": "710368",
                            "name": "新市区"
                        },
                        {
                            "dmId": "710369",
                            "name": "安定区"
                        }
                    ],
                    "dmId": "710300",
                    "name": "台南市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710401",
                            "name": "中区"
                        },
                        {
                            "dmId": "710402",
                            "name": "东区"
                        },
                        {
                            "dmId": "710403",
                            "name": "南区"
                        },
                        {
                            "dmId": "710404",
                            "name": "西区"
                        },
                        {
                            "dmId": "710405",
                            "name": "北区"
                        },
                        {
                            "dmId": "710406",
                            "name": "北屯区"
                        },
                        {
                            "dmId": "710407",
                            "name": "西屯区"
                        },
                        {
                            "dmId": "710408",
                            "name": "南屯区"
                        },
                        {
                            "dmId": "710431",
                            "name": "太平区"
                        },
                        {
                            "dmId": "710432",
                            "name": "大里区"
                        },
                        {
                            "dmId": "710433",
                            "name": "雾峰区"
                        },
                        {
                            "dmId": "710434",
                            "name": "乌日区"
                        },
                        {
                            "dmId": "710435",
                            "name": "丰原区"
                        },
                        {
                            "dmId": "710436",
                            "name": "后里区"
                        },
                        {
                            "dmId": "710437",
                            "name": "石冈区"
                        },
                        {
                            "dmId": "710438",
                            "name": "东势区"
                        },
                        {
                            "dmId": "710439",
                            "name": "和平区"
                        },
                        {
                            "dmId": "710440",
                            "name": "新社区"
                        },
                        {
                            "dmId": "710441",
                            "name": "潭子区"
                        },
                        {
                            "dmId": "710442",
                            "name": "大雅区"
                        },
                        {
                            "dmId": "710443",
                            "name": "神冈区"
                        },
                        {
                            "dmId": "710444",
                            "name": "大肚区"
                        },
                        {
                            "dmId": "710445",
                            "name": "沙鹿区"
                        },
                        {
                            "dmId": "710446",
                            "name": "龙井区"
                        },
                        {
                            "dmId": "710447",
                            "name": "梧栖区"
                        },
                        {
                            "dmId": "710448",
                            "name": "清水区"
                        },
                        {
                            "dmId": "710449",
                            "name": "大甲区"
                        },
                        {
                            "dmId": "710450",
                            "name": "外埔区"
                        },
                        {
                            "dmId": "710451",
                            "name": "大安区"
                        }
                    ],
                    "dmId": "710400",
                    "name": "台中市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710507",
                            "name": "金沙镇"
                        },
                        {
                            "dmId": "710508",
                            "name": "金湖镇"
                        },
                        {
                            "dmId": "710509",
                            "name": "金宁乡"
                        },
                        {
                            "dmId": "710510",
                            "name": "金城镇"
                        },
                        {
                            "dmId": "710511",
                            "name": "烈屿乡"
                        },
                        {
                            "dmId": "710512",
                            "name": "乌坵乡"
                        }
                    ],
                    "dmId": "710500",
                    "name": "金门县"
                },
                {
                    "childs": [
                        {
                            "dmId": "710614",
                            "name": "南投市"
                        },
                        {
                            "dmId": "710615",
                            "name": "中寮乡"
                        },
                        {
                            "dmId": "710616",
                            "name": "草屯镇"
                        },
                        {
                            "dmId": "710617",
                            "name": "国姓乡"
                        },
                        {
                            "dmId": "710618",
                            "name": "埔里镇"
                        },
                        {
                            "dmId": "710619",
                            "name": "仁爱乡"
                        },
                        {
                            "dmId": "710620",
                            "name": "名间乡"
                        },
                        {
                            "dmId": "710621",
                            "name": "集集镇"
                        },
                        {
                            "dmId": "710622",
                            "name": "水里乡"
                        },
                        {
                            "dmId": "710623",
                            "name": "鱼池乡"
                        },
                        {
                            "dmId": "710624",
                            "name": "信义乡"
                        },
                        {
                            "dmId": "710625",
                            "name": "竹山镇"
                        },
                        {
                            "dmId": "710626",
                            "name": "鹿谷乡"
                        }
                    ],
                    "dmId": "710600",
                    "name": "南投县"
                },
                {
                    "childs": [
                        {
                            "dmId": "710701",
                            "name": "仁爱区"
                        },
                        {
                            "dmId": "710702",
                            "name": "信义区"
                        },
                        {
                            "dmId": "710703",
                            "name": "中正区"
                        },
                        {
                            "dmId": "710704",
                            "name": "中山区"
                        },
                        {
                            "dmId": "710705",
                            "name": "安乐区"
                        },
                        {
                            "dmId": "710706",
                            "name": "暖暖区"
                        },
                        {
                            "dmId": "710707",
                            "name": "七堵区"
                        }
                    ],
                    "dmId": "710700",
                    "name": "基隆市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710801",
                            "name": "东区"
                        },
                        {
                            "dmId": "710802",
                            "name": "北区"
                        },
                        {
                            "dmId": "710803",
                            "name": "香山区"
                        }
                    ],
                    "dmId": "710800",
                    "name": "新竹市"
                },
                {
                    "childs": [
                        {
                            "dmId": "710901",
                            "name": "东区"
                        },
                        {
                            "dmId": "710902",
                            "name": "西区"
                        }
                    ],
                    "dmId": "710900",
                    "name": "嘉义市"
                },
                {
                    "childs": [
                        {
                            "dmId": "711130",
                            "name": "万里区"
                        },
                        {
                            "dmId": "711131",
                            "name": "金山区"
                        },
                        {
                            "dmId": "711132",
                            "name": "板桥区"
                        },
                        {
                            "dmId": "711133",
                            "name": "汐止区"
                        },
                        {
                            "dmId": "711134",
                            "name": "深坑区"
                        },
                        {
                            "dmId": "711135",
                            "name": "石碇区"
                        },
                        {
                            "dmId": "711136",
                            "name": "瑞芳区"
                        },
                        {
                            "dmId": "711137",
                            "name": "平溪区"
                        },
                        {
                            "dmId": "711138",
                            "name": "双溪区"
                        },
                        {
                            "dmId": "711139",
                            "name": "贡寮区"
                        },
                        {
                            "dmId": "711140",
                            "name": "新店区"
                        },
                        {
                            "dmId": "711141",
                            "name": "坪林区"
                        },
                        {
                            "dmId": "711142",
                            "name": "乌来区"
                        },
                        {
                            "dmId": "711143",
                            "name": "永和区"
                        },
                        {
                            "dmId": "711144",
                            "name": "中和区"
                        },
                        {
                            "dmId": "711145",
                            "name": "土城区"
                        },
                        {
                            "dmId": "711146",
                            "name": "三峡区"
                        },
                        {
                            "dmId": "711147",
                            "name": "树林区"
                        },
                        {
                            "dmId": "711148",
                            "name": "莺歌区"
                        },
                        {
                            "dmId": "711149",
                            "name": "三重区"
                        },
                        {
                            "dmId": "711150",
                            "name": "新庄区"
                        },
                        {
                            "dmId": "711151",
                            "name": "泰山区"
                        },
                        {
                            "dmId": "711152",
                            "name": "林口区"
                        },
                        {
                            "dmId": "711153",
                            "name": "芦洲区"
                        },
                        {
                            "dmId": "711154",
                            "name": "五股区"
                        },
                        {
                            "dmId": "711155",
                            "name": "八里区"
                        },
                        {
                            "dmId": "711156",
                            "name": "淡水区"
                        },
                        {
                            "dmId": "711157",
                            "name": "三芝区"
                        },
                        {
                            "dmId": "711158",
                            "name": "石门区"
                        }
                    ],
                    "dmId": "711100",
                    "name": "新北市"
                },
                {
                    "childs": [
                        {
                            "dmId": "711214",
                            "name": "宜兰市"
                        },
                        {
                            "dmId": "711215",
                            "name": "头城镇"
                        },
                        {
                            "dmId": "711216",
                            "name": "礁溪乡"
                        },
                        {
                            "dmId": "711217",
                            "name": "壮围乡"
                        },
                        {
                            "dmId": "711218",
                            "name": "员山乡"
                        },
                        {
                            "dmId": "711219",
                            "name": "罗东镇"
                        },
                        {
                            "dmId": "711220",
                            "name": "三星乡"
                        },
                        {
                            "dmId": "711221",
                            "name": "大同乡"
                        },
                        {
                            "dmId": "711222",
                            "name": "五结乡"
                        },
                        {
                            "dmId": "711223",
                            "name": "冬山乡"
                        },
                        {
                            "dmId": "711224",
                            "name": "苏澳镇"
                        },
                        {
                            "dmId": "711225",
                            "name": "南澳乡"
                        },
                        {
                            "dmId": "711226",
                            "name": "钓鱼台"
                        }
                    ],
                    "dmId": "711200",
                    "name": "宜兰县"
                },
                {
                    "childs": [
                        {
                            "dmId": "711314",
                            "name": "竹北市"
                        },
                        {
                            "dmId": "711315",
                            "name": "湖口乡"
                        },
                        {
                            "dmId": "711316",
                            "name": "新丰乡"
                        },
                        {
                            "dmId": "711317",
                            "name": "新埔镇"
                        },
                        {
                            "dmId": "711318",
                            "name": "关西镇"
                        },
                        {
                            "dmId": "711319",
                            "name": "芎林乡"
                        },
                        {
                            "dmId": "711320",
                            "name": "宝山乡"
                        },
                        {
                            "dmId": "711321",
                            "name": "竹东镇"
                        },
                        {
                            "dmId": "711322",
                            "name": "五峰乡"
                        },
                        {
                            "dmId": "711323",
                            "name": "横山乡"
                        },
                        {
                            "dmId": "711324",
                            "name": "尖石乡"
                        },
                        {
                            "dmId": "711325",
                            "name": "北埔乡"
                        },
                        {
                            "dmId": "711326",
                            "name": "峨眉乡"
                        }
                    ],
                    "dmId": "711300",
                    "name": "新竹县"
                },
                {
                    "childs": [
                        {
                            "dmId": "711414",
                            "name": "中坜市"
                        },
                        {
                            "dmId": "711415",
                            "name": "平镇市"
                        },
                        {
                            "dmId": "711416",
                            "name": "龙潭乡"
                        },
                        {
                            "dmId": "711417",
                            "name": "杨梅市"
                        },
                        {
                            "dmId": "711418",
                            "name": "新屋乡"
                        },
                        {
                            "dmId": "711419",
                            "name": "观音乡"
                        },
                        {
                            "dmId": "711420",
                            "name": "桃园市"
                        },
                        {
                            "dmId": "711421",
                            "name": "龟山乡"
                        },
                        {
                            "dmId": "711422",
                            "name": "八德市"
                        },
                        {
                            "dmId": "711423",
                            "name": "大溪镇"
                        },
                        {
                            "dmId": "711424",
                            "name": "复兴乡"
                        },
                        {
                            "dmId": "711425",
                            "name": "大园乡"
                        },
                        {
                            "dmId": "711426",
                            "name": "芦竹乡"
                        }
                    ],
                    "dmId": "711400",
                    "name": "桃园县"
                },
                {
                    "childs": [
                        {
                            "dmId": "711519",
                            "name": "竹南镇"
                        },
                        {
                            "dmId": "711520",
                            "name": "头份镇"
                        },
                        {
                            "dmId": "711521",
                            "name": "三湾乡"
                        },
                        {
                            "dmId": "711522",
                            "name": "南庄乡"
                        },
                        {
                            "dmId": "711523",
                            "name": "狮潭乡"
                        },
                        {
                            "dmId": "711524",
                            "name": "后龙镇"
                        },
                        {
                            "dmId": "711525",
                            "name": "通霄镇"
                        },
                        {
                            "dmId": "711526",
                            "name": "苑里镇"
                        },
                        {
                            "dmId": "711527",
                            "name": "苗栗市"
                        },
                        {
                            "dmId": "711528",
                            "name": "造桥乡"
                        },
                        {
                            "dmId": "711529",
                            "name": "头屋乡"
                        },
                        {
                            "dmId": "711530",
                            "name": "公馆乡"
                        },
                        {
                            "dmId": "711531",
                            "name": "大湖乡"
                        },
                        {
                            "dmId": "711532",
                            "name": "泰安乡"
                        },
                        {
                            "dmId": "711533",
                            "name": "铜锣乡"
                        },
                        {
                            "dmId": "711534",
                            "name": "三义乡"
                        },
                        {
                            "dmId": "711535",
                            "name": "西湖乡"
                        },
                        {
                            "dmId": "711536",
                            "name": "卓兰镇"
                        }
                    ],
                    "dmId": "711500",
                    "name": "苗栗县"
                },
                {
                    "childs": [
                        {
                            "dmId": "711727",
                            "name": "彰化市"
                        },
                        {
                            "dmId": "711728",
                            "name": "芬园乡"
                        },
                        {
                            "dmId": "711729",
                            "name": "花坛乡"
                        },
                        {
                            "dmId": "711730",
                            "name": "秀水乡"
                        },
                        {
                            "dmId": "711731",
                            "name": "鹿港镇"
                        },
                        {
                            "dmId": "711732",
                            "name": "福兴乡"
                        },
                        {
                            "dmId": "711733",
                            "name": "线西乡"
                        },
                        {
                            "dmId": "711734",
                            "name": "和美镇"
                        },
                        {
                            "dmId": "711735",
                            "name": "伸港乡"
                        },
                        {
                            "dmId": "711736",
                            "name": "员林镇"
                        },
                        {
                            "dmId": "711737",
                            "name": "社头乡"
                        },
                        {
                            "dmId": "711738",
                            "name": "永靖乡"
                        },
                        {
                            "dmId": "711739",
                            "name": "埔心乡"
                        },
                        {
                            "dmId": "711740",
                            "name": "溪湖镇"
                        },
                        {
                            "dmId": "711741",
                            "name": "大村乡"
                        },
                        {
                            "dmId": "711742",
                            "name": "埔盐乡"
                        },
                        {
                            "dmId": "711743",
                            "name": "田中镇"
                        },
                        {
                            "dmId": "711744",
                            "name": "北斗镇"
                        },
                        {
                            "dmId": "711745",
                            "name": "田尾乡"
                        },
                        {
                            "dmId": "711746",
                            "name": "埤头乡"
                        },
                        {
                            "dmId": "711747",
                            "name": "溪州乡"
                        },
                        {
                            "dmId": "711748",
                            "name": "竹塘乡"
                        },
                        {
                            "dmId": "711749",
                            "name": "二林镇"
                        },
                        {
                            "dmId": "711750",
                            "name": "大城乡"
                        },
                        {
                            "dmId": "711751",
                            "name": "芳苑乡"
                        },
                        {
                            "dmId": "711752",
                            "name": "二水乡"
                        }
                    ],
                    "dmId": "711700",
                    "name": "彰化县"
                },
                {
                    "childs": [
                        {
                            "dmId": "711919",
                            "name": "番路乡"
                        },
                        {
                            "dmId": "711920",
                            "name": "梅山乡"
                        },
                        {
                            "dmId": "711921",
                            "name": "竹崎乡"
                        },
                        {
                            "dmId": "711922",
                            "name": "阿里山乡"
                        },
                        {
                            "dmId": "711923",
                            "name": "中埔乡"
                        },
                        {
                            "dmId": "711924",
                            "name": "大埔乡"
                        },
                        {
                            "dmId": "711925",
                            "name": "水上乡"
                        },
                        {
                            "dmId": "711926",
                            "name": "鹿草乡"
                        },
                        {
                            "dmId": "711927",
                            "name": "太保市"
                        },
                        {
                            "dmId": "711928",
                            "name": "朴子市"
                        },
                        {
                            "dmId": "711929",
                            "name": "东石乡"
                        },
                        {
                            "dmId": "711930",
                            "name": "六脚乡"
                        },
                        {
                            "dmId": "711931",
                            "name": "新港乡"
                        },
                        {
                            "dmId": "711932",
                            "name": "民雄乡"
                        },
                        {
                            "dmId": "711933",
                            "name": "大林镇"
                        },
                        {
                            "dmId": "711934",
                            "name": "溪口乡"
                        },
                        {
                            "dmId": "711935",
                            "name": "义竹乡"
                        },
                        {
                            "dmId": "711936",
                            "name": "布袋镇"
                        }
                    ],
                    "dmId": "711900",
                    "name": "嘉义县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712121",
                            "name": "斗南镇"
                        },
                        {
                            "dmId": "712122",
                            "name": "大埤乡"
                        },
                        {
                            "dmId": "712123",
                            "name": "虎尾镇"
                        },
                        {
                            "dmId": "712124",
                            "name": "土库镇"
                        },
                        {
                            "dmId": "712125",
                            "name": "褒忠乡"
                        },
                        {
                            "dmId": "712126",
                            "name": "东势乡"
                        },
                        {
                            "dmId": "712127",
                            "name": "台西乡"
                        },
                        {
                            "dmId": "712128",
                            "name": "仑背乡"
                        },
                        {
                            "dmId": "712129",
                            "name": "麦寮乡"
                        },
                        {
                            "dmId": "712130",
                            "name": "斗六市"
                        },
                        {
                            "dmId": "712131",
                            "name": "林内乡"
                        },
                        {
                            "dmId": "712132",
                            "name": "古坑乡"
                        },
                        {
                            "dmId": "712133",
                            "name": "莿桐乡"
                        },
                        {
                            "dmId": "712134",
                            "name": "西螺镇"
                        },
                        {
                            "dmId": "712135",
                            "name": "二仑乡"
                        },
                        {
                            "dmId": "712136",
                            "name": "北港镇"
                        },
                        {
                            "dmId": "712137",
                            "name": "水林乡"
                        },
                        {
                            "dmId": "712138",
                            "name": "口湖乡"
                        },
                        {
                            "dmId": "712139",
                            "name": "四湖乡"
                        },
                        {
                            "dmId": "712140",
                            "name": "元长乡"
                        }
                    ],
                    "dmId": "712100",
                    "name": "云林县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712434",
                            "name": "屏东市"
                        },
                        {
                            "dmId": "712435",
                            "name": "三地门乡"
                        },
                        {
                            "dmId": "712436",
                            "name": "雾台乡"
                        },
                        {
                            "dmId": "712437",
                            "name": "玛家乡"
                        },
                        {
                            "dmId": "712438",
                            "name": "九如乡"
                        },
                        {
                            "dmId": "712439",
                            "name": "里港乡"
                        },
                        {
                            "dmId": "712440",
                            "name": "高树乡"
                        },
                        {
                            "dmId": "712441",
                            "name": "盐埔乡"
                        },
                        {
                            "dmId": "712442",
                            "name": "长治乡"
                        },
                        {
                            "dmId": "712443",
                            "name": "麟洛乡"
                        },
                        {
                            "dmId": "712444",
                            "name": "竹田乡"
                        },
                        {
                            "dmId": "712445",
                            "name": "内埔乡"
                        },
                        {
                            "dmId": "712446",
                            "name": "万丹乡"
                        },
                        {
                            "dmId": "712447",
                            "name": "潮州镇"
                        },
                        {
                            "dmId": "712448",
                            "name": "泰武乡"
                        },
                        {
                            "dmId": "712449",
                            "name": "来义乡"
                        },
                        {
                            "dmId": "712450",
                            "name": "万峦乡"
                        },
                        {
                            "dmId": "712451",
                            "name": "崁顶乡"
                        },
                        {
                            "dmId": "712452",
                            "name": "新埤乡"
                        },
                        {
                            "dmId": "712453",
                            "name": "南州乡"
                        },
                        {
                            "dmId": "712454",
                            "name": "林边乡"
                        },
                        {
                            "dmId": "712455",
                            "name": "东港镇"
                        },
                        {
                            "dmId": "712456",
                            "name": "琉球乡"
                        },
                        {
                            "dmId": "712457",
                            "name": "佳冬乡"
                        },
                        {
                            "dmId": "712458",
                            "name": "新园乡"
                        },
                        {
                            "dmId": "712459",
                            "name": "枋寮乡"
                        },
                        {
                            "dmId": "712460",
                            "name": "枋山乡"
                        },
                        {
                            "dmId": "712461",
                            "name": "春日乡"
                        },
                        {
                            "dmId": "712462",
                            "name": "狮子乡"
                        },
                        {
                            "dmId": "712463",
                            "name": "车城乡"
                        },
                        {
                            "dmId": "712464",
                            "name": "牡丹乡"
                        },
                        {
                            "dmId": "712465",
                            "name": "恒春镇"
                        },
                        {
                            "dmId": "712466",
                            "name": "满州乡"
                        }
                    ],
                    "dmId": "712400",
                    "name": "屏东县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712517",
                            "name": "台东市"
                        },
                        {
                            "dmId": "712518",
                            "name": "绿岛乡"
                        },
                        {
                            "dmId": "712519",
                            "name": "兰屿乡"
                        },
                        {
                            "dmId": "712520",
                            "name": "延平乡"
                        },
                        {
                            "dmId": "712521",
                            "name": "卑南乡"
                        },
                        {
                            "dmId": "712522",
                            "name": "鹿野乡"
                        },
                        {
                            "dmId": "712523",
                            "name": "关山镇"
                        },
                        {
                            "dmId": "712524",
                            "name": "海端乡"
                        },
                        {
                            "dmId": "712525",
                            "name": "池上乡"
                        },
                        {
                            "dmId": "712526",
                            "name": "东河乡"
                        },
                        {
                            "dmId": "712527",
                            "name": "成功镇"
                        },
                        {
                            "dmId": "712528",
                            "name": "长滨乡"
                        },
                        {
                            "dmId": "712529",
                            "name": "金峰乡"
                        },
                        {
                            "dmId": "712530",
                            "name": "大武乡"
                        },
                        {
                            "dmId": "712531",
                            "name": "达仁乡"
                        },
                        {
                            "dmId": "712532",
                            "name": "太麻里乡"
                        }
                    ],
                    "dmId": "712500",
                    "name": "台东县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712615",
                            "name": "花莲市"
                        },
                        {
                            "dmId": "712616",
                            "name": "新城乡"
                        },
                        {
                            "dmId": "712617",
                            "name": "太鲁阁"
                        },
                        {
                            "dmId": "712618",
                            "name": "秀林乡"
                        },
                        {
                            "dmId": "712619",
                            "name": "吉安乡"
                        },
                        {
                            "dmId": "712620",
                            "name": "寿丰乡"
                        },
                        {
                            "dmId": "712621",
                            "name": "凤林镇"
                        },
                        {
                            "dmId": "712622",
                            "name": "光复乡"
                        },
                        {
                            "dmId": "712623",
                            "name": "丰滨乡"
                        },
                        {
                            "dmId": "712624",
                            "name": "瑞穗乡"
                        },
                        {
                            "dmId": "712625",
                            "name": "万荣乡"
                        },
                        {
                            "dmId": "712626",
                            "name": "玉里镇"
                        },
                        {
                            "dmId": "712627",
                            "name": "卓溪乡"
                        },
                        {
                            "dmId": "712628",
                            "name": "富里乡"
                        }
                    ],
                    "dmId": "712600",
                    "name": "花莲县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712707",
                            "name": "马公市"
                        },
                        {
                            "dmId": "712708",
                            "name": "西屿乡"
                        },
                        {
                            "dmId": "712709",
                            "name": "望安乡"
                        },
                        {
                            "dmId": "712710",
                            "name": "七美乡"
                        },
                        {
                            "dmId": "712711",
                            "name": "白沙乡"
                        },
                        {
                            "dmId": "712712",
                            "name": "湖西乡"
                        }
                    ],
                    "dmId": "712700",
                    "name": "澎湖县"
                },
                {
                    "childs": [
                        {
                            "dmId": "712805",
                            "name": "南竿乡"
                        },
                        {
                            "dmId": "712806",
                            "name": "北竿乡"
                        },
                        {
                            "dmId": "712807",
                            "name": "莒光乡"
                        },
                        {
                            "dmId": "712808",
                            "name": "东引乡"
                        }
                    ],
                    "dmId": "712800",
                    "name": "连江县"
                }
            ],
            "dmId": "710000",
            "name": "台湾"
        },
        {
            "childs": [
                {
                    "childs": [
                        {
                            "dmId": "810101",
                            "name": "中西区"
                        },
                        {
                            "dmId": "810102",
                            "name": "湾仔"
                        },
                        {
                            "dmId": "810103",
                            "name": "东区"
                        },
                        {
                            "dmId": "810104",
                            "name": "南区"
                        }
                    ],
                    "dmId": "810100",
                    "name": "香港岛"
                },
                {
                    "childs": [
                        {
                            "dmId": "810201",
                            "name": "九龙城区"
                        },
                        {
                            "dmId": "810202",
                            "name": "油尖旺区"
                        },
                        {
                            "dmId": "810203",
                            "name": "深水埗区"
                        },
                        {
                            "dmId": "810204",
                            "name": "黄大仙区"
                        },
                        {
                            "dmId": "810205",
                            "name": "观塘区"
                        }
                    ],
                    "dmId": "810200",
                    "name": "九龙"
                },
                {
                    "childs": [
                        {
                            "dmId": "810301",
                            "name": "北区"
                        },
                        {
                            "dmId": "810302",
                            "name": "大埔区"
                        },
                        {
                            "dmId": "810303",
                            "name": "沙田区"
                        },
                        {
                            "dmId": "810304",
                            "name": "西贡区"
                        },
                        {
                            "dmId": "810305",
                            "name": "元朗区"
                        },
                        {
                            "dmId": "810306",
                            "name": "屯门区"
                        },
                        {
                            "dmId": "810307",
                            "name": "荃湾区"
                        },
                        {
                            "dmId": "810308",
                            "name": "葵青区"
                        },
                        {
                            "dmId": "810309",
                            "name": "离岛区"
                        }
                    ],
                    "dmId": "810300",
                    "name": "新界"
                }
            ],
            "dmId": "810000",
            "name": "香港特别行政区"
        },
        {
            "childs": [
                {
                    "dmId": "820100",
                    "name": "澳门半岛"
                },
                {
                    "dmId": "820200",
                    "name": "离岛"
                }
            ],
            "dmId": "820000",
            "name": "澳门特别行政区"
        }
    ]
}